{"azurerm-new-relic-monitor": "<h1 id=\"azurerm_new_relic_monitor\">azurerm_new_relic_monitor</h1><p>Manages an Azure Native New Relic Monitor.</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p>resource \"azurerm_resource_group\" \"example\" {<br />  name     = \"example-resources\"<br />  location = \"East US\"<br />}</p><br /><p>resource \"azurerm_new_relic_monitor\" \"example\" {<br />  name                = \"example-nrm\"<br />  resource_group_name = azurerm_resource_group.example.name<br />  location            = azurerm_resource_group.example.location</p><br /><p>plan {<br />    effective_date = \"2023-06-06T00:00:00Z\"<br />  }</p><br /><p>user {<br />    email        = \"user@example.com\"<br />    first_name   = \"Example\"<br />    last_name    = \"User\"<br />    phone_number = \"+12313803556\"<br />  }<br />}</p><br />", "arguments-reference": "<h2 id=\"arguments-reference\">Arguments Reference</h2><p>The following arguments are supported:</p><ul><li><p><code>name</code> - (Required) Specifies the name which should be used for this Azure Native New Relic Monitor. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>resource_group_name</code> - (Required) Specifies the name of the Resource Group where the Azure Native New Relic Monitor should exist. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>location</code> - (Required) Specifies the Azure Region where the Azure Native New Relic Monitor should exist. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>plan</code> - (Required) A <code>plan</code> block as defined below. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>user</code> - (Required) A <code>user</code> block as defined below. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>account_creation_source</code> - (Optional) Specifies the source of account creation. Possible values are <code>LIFTR</code> and <code>NEWRELIC</code>. Defaults to <code>LIFTR</code>. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>account_id</code> - (Optional) Specifies the account id. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>ingestion_key</code> - (Optional) Specifies the ingestion key of account. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>organization_id</code> - (Optional) Specifies the organization id. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>org_creation_source</code> - (Optional) Specifies the source of org creation. Possible values are <code>LIFTR</code> and <code>NEWRELIC</code>. Defaults to <code>LIFTR</code>. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>user_id</code> - (Optional) Specifies the user id. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li></ul><hr /><p>A <code>plan</code> block supports the following:</p><ul><li><p><code>effective_date</code> - (Required) Specifies the date when plan was applied. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>billing_cycle</code> - (Optional) Specifies the billing cycles. Possible values are <code>MONTHLY</code>, <code>WEEKLY</code> and <code>YEARLY</code>. Defaults to <code>MONTHLY</code>. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>plan_id</code> - (Optional) Specifies the plan id published by NewRelic. The only possible value is <code>newrelic-pay-as-you-go-free-live</code>. Defaults to <code>newrelic-pay-as-you-go-free-live</code>. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>usage_type</code> - (Optional) Specifies the usage type. Possible values are <code>COMMITTED</code> and <code>PAYG</code>. Defaults to <code>PAYG</code>. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li></ul><hr /><p>A <code>user</code> block supports the following:</p><ul><li><p><code>email</code> - (Required) Specifies the user Email. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>first_name</code> - (Required) Specifies the first name. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>last_name</code> - (Required) Specifies the last name. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li><li><p><code>phone_number</code> - (Required) Specifies the contact phone number. Changing this forces a new Azure Native New Relic Monitor to be created.</p></li></ul>", "attributes-reference": "<h2 id=\"attributes-reference\">Attributes Reference</h2><p>In addition to the Arguments listed above - the following Attributes are exported:</p><ul><li><code>id</code> - The ID of the Azure Native New Relic Monitor.</li></ul>", "timeouts": "<h2 id=\"timeouts\">Timeouts</h2><p>The <code>timeouts</code> block allows you to specify <a href=\"https://www.terraform.io/docs/configuration/resources.html#timeouts\">timeouts</a> for certain actions:</p><ul><li><code>create</code> - (Defaults to 30 minutes) Used when creating the Azure Native New Relic Monitor.</li><li><code>read</code> - (Defaults to 5 minutes) Used when retrieving the Azure Native New Relic Monitor.</li><li><code>update</code> - (Defaults to 30 minutes) Used when updating the Azure Native New Relic Monitor.</li><li><code>delete</code> - (Defaults to 30 minutes) Used when deleting the Azure Native New Relic Monitor.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>Azure Native New Relic Monitor can be imported using the <code>resource id</code>, e.g.</p><p>shell<br />terraform import azurerm_new_relic_monitor.example /subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/resourceGroup1/providers/NewRelic.Observability/monitors/monitor1</p>", "description": "<h1 id=\"azurerm_new_relic_monitor\">azurerm_new_relic_monitor</h1><p>Manages an Azure Native New Relic Monitor.</p>"}