{"azurerm-servicebus-queue": "<h1 id=\"azurerm_servicebus_queue\">azurerm_servicebus_queue</h1><p>Manages a ServiceBus Queue.</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p>resource \"azurerm_resource_group\" \"example\" {<br />  name     = \"terraform-servicebus\"<br />  location = \"West Europe\"<br />}</p><br /><p>resource \"azurerm_servicebus_namespace\" \"example\" {<br />  name                = \"tfex-servicebus-namespace\"<br />  location            = azurerm_resource_group.example.location<br />  resource_group_name = azurerm_resource_group.example.name<br />  sku                 = \"Standard\"</p><br /><p>tags = {<br />    source = \"terraform\"<br />  }<br />}</p><br /><p>resource \"azurerm_servicebus_queue\" \"example\" {<br />  name         = \"tfex_servicebus_queue\"<br />  namespace_id = azurerm_servicebus_namespace.example.id</p><br /><p>enable_partitioning = true<br />}</p><br />", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>The following arguments are supported:</p><ul><li><p><code>name</code> - (Required) Specifies the name of the ServiceBus Queue resource. Changing this forces a new resource to be created.</p></li><li><p><code>namespace_id</code> - (Required) The ID of the ServiceBus Namespace to create this queue in. Changing this forces a new resource to be created.</p></li><li><p><code>lock_duration</code> - (Optional) The ISO 8601 timespan duration of a peek-lock; that is, the amount of time that the message is locked for other receivers. Maximum value is 5 minutes. Defaults to 1 minute (<code>PT1M</code>).</p></li><li><p><code>max_message_size_in_kilobytes</code> - (Optional) Integer value which controls the maximum size of a message allowed on the queue for Premium SKU. For supported values see the \"Large messages support\" section of <a href=\"https://docs.microsoft.com/azure/service-bus-messaging/service-bus-premium-messaging#large-messages-support-preview\">this document</a>.</p></li><li><p><code>max_size_in_megabytes</code> - (Optional) Integer value which controls the size of memory allocated for the queue. For supported values see the \"Queue or topic size\" section of <a href=\"https://docs.microsoft.com/azure/service-bus-messaging/service-bus-quotas\">Service Bus Quotas</a>. Defaults to <code>1024</code>.</p></li><li><p><code>requires_duplicate_detection</code> - (Optional) Boolean flag which controls whether the Queue requires duplicate detection. Changing this forces a new resource to be created. Defaults to <code>false</code>.</p></li><li><p><code>requires_session</code> - (Optional) Boolean flag which controls whether the Queue requires sessions. This will allow ordered handling of unbounded sequences of related messages. With sessions enabled a queue can guarantee first-in-first-out delivery of messages. Changing this forces a new resource to be created. Defaults to <code>false</code>.</p></li><li><p><code>default_message_ttl</code> - (Optional) The ISO 8601 timespan duration of the TTL of messages sent to this queue. This is the default value used when TTL is not set on message itself.</p></li><li><p><code>dead_lettering_on_message_expiration</code> - (Optional) Boolean flag which controls whether the Queue has dead letter support when a message expires. Defaults to <code>false</code>.</p></li><li><p><code>duplicate_detection_history_time_window</code> - (Optional) The ISO 8601 timespan duration during which duplicates can be detected. Defaults to 10 minutes (<code>PT10M</code>).</p></li><li><p><code>max_delivery_count</code> - (Optional) Integer value which controls when a message is automatically dead lettered. Defaults to <code>10</code>.</p></li><li><p><code>status</code> - (Optional) The status of the Queue. Possible values are <code>Active</code>, <code>Creating</code>, <code>Deleting</code>, <code>Disabled</code>, <code>ReceiveDisabled</code>, <code>Renaming</code>, <code>SendDisabled</code>, <code>Unknown</code>. Note that <code>Restoring</code> is not accepted. Defaults to <code>Active</code>.</p></li><li><p><code>enable_batched_operations</code> - (Optional) Boolean flag which controls whether server-side batched operations are enabled. Defaults to <code>true</code>.</p></li><li><p><code>auto_delete_on_idle</code> - (Optional) The ISO 8601 timespan duration of the idle interval after which the Queue is automatically deleted, minimum of 5 minutes.</p></li><li><p><code>enable_partitioning</code> - (Optional) Boolean flag which controls whether to enable the queue to be partitioned across multiple message brokers. Changing this forces a new resource to be created. Defaults to <code>false</code> for Basic and Standard.</p></li></ul><p>-&gt; <strong>NOTE:</strong> Partitioning is available at entity creation for all queues and topics in Basic or Standard SKUs. It is not available for the Premium messaging SKU, but any previously existing partitioned entities in Premium namespaces continue to work as expected. Please <a href=\"https://docs.microsoft.com/azure/service-bus-messaging/service-bus-partitioning\">see the documentation</a> for more information.</p><ul><li><code>enable_express</code> - (Optional) Boolean flag which controls whether Express Entities are enabled. An express queue holds a message in memory temporarily before writing it to persistent storage. Defaults to <code>false</code> for Basic and Standard. For Premium, it MUST be set to <code>false</code>.</li></ul><p>~&gt; <strong>NOTE:</strong> Service Bus Premium namespaces do not support Express Entities, so <code>enable_express</code> MUST be set to <code>false</code>.</p><ul><li><p><code>forward_to</code> - (Optional) The name of a Queue or Topic to automatically forward messages to. Please <a href=\"https://docs.microsoft.com/azure/service-bus-messaging/service-bus-auto-forwarding\">see the documentation</a> for more information.</p></li><li><p><code>forward_dead_lettered_messages_to</code> - (Optional) The name of a Queue or Topic to automatically forward dead lettered messages to.</p></li></ul>", "attributes-reference": "<h2 id=\"attributes-reference\">Attributes Reference</h2><p>In addition to the Arguments listed above - the following Attributes are exported:</p><ul><li><code>id</code> - The ServiceBus Queue ID.</li></ul>", "timeouts": "<h2 id=\"timeouts\">Timeouts</h2><p>The <code>timeouts</code> block allows you to specify <a href=\"https://www.terraform.io/language/resources/syntax#operation-timeouts\">timeouts</a> for certain actions:</p><ul><li><code>create</code> - (Defaults to 30 minutes) Used when creating the ServiceBus Queue.</li><li><code>update</code> - (Defaults to 30 minutes) Used when updating the ServiceBus Queue.</li><li><code>read</code> - (Defaults to 5 minutes) Used when retrieving the ServiceBus Queue.</li><li><code>delete</code> - (Defaults to 30 minutes) Used when deleting the ServiceBus Queue.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>Service Bus Queue can be imported using the <code>resource id</code>, e.g.</p><p>shell<br />terraform import azurerm_servicebus_queue.example /subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/mygroup1/providers/Microsoft.ServiceBus/namespaces/sbns1/queues/snqueue1</p>", "description": "<h1 id=\"azurerm_servicebus_queue\">azurerm_servicebus_queue</h1><p>Manages a ServiceBus Queue.</p>"}