{"ibm-app": "<h1 id=\"ibm_app\">ibm_app</h1><p>Create, update, or delete a Cloud Foundry app. For more information, about IBM Cloud Pak for application, see <a href=\"https://cloud.ibm.com/docs/cloud-pak-applications?topic=cloud-pak-applications-about\">about IBM applications</a>.</p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><p>The following example creates the <code>my-app</code> Node.js Cloud Foundry app. </p><p>terraform<br />data \"ibm_space\" \"space\" {<br />  org   = \"example.com\"<br />  space = \"dev\"<br />}</p><p>resource \"ibm_app\" \"app\" {<br />  name                 = \"my-app\"<br />  space_guid           = data.ibm_space.space.id<br />  app_path             = \"hello.zip\"<br />  wait_timeout_minutes = 90<br />  buildpack            = \"sdk-for-nodejs\"<br />}<br /></p>", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument reference that you can specify for your resource. </p><ul><li><code>app_path</code>- (Required, String) The path to the compressed file of the app. The compressed file must contain all the app files without subdirectories. To create the compressed file, go to the directory where your app files are and run <code>zip -r myapplication.zip *</code>.</li><li><code>app_version</code>  (Optional, String) The version of the app. If you make changes to the content in the app compressed file specified by <em>app_path</em>,  Terraform can't detect the changes. You can let  Terraform know that your file content has changed by either changing the application compressed file name or by using this argument to indicate the version of the file.</li><li><code>buildpack</code> - (String)  Optional-The buildpack to use when compiling or preparing the app. Provide the buildpack in one of the following ways: <ul><li>Leave it blank for auto-detection.</li><li>Enter the GitHub URL to a buildpack, such as <code>https://github.com/cloudfoundry/nodejs-buildpack.git</code>.</li><li>List the name of an installed buildpack. For example, <code>go_buildpack</code></li></ul>.</li><li><code>command</code> - (Optional, String)  The initial command to run when the app starts.</li><li><code>disk_quota</code> - (Optional, Integer) The maximum amount of disk space, specified in megabytes, that is available to an app instance. The default value is <a href=\"http://bosh.io/jobs/cloud_controller_ng?source=github.com/cloudfoundry/cf-release&amp;version=234#p=cc.default_app_disk_in_mb\">1024 MB</a>.</li><li><code>environment_json</code> (Optional, Map) A list of environment variables to run your app, specified as key-value pairs. Do not provide any key-value pairs for system or service variables.</li><li><code>health_check_http_endpoint</code> - (Optional, String) The endpoint that you want to use to determine if the app is healthy.</li><li><code>health_check_type</code> - (String)  Optional-The type of health check that you want to perform. Supported values are <code>port</code>, and <code>process</code>. The default values is <code>port</code>.</li><li><code>health_check_timeout</code> - (Optional, Integer) The number of seconds to wait for the health check to respond during the start of your app before the health check is considered failed.</li><li><code>instances</code> - (Optional, Integer) The number of app instances that you want to create.</li><li><code>memory</code> - (Optional, Integer) The amount of memory, specified in megabytes, that is allocated to each instance. If you don't specify a value, the system assigns pre-defined values based on the app quota. You can check the default values by running <code>ibmcloud cf org &lt;org-name&gt;</code>. The command lists the quotas that are defined in your Cloud Foundry organization and space. If space quotas are defined, you can see them by running <code>ibmcloud cf space-quota &lt;space-quota-name&gt;</code>, where <code>&lt;quota-name&gt;</code> is the name of the quota. To check the organization quotas, run <code>ibmcloud cf quota &lt;quota-name&gt;</code>.</li><li><code>name</code> - (Required, String) The name of the app that you want to create, update, or delete. You can retrieve the value by running the <code>ibmcloud app list</code> command in the IBM Cloud CLI.</li><li><code>route_guid</code>(Optional, Sets)  The GUIDs of the routes that you want to bind to the application. The route must be in the same Cloud Foundry space as the app.</li><li><code>service_instance_guid</code>(Optional, Sets)  The GUID of the service instance that you want to bind to the app.</li><li><code>space_guid</code>- (Required, String) The GUID of the space where the app is deployed. You can retrieve the value from data source <code>ibm_space</code> or by running the <code>ibmcloud iam space &lt;space-name&gt; guid</code> command in the IBM Cloud CLI.</li><li><code>tags</code> (Array of Strings) Optional- The tags that you want to add to your app instance. Tags can help you find your app more easily.  <strong>NOTE</strong>: <code>Tags</code> are managed locally and not stored on the IBM Cloud Service Endpoint at this moment.</li><li><code>wait_time_minutes</code> - (Optional, Integer) The duration, expressed in minutes, to wait for the app to restage or start. The default value is <code>20</code>. A value of <code>0</code> means that there is no wait period.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument references list, you can access the following attribute references after your resource is created. </p><ul><li><code>id</code> - (String) The unique identifier of the application.</li></ul>", "description": "<h1 id=\"ibm_app\">ibm_app</h1><p>Create, update, or delete a Cloud Foundry app. For more information, about IBM Cloud Pak for application, see <a href=\"https://cloud.ibm.com/docs/cloud-pak-applications?topic=cloud-pak-applications-about\">about IBM applications</a>.</p>"}