{"ibm-cis-rate-limit": "<h1 id=\"ibm_cis_rate_limit\">ibm_cis_rate_limit</h1><p>Create, update, or delete custom rate limits for an IBM Cloud Internet Services domain. For more information, about rate limits, see <a href=\"https://cloud.ibm.com/docs/cis?topic=cis-cis-rate-limiting\">Rate limiting</a>.</p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><p>The following example shows how you can add a rate limit to an IBM Cloud Internet Services domain.</p><br /><p>terraform</p><br />", "add-a-rate-limit-to-the-domain": "<h1 id=\"add-a-rate-limit-to-the-domain\">Add a rate limit to the domain</h1><p>resource \"ibm_cis_rate_limit\" \"ratelimit\" {<br />    cis_id = data.ibm_cis.cis.id<br />    domain_id = data.ibm_cis_domain.cis_domain.domain_id<br />    threshold = 20<br />    period = 900<br />    match {<br />        request {<br />            url = \"<em>.example.org/path</em>\"<br />            schemes = [\"HTTP\", \"HTTPS\"]<br />            methods = [\"GET\", \"POST\", \"PUT\", \"DELETE\", \"PATCH\", \"HEAD\"]<br />        }<br />        response {<br />            status = [200, 201, 202, 301, 429]<br />            origin_traffic = false<br />        }<br />    }<br />    action {<br />        mode = \"ban\"<br />        timeout = 43200<br />        response {<br />            content_type = \"text/plain\"<br />            body = \"custom response body\"<br />        }<br />    }<br />    correlate {<br />        by = \"nat\"<br />    }<br />    disabled = false<br />    description = \"example rate limit for a zone\"<br />}</p>", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument references that you can specify for your resource. </p><ul><li><code>action</code>- (Required, List) A list of actions that you want to perform when incoming requests exceed the specified <code>threshold</code>.</li></ul><p>Nested scheme for <code>action</code>:<br />  - <code>mode</code> - (Required, String) The type of action that you want to perform. Supported values are <code>simulate</code>, <code>ban</code>, <code>challenge</code>, or <code>js_challenge</code>. For more information, about each type, see <a href=\"https://cloud.ibm.com/docs/cis?topic=cis-cis-rate-limiting#rate-limiting-configure-response\">Configure response</a>.<br />  - <code>response</code>- (Optional, List) A list of information that you want to return to the client, such as the <code>content-type</code> and specific body information. The information provided in this parameter overrides the default HTML error page that is returned to the client. You can use this option only for actions of type <code>simulate</code> or <code>ban</code>.</p><pre><code>Nested scheme for `response`:- `content_type` - (Optional, String) The `content-type` of the body that you want to return. Supported values are `text/plain`, `text/xml`, and `application/json`.- `body` - (Optional, String) The body of the response that you want to return to the client. The information that you provide must match the `action.response.content_type` that you specified. The value that you enter can have a maximum length of 1024.</code></pre><ul><li><code>timeout</code> - (Optional, Integer) The time to wait in seconds before the action is performed. The timeout must be equal or greater than the <code>period</code> and can be provided only for actions of type <code>simulate</code> or <code>ban</code>. The value that you enter must be between 10 and 86400.</li><li><code>bypass</code> - (Optional, List) A list of key-value pairs that, when matched, allow the rate limiting rule to be ignored. For example, use this option if you want to ignore the rate limiting for certain URLs.</li></ul><p>Nested scheme for <code>bypass</code>:<br />  - <code>name</code> - (Optional, String) The name of the key that you want to apply. Supported values are <code>url</code>.<br />  - <code>value</code> - (Optional, String) The value of the key that you want to match. When <code>name</code> is set to <code>url</code>, <code>value</code> must be set to the URL that you want to exclude from the rate limiting rule.<br />- <code>correlate</code> - (Optional, List) To enable NAT-based rate limiting.</p><p>Nested scheme for <code>correlate</code>:<br />   - <code>by</code> - (Optional, String) Enter <code>nat</code> to enable NAT-based rate limiting.<br />- <code>cis_id</code> - (Required, String) The ID of the IBM Cloud Internet Services instance.<br />- <code>disabled</code> - (Optional, Bool) Set to <strong>true</strong> to disable rate limiting for a domain and <strong>false</strong> to enable rate limiting.<br />- <code>description</code> - (Optional, String) Enter a description for your rate limiting rule.<br />- <code>domain_id</code> - (Required, String) The ID of the domain where you want to add a rate limit.<br />- <code>match</code>- (Optional, List) A list of characteristics that incoming network traffic must match the <code>threshold</code> count. </p><p>Nested scheme for <code>match</code>:<br />  - <code>request</code>- (Optional, List) A list of characteristics that the incoming request match the <code>threshold</code> count. If this list is not provided, all incoming requests are matched the count of the <code>threshold</code>.</p><pre><code>Nested scheme for `request`:- `url` - (Optional, String) The URL that the request uses. Wildcard domains are expanded to match applicable traffic, query strings are not matched. You can use `*` to apply the rule to all URLs. The maximum length of this value can be 1024.- `schemes` - (Optional, Set of strings) The scheme of the request that determines the protocol that you want. Supported values are `HTTPS`, `HTTP,HTTPS`, and `_ALL_`.- `methods` - (Optional, Set of strings) The HTTP methods that the incoming request that match the `threshold` count. Supported values are `GET`, `POST`, `PUT`, `DELETE`, `PATCH`, `HEAD`, and `_ALL_`. You can also combine multiple methods and separate them with a comma. For example `POST,PUT`.</code></pre><ul><li><code>response</code>- (Optional, List) A list of HTTP responses that outgoing packets must match before they can be returned to the client. If an incoming request matches the request criteria, but the response does not match the response criteria, then the request packet is not counted with the <code>threshold</code>. </li></ul><p>Nested scheme for <code>response</code>:<br />  - <code>header</code>- (Optional, List) A list of HTTP response headers that the response packet must match so that the original request is matched with the <code>threshold</code> count.</p><pre><code>Nested scheme for `header`:  - `name` - (Optional, String) The name of the HTTP response header.  - `op` - (Optional, String) The operator that you want to apply to your HTTP response header. Supported values are `eq` (equals) and `ne` (not equals).  - `value` - (Optional, String) The value that the HTTP response header must match.</code></pre><ul><li><code>origin_traffic</code> - (Optional, Bool). The origin traffic.</li><li><code>status</code>- (Optional, Set(Integer))The HTTP status that the response must have so that the request is matched with the <code>threshold</code> count. You can specify one (<code>403</code>) or multiple (<code>401,403</code>) HTTP response codes. The value that you enter must be between 100 and 999.</li><li><code>period</code>- (Required, Integer) The period of time in seconds where incoming requests to a domain are counted. If the number of requests exceeds the <code>threshold</code>, then connections to the domain are refused. The <code>period</code> value must be between 1 and 3600.    </li><li><code>threshold</code>- (Required, Integer) The number of requests received within a specific time period (<code>period</code>) before connections to the domain are refused. The threshold value must be between 2 and 1000000.</li></ul><p><strong>Note</strong></p><p>To create a custom rate limit rule the CIS instance should be a <code>enterprise</code> plan</p>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument reference list, you can access the following attribute reference after your resource is created.</p><ul><li><code>id</code> - (String) The ID of the rate limiting rule in the format <code>&lt;rule_ID&gt;:&lt;domain_ID&gt;:&lt;cis_ID&gt;</code>. .</li><li><code>rule_id</code> - (String) The rate limit rule ID.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>The <code>ibm_cis_rate_limit</code> resource can be imported using the <code>id</code>. The ID is formed from the <code>Rate Limit rule ID</code>, the <code>Domain ID</code> of the domain and the <code>CRN</code> (Cloud Resource Name) concatentated using a <code>:</code> character.</p><p>The Domain ID and CRN will be located on the <strong>Overview</strong> page of the Internet Services instance under the <strong>Domain</strong> heading of the UI, or via using the <code>bx cis</code> CLI commands.</p><ul><li><p><strong>Domain ID</strong> is a 32 digit character string of the form: <code>9caf68812ae9b3f0377fdf986751a78f</code></p></li><li><p><strong>CRN</strong> is a 120 digit character string of the form: <code>crn:v1:bluemix:public:internet-svcs:global:a/4ea1882a2d3401ed1e459979941966ea:31fa970d-51d0-4b05-893e-251cba75a7b3::</code></p></li><li><p><strong>Rate Limit rule ID</strong> is a 32 digit character string of the form: <code>489d96f0da6ed76251b475971b097205c</code>.</p></li></ul><p><strong>Syntax</strong></p><p>$ terraform import ibm_cis_rate_limit.ratelimit <rule_id>:<domain-id>:<crn></p><p><strong>Example</strong></p><p>$ terraform import ibm_cis_rate_limit.ratelimit 48996f0da6ed76251b475971b097205c:9caf68812ae9b3f0377fdf986751a78f:crn:v1:bluemix:public:internet-svcs:global:a/4ea1882a2d3401ed1e459979941966ea:31fa970d-51d0-4b05-893e-251cba75a7b3::</p>", "description": "<h1 id=\"ibm_cis_rate_limit\">ibm_cis_rate_limit</h1><p>Create, update, or delete custom rate limits for an IBM Cloud Internet Services domain. For more information, about rate limits, see <a href=\"https://cloud.ibm.com/docs/cis?topic=cis-cis-rate-limiting\">Rate limiting</a>.</p>"}