{"ibm-compute-bare-metal": "<h1 id=\"ibm_compute_bare_metal\">ibm_compute_bare_metal</h1><p>Create, update, and delete a bare metal resource. This resource supports both monthly bare metal servers and hourly bare metal servers. For more detail on bare metal severs, refer to the <a href=\"https://www.ibm.com/cloud/bare-metal-servers\">IBM Cloud bare metal server page</a>.</p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><h3 id=\"example-of-an-hourly-bare-metal-server\">Example of an hourly bare metal server</h3><p>When the <code>ibm_compute_bare_metal</code> resource definition has a <code>fixed_config_preset</code> attribute, Terraform creates an hourly bare metal server. Hardware specifications are predefined in the <code>fixed_config_preset</code> attribute and cannot be modified. The following example shows you how to create a new hourly bare metal server.</p><p>terraform<br />resource \"ibm_compute_bare_metal\" \"hourly-bm1\" {<br />  hostname             = \"hourly-bm1\"<br />  domain               = \"example.com\"<br />  os_reference_code    = \"UBUNTU_16_64\"<br />  datacenter           = \"dal01\"<br />  network_speed        = 100   # Optional<br />  hourly_billing       = true  # Optional<br />  private_network_only = false # Optional<br />  fixed_config_preset  = \"S1270_8GB_2X1TBSATA_NORAID\"</p><p>user_metadata = \"{\\\"value\\\":\\\"newvalue\\\"}\" # Optional<br />  tags = [<br />    \"collectd\",<br />    \"mesos-master\",<br />  ]<br />  notes = \"note test\"<br />}<br /></p><h3 id=\"example-of-a-monthly-bare-metal-server\">Example of a monthly bare metal server</h3><p>When the <code>fixed_config_preset</code> attribute is not configured, Terraform creates a monthly bare metal server resource. The monthly bare metal server resource provides options to configure process, memory, network, disk, and RAID. You can also can assign VLANs and subnets for the target monthly bare metal server. To configure the monthly bare metal server, you must provide additional attributes such as <code>package_key_name</code>, <code>proecss_key_name</code>, <code>disk_key_names</code>, and <code>os_key_name</code>. The following example shows you how to create a new monthly bare metal server.</p><p>terraform<br />resource \"ibm_compute_bare_metal\" \"monthly_bm1\" {<br />  # Mandatory fields<br />  package_key_name = \"DUAL_E52600_V4_12_DRIVES\"<br />  process_key_name = \"INTEL_INTEL_XEON_E52620_V4_2_10\"<br />  memory           = 64<br />  os_key_name      = \"OS_WINDOWS_2012_R2_FULL_DC_64_BIT_2\"<br />  hostname         = \"cust-bm\"<br />  domain           = \"ms.com\"<br />  datacenter       = \"wdc04\"<br />  network_speed    = 100<br />  public_bandwidth = 500<br />  disk_key_names   = [\"HARD_DRIVE_800GB_SSD\", \"HARD_DRIVE_800GB_SSD\", \"HARD_DRIVE_800GB_SSD\"]<br />  hourly_billing   = false</p><p># Optional fields<br />  private_network_only = false<br />  unbonded_network     = true<br />  user_metadata        = \"{\\\"value\\\":\\\"newvalue\\\"}\"<br />  public_vlan_id       = 12345678<br />  private_vlan_id      = 87654321<br />  public_subnet        = \"50.97.46.160/28\"<br />  private_subnet       = \"10.56.109.128/26\"<br />  tags = [<br />    \"collectd\",<br />    \"mesos-master\",<br />  ]<br />  redundant_power_supply = true<br />  storage_groups {<br />    # RAID 5<br />    array_type_id = 3</p><pre><code># Use three diskshard_drives = [0, 1, 2]array_size  = 1600# Basic partition template for Windowspartition_template_id = 17</code></pre><p>}<br />}</p><p></p><p><strong>Note</strong></p><p>Monthly bare metal servers do not support <code>immediate cancellation</code>. When Terraform deletes the monthly bare metal server, the <code>anniversary date cancellation</code> option is used.</p><h3 id=\"example-to-create-a-bare-metal-server-using-quote-id-based-ordering\">Example to create a bare metal server using quote ID based ordering</h3><p>If you already have a quote ID for the bare metal server, you can create a new bare metal server with the quote ID. The following example shows you how to create a new bare metal server with a quote ID.</p><p>terraform<br />resource \"ibm_compute_bare_metal\" \"quote_test\" {<br />  # Mandatory fields<br />  hostname = \"quote-bm-test\"<br />  domain   = \"example.com\"<br />  quote_id = 2209349</p><p># Optional fields<br />  user_metadata   = \"{\\\"value\\\":\\\"newvalue\\\"}\"<br />  public_vlan_id  = 12345678<br />  private_vlan_id = 87654321<br />  public_subnet   = \"50.97.46.160/28\"<br />  private_subnet  = \"10.56.109.128/26\"<br />  tags = [<br />    \"collectd\",<br />    \"mesos-master\",<br />  ]<br />}</p><p></p>", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument references that you can specify for your resource. </p><h3 id=\"argument-reference-for-all-the-bare-metal-server-types\">Argument reference for all the bare metal server types</h3><ul><li><code>block_storage_ids</code>- (Optional, Array of Integers) Block storage to which this computing instance has access. Block storage must be in the same data center as the Bare Metal server. If you use this argument to authorize, access to block storage, do not use the <code>allowed_hardware_ids</code> argument in the <code>ibm_storage_file</code> resource in order to prevent the same storage be added twice.</li><li><code>domain</code> - (Required, Forces new resource, String) The domain for the computing instance.</li><li><code>file_storage_ids</code>- (Optional, Array of Integers) File storage to which this computing instance has access. File storage must be in the same data center as the Bare Metal server. If you use this argument to authorize, access to file storage, do not use the <code>allowed_hardware_ids</code> argument in the <code>ibm_storage_file</code> resource in order to prevent the same storage be added twice.</li><li><code>hostname</code> - (Optional, Forces new resource, String) The host name for the compute instance.</li><li><code>notes</code> - (Optional, String) Notes to associate with the instance.</li><li><code>post_install_script_uri</code> - (Optional, Forces new resource, String) The URI of the script to be downloaded and executed after installation is complete.</li><li><code>ssh_key_ids</code>- (Optional, Forces new resources, Array of Integers) The SSH key IDs to install on the compute instance when the instance is provisioned. <strong>Note</strong> If you don't know the IDs for your SSH keys, you can reference your SSH keys by their labels.</li><li><code>tags</code> (Optional, Array of Strings) Tags associated with this Bare Metal server. Permitted characters include A-Z, 0-9, whitespace, <code>_</code> (underscore), <code>-</code> (hyphen), <code>.</code> (period), and <code>:</code> (colon). All other characters are removed.</li><li><code>user_metadata</code> - (Optional, Forces new resource, String) Arbitrary data to be made available to the compute instance.</li></ul><h3 id=\"arguments-reference-common-to-hourly-and-monthly-server\">Arguments reference common to hourly and monthly server</h3><ul><li><code>datacenter</code> - (Required, String) The data center in which you want to provision the instance.</li><li><code>extended_hardware_testing</code> - (Optional, Bool) Enable the extended hardware testing while the Bare Metal server. The default value is <strong>false</strong>. <strong>Note</strong> Enabling the <code>extended_hardware_testing</code> cause considerable delays in the deployment.</li><li><code>gpu_key_name</code> - (Optional, String) The key name for the primary Graphics Processing Unit (GPU). For example, <code>GPU_NVIDIA_GRID_K2</code>. Locate your package ID. See <code>package_key_name</code> attribute. To fetch the <code>PACKAGE_ID</code>, you need to access <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Product_Package/getAllObjects?objectFilter={%22type%22:{%22keyName%22:{%22operation%22:%22BARE_METAL_CPU%22}}}\">Package ID</a> URL to view the <code>ID</code>. Once you have the ID, for example provide <code>PACKAGE_ID</code> as <code>142</code>, fetch its details by accessing the URL <code>https://api.softlayer.com/rest/v3/SoftLayer_Product_Package/142/getItems?objectMask=mask[prices[id,categories[id,name,categoryCode],capacityRestrictionType,capacityRestrictionMinimum,capacityRestrictionMaximum,locationGroupId]]</code>. Select a <code>GPU</code> key name from the resulting available <code>GPU</code> key names where category code is <code>gpu0</code>. <strong>Note</strong> To view the package ID. Log in to the <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Hardware/getCreateObjectOptions.json\">IBM Cloud Classic Infrastructure API</a> that uses your API key as the password. For more information, about creating classic infrastructure keys and locating your VPN username and password, refer <a href=\"https://cloud.ibm.com/docs/account?topic=account-classic_keys\">Managing classic infrastructure API keys</a>.</li><li><code>gpu_secondary_key_name</code> - (Optional, String) The key name for the secondary Graphics Processing Unit (GPU). For example, <code>GPU_NVIDIA_GRID_K2</code>. Key names can be fetched in the similar way as <code>gpu_key_name</code> and  category code is <code>gpu1</code>.</li><li><code>hourly_billing</code>- (Required, Bool) The billing type for the instance. When set to <strong>true</strong>, the compute instance is billed on hourly usage. Otherwise, the instance is billed monthly. The default value is <strong>true</strong>.</li><li><code>image_template_id</code> - (Optional, Integer) The image template ID you want to use to provision the computing instance. This is not the global identifier (UUID), but the image template group ID that should point to a valid global identifier. To retrieve the image template ID from the IBM Cloud infrastructure customer portal, navigate to <strong>Devices &gt; Manage &gt; Images</strong>, click the image that you want, and note the ID number in the resulting URL.       <strong>Note</strong> Conflicts with <code>os_reference_code</code>.</li><li><code>ipv6_enabled</code> - (Optional, Bool) The primary public IPv6 address. The default value is <strong>false</strong>.</li><li><code>ipv6_static_enabled</code> - (Optional, Bool) The public static IPv6 address block of <code>/64</code>. The default value is <strong>false</strong>.</li><li><code>network_speed</code> - (Optional, Integer) The connection speed, expressed in Mbps,  for the instance's network components. The default value is <code>100</code>.</li><li><code>private_network_only</code> - (Optional, Bool) Specifies whether the instance has only access to the private network. When the value is <strong>true</strong>, a compute instance has only access to the private network. The default value is <strong>false</strong>.</li><li><code>secondary_ip_count</code> - (Optional, Integer) Specifies secondary public IPv4 addresses. Accepted values are <code>4</code> and <code>8</code>.</li><li><code>redundant_power_supply</code> - (Optional, Bool) When the value is <strong>true</strong>, more power supply is provided.</li><li><code>redundant_network</code> - (Optional, Bool) When the value is <strong>true</strong>, two physical network interfaces are provided with a bonding configuration. The default value is <strong>false</strong>.</li><li><code>unbonded_network</code> - (Optional, Bool) When the value is <strong>true</strong>, two physical network interfaces are provided without a bonding configuration. The default value is <strong>false</strong>.</li></ul><h3 id=\"argument-reference-for-hourly-bare-metal-servers\">Argument reference for hourly bare metal servers</h3><ul><li><code>fixed_config_preset</code> - (Required, String) The configuration preset with which you want to provision the Bare Metal server. This preset governs the type of CPU, number of cores, amount of RAM, and number of hard disks that the Bare Metal server has. To see the available presets, log in to the <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Hardware/getCreateObjectOptions.json\">IBM Cloud Classic Infrastructure API</a> that uses your API key as the password. For more information, about creating classic infrastructure keys and locating your VPN username and password, refer <a href=\"https://cloud.ibm.com/docs/account?topic=account-classic_keys\">Managing classic infrastructure API keys</a>.  You can search for <code>fixedConfigurationPresets</code> to view the presets key names. <strong>Note</strong> The <code>fixedConfigurationPresets</code> key names are displayed in the <code>JSON</code> or <code>txt</code> format.</li><li><code>os_reference_code</code> - (Optional, String) An operating system reference code that provisions the computing instance. To see available OS reference codes, log in to the <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Virtual_Guest_Block_Device_Template_Group/getVhdImportSoftwareDescriptions.json?objectMask=referenceCode\">IBM Cloud Classic Infrastructure API</a>, that uses your API key as the password.  <strong>Note</strong> Conflicts with <code>image_template_id</code>.</li><li><code>software_guard_extensions</code> - (Optional, Bool) The Software Guard Extensions product is added to a compatible server package, selecting <code>Intel SGX-enabled BIOS</code> and <code>hardware</code>. The default value is <strong>false</strong>.</li></ul><h3 id=\"argument-reference-for-monthly-bare-metal-servers\">Argument reference for monthly bare metal servers</h3><ul><li><code>disk_key_names</code> (Optional, Array of Strings) The internal key names for the monthly Bare Metal server's disk. Use this argument when you create a new monthly Bare Metal server. To get disk key names, first find the package key name in the <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Product_Package/getAllObjects?objectFilter={&quot;type&quot;:{&quot;keyName&quot;:{&quot;operation&quot;:&quot;BARE_METAL_CPU&quot;}}}\">IBM Cloud API</a>. Then, replace <PACKAGE_NAME> with your package key name in the following <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Product_Package/PACKAGE_NAME/getItems?objectMask=mask[prices[id,categories[id,name,categoryCode],capacityRestrictionType,capacityRestrictionMinimum,capacityRestrictionMaximum,locationGroupId]]\">URL</a>. Select disk key names from the resulting available disk key names.</li><li><code>memory</code> - (Optional, Integer) The amount of memory, which is specified in gigabytes, for the server.</li><li><code>os_key_name</code> - (Optional, String) The operating system key name that you want to use to provision the computing instance. To get disk key names, first find the package key name in the <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Product_Package/getAllObjects?objectFilter={&quot;type&quot;:{&quot;keyName&quot;:{&quot;operation&quot;:&quot;BARE_METAL_CPU&quot;}}}\">IBM Cloud API</a>. Then, replace <PACKAGE_NAME> with your package key name in the following <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Product_Package/&lt;PACKAGE_NAME&gt;/getItems?objectMask=mask[prices[id,categories[id,name,categoryCode],capacityRestrictionType,capacityRestrictionMinimum,capacityRestrictionMaximum,locationGroupId]]\">URL</a>. Select an OS key name from the resulting available OS key names.</li><li><code>public_vlan_id</code> - (Optional, Integer) The public VLAN to be used for the public network interface of the instance. You can find accepted values in the <a href=\"https://cloud.ibm.com/classic/network/vlans\">VLAN networks</a>. Click the VLAN that you want and notes the ID in the resulting URL.</li><li><code>private_vlan_id</code> - (Optional, Integer) The private VLAN to be used for the private network interface of the instance. You can find accepted values in the <a href=\"https://cloud.ibm.com/classic/network/vlans\">VLAN networks</a>. Click the VLAN that you want and notes the ID in the resulting URL.</li><li><code>public_subnet</code> - (Optional, String) The public subnet to be used for the public network interface of the instance. Accepted values are primary public networks. You can find accepted values in the <a href=\"https://cloud.ibm.com/classic/network/subnets\">subnets Docs</a>.</li><li><code>private_subnet</code> - (Optional, String) The private subnet to be used for the private network interface of the instance. Accepted values are primary private networks. You can find accepted values in the <a href=\"https://cloud.ibm.com/classic/network/subnets\">subnets Docs</a>.</li><li><code>package_key_name</code> - (Optional, String) The key name for the monthly Bare Metal server's package.Use this argument when you create a new monthly Bare Metal server. You can find available package key names in the IBM Cloud API URL <code>https://api.softlayer.com/rest/v3/SoftLayer_Product_Package/getAllObjects?objectFilter={\"type\":{\"keyName\":{\"operation\":\"BARE_METAL_CPU\"}}}</code>, that uses your API key as the password.</li><li><code>process_key_name</code> - (Optional, String) The key name for the monthly Bare Metal server's process. Use this argument when you create a new monthly Bare Metal server. To get a process key name, first find the package key name in the <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Product_Package/getAllObjects?objectFilter={&quot;type&quot;:{&quot;keyName&quot;:{&quot;operation&quot;:&quot;BARE_METAL_CPU&quot;}}}\">IBM Cloud API</a>. To fetch the <code>PACKAGE_ID</code>, you need to access <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Product_Package/getAllObjects?objectFilter={%22type%22:{%22keyName%22:{%22operation%22:%22BARE_METAL_CPU%22}}}\">Package ID</a> URL to view the <code>ID</code>. Once you have the ID, for example provide <code>PACKAGE_ID</code> as <code>142</code>. Then, replace <PACKAGE_ID> with your package key name in the following URL <code>https://api.softlayer.com/rest/v3/SoftLayer_Product_Package/142/getItems?objectMask=mask[prices[id,categories[id,name,categoryCode],capacityRestrictionType,capacityRestrictionMinimum,capacityRestrictionMaximum,locationGroupId]]</code>. Select a process key name from the resulting available process key names. <strong>Note</strong> To view the package ID. log in to the <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Hardware/getCreateObjectOptions.json\">IBM Cloud Classic Infrastructure API</a> that uses your API key as the password. For more information, about creating classic infrastructure keys and locating your VPN username and password, refer <a href=\"https://cloud.ibm.com/docs/account?topic=account-classic_keys\">Managing classic infrastructure API keys</a>.</li><li><code>public_bandwidth</code> - (Optional, Integer) The amount of public network traffic, which is specified in gigabytes, allowed per month. The value can be greater than 0 when <code>private_network_only</code> is set to <strong>false</strong> and the server is a monthly based server.</li><li><code>restricted_network</code> - (Optional, Bool) The non-datacenter restricted port speed. The default value is <strong>false</strong>.</li><li><code>storage_groups</code> - (Optional, List of Objects)Configurations for RAID and partition.</li></ul><p>Nested scheme for <code>storage-groups</code>:<br />  - <code>array_type_id</code>- (Required, Integer) The RAID type. You can retrieve the value from the <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Configuration_Storage_Group_Array_Type/getAllObjects\">IBM Cloud API</a>.<br />  - <code>array_size</code> - (Optional, Integer) The target RAID disk size, specific in gigabytes.<br />  - <code>hard_drives</code>-Array of integers-Required-The index of hard disks for RAID configuration. The index starts at 0. For example, the array [0,1] is an index of two hard disks.<br />  - <code>partition_template_id</code> - (Optional, String) The partition template ID for the OS disk. Templates are different based on the target OS. To get the partition template ID, first find the OS ID in the <a href=\"https://api.softlayer.com/rest/v3/SoftLayer_Hardware_Component_Partition_OperatingSystem/getAllObjects\">IBM Cloud API</a>. Then, replace <OS_ID> with your OS ID in the following URL <code>https://api.softlayer.com/rest/v3/SoftLayer_Hardware_Component_Partition_OperatingSystem/&lt;OS_ID&gt;/getPartitionTemplates</code>. Select your template ID in resulting available partition template IDs.<br />- <code>software_guard_extensions</code> - (Optional, Bool) The Software Guard Extensions product is added to a compatible server package, selecting Intel SGX-enabled BIOS and hardware. The default value is <strong>false</strong>.<br />- <code>tcp_monitoring</code> - (Optional, Bool)  When the value is <strong>false</strong>, a ping monitoring service is provided. When the value is <strong>true</strong>, a ping monitoring service and a TCP monitoring service are provided.#### Arguments for quote-based Bare Metal servers-</p><h3 id=\"argument-reference-for-quote-based-bare-metal-servers\">Argument reference for quote-based bare metal servers</h3><ul><li><code>public_vlan_id</code> - (Optional, Integer) The public VLAN to be used for the public network interface of the instance. You can find accepted values in the <a href=\"https://cloud.ibm.com/classic/network/vlans\">VLAN network</a>. Click the VLAN that you want and notes the ID in the resulting URL.</li><li><code>private_vlan_id</code> - (Optional, Integer) The private VLAN to be used for the private network interface of the instance. You can find accepted values in the <a href=\"https://cloud.ibm.com/classic/network/vlans\">VLAN network</a>. Click the VLAN that you want and notes the ID in the resulting URL.</li><li><code>public_subnet</code> - (Optional, String) The public subnet to be used for the public network interface of the instance. Accepted values are primary public networks. You can find accepted values in the <a href=\"https://cloud.ibm.com/classic/network/subnets\">subnets Docs</a>.</li><li><code>private_subnet</code> - (Optional, String) The private subnet to be used for the private network interface of the instance. Accepted values are primary private networks. You can find accepted values in the <a href=\"https://cloud.ibm.com/classic/network/subnets\">subnets Docs</a>.</li><li><code>quote_id</code> - (Optional, String) When you define <code>quote_id</code>,  Terraform uses specifications in the quote to create a Bare Metal server. You can find the quote ID in the <a href=\"https://cloud.ibm.com/classic\">IBM Cloud infrastructure customer portal</a> by navigating to <strong>Account &gt; Sales &gt; Quotes</strong>.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument reference list, you can access the following attribute reference after your resource is created.</p><ul><li><code>global_identifier</code> - (String) The unique global identifier of the Bare Metal server.</li><li><code>id</code> - (String) The unique identifier of the Bare Metal server.</li><li><code>ipv6_address</code> - (String) The public IPv6 address of the Bare Metal server instance provided when <code>ipv6_enabled</code> is set to <strong>true</strong>.</li><li><code>ipv6_address_id</code> - (String) The unique identifier for the public IPv6 address of the Bare Metal server.</li><li><code>public_ipv4_address</code> - (String) The public IPv4 address of the Bare Metal server.</li><li><code>public_ipv4_address_id</code> - (String) The unique identifier for the public IPv4 address of the Bare Metal server.</li><li><code>private_ipv4_address</code> - (String) The private IPv4 address of the Bare Metal server.</li><li><code>private_ipv4_address_id</code> - (String) The unique identifier for the private IPv4 address of the Bare Metal server.</li><li><code>secondary_ip_addresses</code> - (String) The public secondary IPv4 addresses of the Bare Metal server instance when <code>secondary_ip_count</code> is set to non zero value.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>The <code>ibm_compute_bare_metal</code> resource can be imported by using Bare Metal server ID.</p><p><strong>Example</strong></p><p><code>$ terraform import ibm_compute_bare_metal.server &lt;server_id&gt;</code></p>", "description": "<h1 id=\"ibm_compute_bare_metal\">ibm_compute_bare_metal</h1><p>Create, update, and delete a bare metal resource. This resource supports both monthly bare metal servers and hourly bare metal servers. For more detail on bare metal severs, refer to the <a href=\"https://www.ibm.com/cloud/bare-metal-servers\">IBM Cloud bare metal server page</a>.</p>"}