{"ibm-container-cluster": "<h1 id=\"ibm_container_cluster\">ibm_container_cluster</h1><p>Create, update, or delete an IBM Cloud Kubernetes Service or Red Hat OpenShift on IBM Cloud single zone cluster. Every cluster is set up with a worker pools that is named <code>default</code> and that holds worker nodes with the same configuration, such as machine type, CPU, and memory.</p><p>If you want to use this resource to update a cluster, make sure that you review the <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-changelog\">version changelog</a> for patch updates and the <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-cs_versions\">version information and update information</a> for major and minor changes. </p><p>If you want to create a VPC cluster, make sure to include the VPC infrastructure generation in the <code>provider</code> block of your  Terraform configuration file. If you do not set this value, the generation is automatically set to 2. For more information, about how to configure the <code>provider</code> block, see <a href=\"https://cloud.ibm.com/docs/ibm-cloud-provider-for-terraform?topic=ibm-cloud-provider-for-terraform-provider-reference#required-parameters\">Overview of required input parameters for each resource category</a>. </p><p>To create a worker pool or add worker nodes and zones to a worker pool, use the <code>ibm_container_worker_pool</code> and <code>ibm_container_worker_pool_zone</code> resources. </p><p>For step-by-step instructions for how to create an IBM Cloud Kubernetes Service or Red Hat OpenShift on IBM Cloud cluster, see <a href=\"https://cloud.ibm.com/docs/ibm-cloud-provider-for-terraform?topic=ibm-cloud-provider-for-terraform-tutorial-tf-clusters\">Creating single and multizone Kubernetes and OpenShift clusters</a>. </p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><h3 id=\"classic-ibm-cloud-kubernetes-service-cluster\">Classic IBM Cloud Kubernetes Service cluster</h3><br /><p>The following example creates a single zone IBM Cloud Kubernetes Service cluster that is named <code>mycluster</code> with one worker node in the default worker pool.</p><br /><p>terraform<br />resource \"ibm_container_cluster\" \"testacc_cluster\" {<br />  name            = \"test\"<br />  datacenter      = \"dal10\"<br />  machine_type    = \"free\"<br />  hardware        = \"shared\"<br />  public_vlan_id  = \"vlan\"<br />  private_vlan_id = \"vlan\"<br />  subnet_id       = [\"1154643\"]</p><br /><p>default_pool_size = 1</p><br /><p>labels = {<br />    \"test\" = \"test-pool\"<br />  }</p><br /><p>webhook {<br />    level = \"Normal\"<br />    type  = \"slack\"<br />    url   = \"https://hooks.slack.com/services/yt7rebjhgh2r4rd44fjk\"<br />  }<br />}</p><br /><h3 id=\"create-the-kubernetes-cluster-with-a-default-worker-pool-with-2-workers-and-one-standalone-worker-as-mentioned-by-worker_num\">Create the Kubernetes cluster with a default worker pool with 2 workers and one standalone worker as mentioned by worker_num:</h3><br /><p>terraform<br />resource \"ibm_container_cluster\" \"testacc_cluster\" {<br />  name            = \"test\"<br />  datacenter      = \"dal10\"<br />  machine_type    = \"free\"<br />  hardware        = \"shared\"<br />  public_vlan_id  = \"vlan\"<br />  private_vlan_id = \"vlan\"<br />  subnet_id       = [\"1154643\"]</p><br /><p>labels = {<br />    \"test\" = \"test-pool\"<br />  }</p><br /><p>default_pool_size = 2<br />  worker_num        = 1<br />  webhook {<br />    level = \"Normal\"<br />    type  = \"slack\"<br />    url   = \"https://hooks.slack.com/services/yt7rebjhgh2r4rd44fjk\"<br />  }<br />}</p><br /><h3 id=\"create-a-gateway-enabled-kubernetes-cluster\">Create a Gateway enabled Kubernetes cluster:</h3><br /><p>terraform<br />resource \"ibm_container_cluster\" \"testacc_cluster\" {<br />  name            = \"testgate\"<br />  gateway_enabled = true <br />  datacenter      = \"dal10\"<br />  machine_type    = \"b3c.4x16\"<br />  hardware        = \"shared\"<br />  private_vlan_id = \"2709721\"<br />  private_service_endpoint = true<br />  no_subnet = false<br />}</p><br /><h3 id=\"create-a-kms-enabled-kubernetes-cluster\">Create a kms enabled Kubernetes cluster:</h3><br /><p>terraform<br />resource \"ibm_container_cluster\" \"cluster\" {<br />  name              = \"myContainerClsuter\"<br />  datacenter        = \"dal10\"<br />  no_subnet         = true<br />  default_pool_size = 2<br />  hardware          = \"shared\"<br />  resource_group_id = data.ibm_resource_group.testacc_ds_resource_group.id<br />  machine_type      = \"b2c.16x64\"<br />  public_vlan_id    = \"2771174\"<br />  private_vlan_id   = \"2771176\"<br />  kms_config {<br />    instance_id = \"12043812-757f-4e1e-8436-6af3245e6a69\"<br />    crk_id = \"0792853c-b9f9-4b35-9d9e-ffceab51d3c1\"<br />    private_endpoint = false<br />  }<br />}</p><br /><h3 id=\"create-the-openshift-cluster-with-default-worker-pool-entitlement\">Create the Openshift Cluster with default worker pool entitlement:</h3><br /><p>terraform<br />resource \"ibm_container_cluster\" \"cluster\" {<br />  name              = \"test-openshift-cluster\"<br />  datacenter        = \"dal10\"<br />  default_pool_size = 3<br />  machine_type      = \"b3c.4x16\"<br />  hardware          = \"shared\"<br />  kube_version      = \"4.3_openshift\"<br />  public_vlan_id    = \"2863614\"<br />  private_vlan_id   = \"2863616\"<br />  entitlement       = \"cloud_pak\"<br />}</p><br /><h3 id=\"vpc-generation-2-ibm-cloud-kubernetes-service-cluster\">VPC Generation 2 IBM Cloud Kubernetes Service cluster</h3><br /><p>The following example creates a VPC Generation 2 cluster that is spread across two zones.</p><br /><p>provider \"ibm\" {<br />  generation = 2<br />}</p><br /><p>resource \"ibm_is_vpc\" \"vpc1\" {<br />  name = \"myvpc\"<br />}</p><br /><p>resource \"ibm_is_subnet\" \"subnet1\" {<br />  name                     = \"mysubnet1\"<br />  vpc                      = ibm_is_vpc.vpc1.id<br />  zone                     = \"us-south-1\"<br />  total_ipv4_address_count = 256<br />}</p><br /><p>resource \"ibm_is_subnet\" \"subnet2\" {<br />  name                     = \"mysubnet2\"<br />  vpc                      = ibm_is_vpc.vpc1.id<br />  zone                     = \"us-south-2\"<br />  total_ipv4_address_count = 256<br />}</p><br /><p>data \"ibm_resource_group\" \"resource_group\" {<br />  name = var.resource_group<br />}</p><br /><p>resource \"ibm_container_vpc_cluster\" \"cluster\" {<br />  name              = \"mycluster\"<br />  vpc_id            = ibm_is_vpc.vpc1.id<br />  flavor            = \"bx2.4x16\"<br />  worker_count      = 3<br />  resource_group_id = data.ibm_resource_group.resource_group.id<br />  zones {<br />    subnet_id = ibm_is_subnet.subnet1.id<br />    name      = \"us-south-1\"<br />  }<br />}</p><br /><p>resource \"ibm_container_vpc_worker_pool\" \"cluster_pool\" {<br />  cluster           = ibm_container_vpc_cluster.cluster.id<br />  worker_pool_name  = \"mywp\"<br />  flavor            = \"bx2.2x8\"<br />  vpc_id            = ibm_is_vpc.vpc1.id<br />  worker_count      = 3<br />  resource_group_id = data.ibm_resource_group.resource_group.id<br />  zones {<br />    name      = \"us-south-2\"<br />    subnet_id = ibm_is_subnet.subnet2.id<br />  }<br />}</p><br />", "timeouts": "<h2 id=\"timeouts\">Timeouts</h2><p>The <code>ibm_container_alb</code> provides the following <a href=\"https://www.terraform.io/docs/language/resources/syntax.html\">Timeouts</a> configuration options:</p><ul><li><strong>Create</strong> The enablement of the feature is considered <code>failed</code> if no response is received for 90 minutes.</li><li><strong>Delete</strong> The delete of the feature is considered <code>failed</code> if no response is received for 45 minutes.</li><li><strong>Update</strong> The update of the feature is considered <code>failed</code> if no response is received for 45 minutes.</li></ul>", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument references that you can specify for your resource. </p><ul><li><code>datacenter</code> - (Required, Forces new resource, String) The datacenter where you want to provision the worker nodes. The zone that you choose must be supported in the region where you want to create the cluster. To find supported zones, run <code>ibmcloud ks zones</code> <a href=\"https://cloud.ibm.com/docs/cli?topic=cloud-cli-getting-started\">command line</a>.</li><li><code>default_pool_size</code>  - (Optional, Integer) The number of worker nodes that you want to add to the default worker pool.</li><li><code>disk_encryption</code> - (Optional, Forces new resource, Bool) If set to <strong>true</strong>, the worker node disks are set up with an AES 256-bit encryption. If set to <strong>false</strong>, the disk encryption for the worker node is disabled. For more information, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-security#workernodes\">Encrypted disks for worker node</a>.</li><li><code>entitlement</code> - (Optional, String) If you purchased an IBM Cloud Cloud Pak that includes an entitlement to run worker nodes that are installed with OpenShift Container Platform, enter <code>entitlement</code> to create your cluster with that entitlement so that you are not charged twice for the OpenShift license. Note that this option can be set only when you create the cluster. After the cluster is created, the cost for the OpenShift license occurred and you cannot disable this charge. <strong>Note</strong></li><li>Set only for the first time creation of the cluster, modification do not have any impacts.</li><li>Set this argument to <code>cloud_pak</code> only if you use this cluster with a Cloud Pak that has an OpenShift entitlement.</li><li><code>force_delete_storage</code> - (Optional, Bool) If set to <strong>true</strong>,force the removal of persistent storage associated with the cluster during cluster deletion. Default value is <strong>false</strong>. <strong>NOTE</strong> If <code>force_delete_storage</code> parameter is used after provisioning the cluster, then, you need to execute <code>terraform apply</code> before <code>terraform destroy</code> for <code>force_delete_storage</code> parameter to take effect.</li><li><code>hardware</code> - (Optional, Forces new resource, String) The level of hardware isolation for your worker node. Use <code>dedicated</code> to have available physical resources dedicated to you only, or <code>shared</code> to allow physical resources to be shared with other IBM customers. This option is available for virtual machine worker node flavors only.</li><li><code>image_security_enforcement</code> - (Optional, Bool) Set to <strong>true</strong> to enable image security enforcement policies in a cluster.</li><li><code>gateway_enabled</code> - (Optional, Bool) Set to <strong>true</strong> if you want to automatically create a gateway-enabled cluster. If <code>gateway_enabled</code> is set to <strong>true</strong>, then <code>private_service_endpoint</code> must be set to <strong>true</strong> at the same time.</li><li><code>kms_config</code> - (Optional, List) Used to attach a Key Protect instance to a cluster. Nested <code>kms_config</code> block have <code>instance_id</code>, <code>crk_id</code>, <code>private_endpoint</code> structure.</li></ul><p>Nested scheme for <code>kms_config</code>:<br />  - <code>crk_id</code> - (Optional, String) The ID of the customer root key (CRK).<br />  - <code>instance_id</code> - (Optional, String) The GUID of the Key Protect instance.<br />  - <code>private_endpoint</code> - (Optional, Bool) Set to <strong>true</strong> to configure the KMS private service endpoint. Default value is <strong>false</strong>.<br />- <code>kube_version</code> - (Optional, String) The Kubernetes or OpenShift version that you want to set up in your cluster. If the version is not specified, the default version in <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-cs_versions\">IBM Cloud Kubernetes Service</a> or <a href=\"https://cloud.ibm.com/docs/openshift?topic=openshift-openshift_versions#version_types\">Red Hat OpenShift on IBM Cloud</a> is used. For example, to specify Kubernetes version 1.16, enter <code>1.16</code>. For OpenShift clusters, you can specify version <code>3.11_openshift</code> or <code>4.3.1_openshift</code>.<br />- <code>labels</code>- (Optional, Map) Labels on all the workers in the default worker pool.<br />- <code>machine_type</code> - (Optional, Forces new resource, String) The machine type for your worker node. The machine type determines the amount of memory, CPU, and disk space that is available to the worker node. For an overview of supported machine types, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-planning_worker_nodes\">Planning your worker node setup</a>. You can retrieve the value by executing the <code>ibmcloud ks machine-types &lt;data-center&gt;</code> command in the IBM Cloud CLI.<br />- <code>name</code> - (Required, Forces new resource, String) The name of the cluster. The name must start with a letter, can contain letters, numbers, and hyphen (-), and must be 35 characters or fewer. Use a name that is unique across regions. The cluster name and the region in which the cluster is deployed form the fully qualified domain name for the Ingress subdomain. To ensure that the Ingress subdomain is unique within a region, the cluster name might be truncated and appended with a random value within the Ingress domain name.<br />- <code>no_subnet</code> - (Optional, Forces new resource, Bool) If set to <strong>true</strong>, no portable subnet is created during cluster creation. The portable subnet is used to provide portable IP addresses for the Ingress subdomain and Kubernetes load balancer services. If set to <strong>false</strong>, a portable subnet is created by default. The default is <strong>false</strong>.<br />- <code>operating_system</code> - (Optional, Forces new resource, String) The operating system of the workers in the default worker pool. For supported options, see <a href=\"https://cloud.ibm.com/docs/openshift?topic=openshift-openshift_versions\">Red Hat OpenShift on IBM Cloud version information</a> or <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-cs_versions\">IBM Cloud Kubernetes Service version information</a>.<br />- <code>patch_version</code> - (Optional, String) Updates the worker nodes with the required patch version. The patch_version should be in the format:  <code>patch_version_fixpack_version</code>. For more information, about Kubernetes version information and update, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-cs_versions\">Kubernetes version update</a>. <strong>NOTE:</strong> To update the patch or fix pack versions of the worker nodes, run the command <code>ibmcloud ks workers -c &lt;cluster_name_or_id&gt; output json</code>. Fetch the required patch &amp; fix pack versions from <code>kubeVersion.target</code> and set the <code>patch_version</code> parameter.<br />- <code>public_service_endpoint</code> - (Optional, Forces new resource, Bool) If set to <strong>true</strong>, your cluster is set up with a public service endpoint. You can use the public service endpoint to access the Kubernetes master from the public network. To use service endpoints, your account must be enabled for <a href=\"https://cloud.ibm.com/docs/account?topic=account-vrf-service-endpoint#vrf\">Virtual Routing and Forwarding (VRF)</a>. For more information, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-plan_clusters#workeruser-master\">Worker-to-master and user-to-master communication: Service endpoints</a>. If set to <strong>false</strong>, the public service endpoint is disabled for your cluster.<br />- <code>public_vlan_id</code> - (Optional, Forces new resource, String) The ID of the public VLAN that you want to use for your worker nodes. You can retrieve the VLAN ID with the <code>ibmcloud ks vlans --zone &lt;zone&gt;</code> command. </br></br> * <strong>Free clusters</strong>: If you want to provision a free cluster, you do not need to enter a public VLAN ID. Your cluster is automatically connected to a public VLAN that is owned by IBM. </br> * <strong>Standard clusters</strong>: If you create a standard cluster and you have an existing public VLAN ID for the zone where you plan to set up worker nodes, you must enter the VLAN ID. To retrieve the ID, run <code>ibmcloud ks vlans --zone &lt;zone&gt;</code>. If you do not have an existing public VLAN ID, or you want to connect your cluster to a private VLAN only, do not specify this option. <strong>Note</strong>: The prerequisite for using service endpoints, account must be enabled for <a href=\"https://cloud.ibm.com/docs/infrastructure/direct-link/vrf-on-ibm-cloud.html#overview-of-virtual-routing-and-forwarding-vrf-on-ibm-cloud\">Virtual Routing and Forwarding (VRF)</a>. Account must be enabled for connectivity to service endpoints. Use the resource <code>ibm_container_cluster_feature</code> to update the <code>public_service_endpoint</code> and <code>private_service_endpoint</code>. <br />- <code>private_service_endpoint</code> - (Optional, Forces new resource, Bool) If set to <strong>true</strong>, your cluster is set up with a private service endpoint. When the private service endpoint is enabled, communication between the Kubernetes and the worker nodes is established over the private network. If you enable the private service endpoint, you cannot disable it later. To use service endpoints, your account must be enabled for <a href=\"https://cloud.ibm.com/docs/account?topic=account-vrf-service-endpoint#vrf\">Virtual Routing and Forwarding (VRF)</a>. For more information, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-plan_clusters#workeruser-master\">Worker-to-master and user-to-master communication: Service endpoints</a>. If set to <strong>false</strong>, the private service endpoint is disabled and all communication to the Kubernetes master must go through the public network.<br />- <code>private_vlan_id</code> - (Optional, Forces new resource, String) The ID of the private VLAN that you want to use for your worker nodes. You can retrieve the VLAN ID with the <code>ibmcloud ks vlans --zone &lt;zone&gt;</code> command. </br></br> * <strong>Free clusters</strong>: If you want to provision a free cluster, you do not need to enter a private VLAN ID. Your cluster is automatically connected to a private VLAN that is owned by IBM. </br> * <strong>Standard clusters</strong>: If you create a standard cluster and you have an existing private VLAN ID for the zone where you plan to set up worker nodes, you must enter the VLAN ID. To retrieve the ID, run <code>ibmcloud ks vlans --zone &lt;zone&gt;</code>. If you do not have an existing private VLAN ID, do not specify this option. A private VLAN is created automatically for you.<br />- <code>pod_subnet</code>-  (Optional, String) Specify a custom subnet CIDR to provide private IP addresses for pods. The subnet must be at least <code>/23</code> or more. For more information, refer to <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-cli-plugin-kubernetes-service-cli#pod-subnet\">Pod subnet</a>.Yes-<br />- <code>resource_group_id</code> - (Optional, String) The ID of the resource group where you want to provision your cluster. To retrieve the ID, use the  <code>ibm_resource_group</code> data source. If no value is provided, the cluster is automatically provisioned into the <code>default</code> resource group.<br />- <code>retry_patch_version</code> - (Optional, Integer) This argument retries the update of <code>patch_version</code> if the previous update fails. Increment the value to retry the update of <code>patch_version</code> on worker nodes.<br />- <code>subnet_id</code> - (Optional, String) The ID of an existing subnet that you want to use for your worker nodes. To find existing subnets, run <code>ibmcloud ks subnets</code>.<br />- <code>service_subnet</code>-  (Optional, Forces new resource, String) Specify a custom subnet CIDR to provide private IP addresses for services. The subnet should be at least <code>/24</code> or more. For more information, refer to <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-cli-plugin-kubernetes-service-cli#service-subnet\">Subnet service</a>.<br />- <code>tags</code> - (Optional, Array of string)  A list of tags that you want to add to your cluster. Tags can help find a cluster more quickly.  <strong>Note</strong>: For users on account to add tags to a resource, they must be assigned the appropriate <a href=\"https://cloud.ibm.com/docs/resources?topic=resources-access\">permissions</a>.<br />- <code>taints</code> - (Optional, Set) A nested block that sets or removes Kubernetes taints for all worker nodes in a worker pool</p><p>Nested scheme for <code>taints</code>:<br />  - <code>key</code> - (Required, String) Key for taint.<br />  - <code>value</code> - (Required, String) Value for taint.<br />  - <code>effect</code> - (Required, String) Effect for taint. Accepted values are <code>NoSchedule</code>, <code>PreferNoSchedule</code>, and <code>NoExecute</code>.</p><ul><li><code>update_all_workers</code> - (Optional, Bool) If set to <strong>true</strong>, the Kubernetes version of the worker nodes is updated along with the Kubernetes version of the cluster that you specify in <code>kube_version</code>.  <strong>Note</strong>: setting <code>wait_for_worker_update</code> to <code>false</code> is not recommended. This results in upgrading all the worker nodes in the cluster at the same time causing the cluster downtime. </li><li><code>webhook</code> - (Optional, String) The webhook that you want to add to the cluster. For available options, see the <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-cli-plugin-kubernetes-service-cli\"><code>webhook create</code> command</a>.</li><li><code>workers_info</code> - (Optional, Array of objects) The worker nodes that you want to update.</li></ul><p>Nested scheme for <code>workers_info</code>:<br />  - <code>id</code> - (Optional, String) The ID of the worker node that you want to update.<br />  - <code>version</code> - (Optional, String) The Kubernetes version that you want to update your worker nodes to.<br />- <code>worker_num</code>- (Optional, Integer) The number of worker nodes in your cluster. This attribute creates a worker node that is not associated with a worker pool. <strong>Note</strong>: Conflicts with <code>workers</code>.<br />- <code>wait_for_worker_update</code> - (Optional, Bool) Set to <strong>true</strong> to wait and update the Kubernetes version of worker nodes. <strong>NOTE</strong> Setting wait_for_worker_update to <strong>false</strong> is not recommended. Setting <strong>false</strong> results in upgrading all the worker nodes in the cluster at the same time causing the cluster downtime.<br />- <code>wait_till</code> - (Optional, String) The cluster creation happens in multi-stages. To avoid the longer wait times for resource execution. This argument in the resource will wait for the specified stage and complete the execution. The default stage value is <code>IngressReady</code>. The supported stages are  <code>MasterNodeReady</code> Resource waits till the master node is ready.  <code>OneWorkerNodeReady</code> Resource waits till one worker node is in to ready state. <code>Normal</code> Terraform marks the creation of your cluster complete when the cluster is in a <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-cluster-states-reference#cluster-state-normal\">Normal</a> state. If you plan to do reading on the cluster from a datasource, use <code>Normal</code>. At the moment wait_till <code>Normal</code> also ignores the critical and warning states the are temporary happen during cluster creation, but cannot distinguish it from actual critical or warning states. <code>IngressReady</code> Resource waits till the ingress-host and ingress-secret are available.</p><p><strong>Note</strong></p><ol><li>For users on account to add tags to a resource, you need to assign the right access. For more information, about tags, see <a href=\"https://cloud.ibm.com/docs/account?topic=account-access\">Tags permission</a>.</li><li><code>wait_till</code> is set only for the first time creation of the resource, further modification are not impacted.</li></ol><p><strong>Deprecated reference</strong></p><ul><li><code>account_guid</code> - (Deprecated, Forces new resource, string) The GUID for the IBM Cloud account associated with the cluster. You can retrieve the value from data source <code>ibm_account</code> or by running the <code>ibmcloud iam accounts</code> command in the IBM Cloud CLI.</li><li><code>billing</code> - (Deprecated, Optional, Forces new resource, string) The billing type for the instance. Accepted values are <code>hourly</code> or <code>monthly</code>.</li><li><code>org_guid</code> - (Deprecated, Forces new resource, string) The GUID for the IBM Cloud organization associated with the cluster. You can retrieve the value from data source <code>ibm_org</code> or by running the <code>ibmcloud iam orgs --guid</code> command in the IBM Cloud CLI.</li><li><code>is_trusted</code> - (Deprecated, Optional, Forces new resource, boolean) Set to <code>true</code> to  enable trusted cluster feature. Default is false.</li><li><code>space_guid</code> - (Deprecated, Forces new resource, string) The GUID for the IBM Cloud space associated with the cluster. You can retrieve the value from data source <code>ibm_space</code> or by running the <code>ibmcloud iam space &lt;space-name&gt; --guid</code> command in the IBM Cloud CLI.</li><li><code>region</code> - (Deprecated, Forces new resource, string) The region where the cluster is provisioned. If the region is not specified it will be defaulted to provider region(IC_REGION/IBMCLOUD_REGION). To get the list of supported regions please access this <a href=\"https://containers.bluemix.net/v1/regions\">link</a> and use the alias.</li><li><code>wait_time_minutes</code> - (Deprecated, integer) The duration, expressed in minutes, to wait for the cluster to become available before declaring it as created. It is also the same amount of time waited for no active transactions before proceeding with an update or deletion. The default value is <code>90</code>.</li><li><code>workers</code> - (Deprecated) The worker nodes that you want to add to the cluster. <strong>Note</strong> Conflicts with <code>worker_num</code>. Nested <code>workers</code> blocks have the following structure:</li></ul><p>Nested scheme for <code>workers</code>:<br />  - <code>action</code> - valid actions are add, reboot and reload.<br />  - <code>name</code> - Name of the worker.<br />  - <code>version</code> - worker version.</p>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument reference list, you can access the following attribute reference after your resource is created.</p><ul><li><code>albs</code> - (List of objects) A list of Ingress application load balancers (ALBs) that are attached to the cluster.</li></ul><p>Nested scheme for <code>albs</code><br />  - <code>alb_type</code> - (String) The type of ALB. Supported values are <code>public</code> and <code>private</code>.<br />  - <code>alb_ip</code> - (String) The virtual IP address that you want to use for your application load balancer (ALB). Currently supported only for private application load balancer (ALB). <br />  - <code>disable_deployment</code> -  (Bool)  Indicate whether to disable deployment only on disable application load balancer (ALB).<br />  - <code>enable</code> -  (Bool) Indicates if the ALB is enabled (<strong>true</strong>) or disabled (<strong>false</strong>) in the cluster.<br />  - <code>id</code> - (String) The unique identifier of the Ingress ALB.<br />  - <code>name</code> - (String) The name of the Ingress ALB. <br />  - <code>num_of_instances</code>- (Integer) The number of ALB replicas. <br />  - <code>resize</code> -  (Bool)  Indicate whether resizing should be done.<br />  - <code>state</code> - (String) The state of the ALB. Supported values are <code>enabled</code> or <code>disabled</code>. <br />- <code>crn</code> - (String) The CRN of the cluster.<br />- <code>id</code> - (String) The unique identifier of the cluster.<br />- <code>ingress_hostname</code> - (String) The Ingress host name.<br />- <code>ingress_secret</code> - (String) The name of the Ingress secret.<br />- <code>name</code> - (String) The name of the cluster.<br />- <code>public_service_endpoint_url</code> - (String) The URL of the public service endpoint for your cluster.<br />- <code>private_service_endpoint_url</code> - (String) The URL of the private service endpoint for your cluster.<br />- <code>server_url</code> - (String) The server URL. <br />- <code>subnet_id</code> - (String) The subnets attached to this cluster. <br />- <code>workers</code> - (List of objects) A list of worker nodes that belong to the cluster. </p><p>Nested scheme for <code>workers</code>:<br />  - <code>id</code> - (String) The ID of the worker.</p><ul><li><code>worker_pools</code> - List of objects - A list of worker pools that exist in the cluster.</li></ul><p>Nested scheme for <code>worker_pools</code>:<br />  - <code>hardware</code> - (String) The level of hardware isolation that is used for the worker node of the worker pool.<br />  - <code>id</code> - (String) The ID of the worker pool.<br />  - <code>machine_type</code> - (String) The machine type that is used for the worker nodes in the worker pool.<br />  - <code>name</code> - (String) The name of the worker pool.<br />  - <code>size_per_zone</code> - (Integer) The number of worker nodes per zone.<br />  - <code>state</code> - (String) The state of the worker pool.<br />  - <code>labels</code> - List of strings - A list of labels that are added to the worker pool.</p><pre><code>Nested scheme for `labels`:- `zones` - List of objects - A list of zones that are attached to the worker pool.  Nested scheme for `zones`:  - `private_vlan` - (String) The ID of the private VLAN that is used in that zone.  - `public_vlan` - (String) The ID of the private VLAN that is used in that zone.  - `worker_count` - (Integer) The number of worker nodes that are attached to the zone.  - `zone` - (String) The name of the zone.</code></pre><ul><li><code>workers_info</code> - (List of objects) A list of worker nodes that belong to the cluster.</li></ul><p>Nested scheme for <code>workers_info</code>:<br />  - <code>pool_name</code> - (String) The name of the worker pool the worker node belongs to.</p>", "import": "<h2 id=\"import\">Import</h2><p>The <code>ibm_container_cluster</code> can be imported by using <code>cluster_id</code>.</p><p><strong>Syntax</strong></p><p>$ terraform import ibm_container_cluster.example <cluster_id></p><p><strong>Example</strong></p><p>$ terraform import ibm_container_cluster.example c1di75fd0qpn1amo5hng</p>", "description": "<h1 id=\"ibm_container_cluster\">ibm_container_cluster</h1><p>Create, update, or delete an IBM Cloud Kubernetes Service or Red Hat OpenShift on IBM Cloud single zone cluster. Every cluster is set up with a worker pools that is named <code>default</code> and that holds worker nodes with the same configuration, such as machine type, CPU, and memory.</p><p>If you want to use this resource to update a cluster, make sure that you review the <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-changelog\">version changelog</a> for patch updates and the <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-cs_versions\">version information and update information</a> for major and minor changes. </p><p>If you want to create a VPC cluster, make sure to include the VPC infrastructure generation in the <code>provider</code> block of your  Terraform configuration file. If you do not set this value, the generation is automatically set to 2. For more information, about how to configure the <code>provider</code> block, see <a href=\"https://cloud.ibm.com/docs/ibm-cloud-provider-for-terraform?topic=ibm-cloud-provider-for-terraform-provider-reference#required-parameters\">Overview of required input parameters for each resource category</a>. </p><p>To create a worker pool or add worker nodes and zones to a worker pool, use the <code>ibm_container_worker_pool</code> and <code>ibm_container_worker_pool_zone</code> resources. </p><p>For step-by-step instructions for how to create an IBM Cloud Kubernetes Service or Red Hat OpenShift on IBM Cloud cluster, see <a href=\"https://cloud.ibm.com/docs/ibm-cloud-provider-for-terraform?topic=ibm-cloud-provider-for-terraform-tutorial-tf-clusters\">Creating single and multizone Kubernetes and OpenShift clusters</a>. </p>"}