{"ibm-container-vpc-worker": "<h1 id=\"ibm_container_vpc_worker\">ibm_container_vpc_worker</h1><p>Replace a worker. The worker will be replaced &amp; updated to the latest patch in the specified cluster. For more information, about VPC worker updates, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-update&amp;interface=ui#vpc_worker_node\">Updating VPC worker nodes</a></p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><p>In the following example, you can replace worker in a vpc cluster:</p><p><code>terraformresource \"ibm_container_vpc_worker\" \"test_worker\" {    cluster_name        = \"my_vpc_cluster\"    replace_worker      = \"kube-clusterid-mycluster-default-00001\"    resource_group_id   = \"6015365a-9d93-4bb4-8248-79ae0db2dc21\"    kube_config_path    = \"my_vpc_cluster.yaml\"    check_ptx_status    = \"true\"    ptx_timeout         = \"5m\"}</code></p>", "timeouts": "<h2 id=\"timeouts\">Timeouts</h2><p>The <code>ibm_container_vpc_worker</code> provides the following <a href=\"https://www.terraform.io/docs/language/resources/syntax.html\">Timeouts</a> configuration options:</p><ul><li><strong>Create</strong> The creation of the worker is considered failed when no response is received for 30 minutes. </li><li><strong>Delete</strong> The deletion of the worker is considered failed when no response is received for 30 minutes. </li></ul>", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument references that you can specify for your resource. </p><ul><li><code>cluster_name</code> - (Required, Forces new resource, String) The name or ID of the cluster.</li><li><code>replace_worker</code> - (Required, Forces new resource, String) The ID of the worker that needs to be replaced.</li><li><code>resource_group_id</code> - (Optional, Forces new resource, String) The ID of the resource group. To retrieve the ID, run <code>ibmcloud resource groups</code> or use the <code>ibm_resource_group</code> data source. If no value is provided, the <code>default</code> resource group is used.</li><li><code>check_ptx_status</code> - (Optional, String) Boolean value to check the status of Portworx on the replaced worker instance. By default, this variable is set as <code>false</code>.</li><li><code>kube_config_path</code> - (Optional, String) The Cluster config with absolute path. If <code>check_ptx_status</code> is true, this variable should hold a valid value. To retrieve the cluster config, run <code>ibmcloud cluster config -c &lt;Cluster_ID&gt;</code> or use the <code>ibm_container_cluster_config</code> data source.</li><li><code>ptx_timeout</code> - (Optional, String) The Status of Portworx on the replaced worker is considered failed when no response is received for 15 minutes.</li><li><code>sds</code> - (Optional, String) Software Defined Storage (SDS) parameter performs worker replace based on the installed SDS solution in the cluster. Supported value <code>ODF</code></li><li><code>sds_timeout</code> - (Optional, String) The Status of the Software Defined Storage on the replaced worker is considered failed when no response is received for 30 minutes.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument reference list, you can access the following attribute reference after your resource is created.</p><ul><li><code>id</code> - (String) The unique identifier of the worker.</li><li><code>ip</code> - (String) The IP of the worker.</li></ul>", "note": "<h2 id=\"note\">Note</h2><ul><li>This resource is different from all other resource of IBM Cloud. Worker replace has 2 operations, i.e. Delete old worker &amp; Create a new worker. On <code>terraform apply</code>, Replace operation is being handled where both the deletion &amp; creation happens whereas on the <code>terraform destroy</code>, only the state is cleared but not the actual resource.</li><li>When the worker list is being provided as inputs, the list must be user generated and should not be passed from the <code>ibm_container_cluster</code> data source.</li><li>If <code>terraform apply</code> fails during worker replace or while checking the portworx status, perform any one of the following actions before retrying.</li><li>Resolve the issue manually and perform <code>terraform untaint</code> to proceed with the subsequent workers in the list.</li><li>If worker replace is still needed, update the input list by replacing the existing worker id with the new worker id.</li><li>The <code>sds</code> option is currently in development. To perform Worker Replace for <code>ODF</code>, you can test and utilise it. Please ignore the parameter otherwise.</li></ul>", "description": "<h1 id=\"ibm_container_vpc_worker\">ibm_container_vpc_worker</h1><p>Replace a worker. The worker will be replaced &amp; updated to the latest patch in the specified cluster. For more information, about VPC worker updates, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-update&amp;interface=ui#vpc_worker_node\">Updating VPC worker nodes</a></p>"}