{"ibm-container-bind-service": "<h1 id=\"ibm_container_bind_service\">ibm_container_bind_service</h1><p>Bind an IBM Cloud service to an IBM Cloud Kubernetes Service cluster. Service binding is a quick way to create service credentials for an IBM Cloud service by using its public service endpoint and storing these credentials in a Kubernetes secret in your cluster. The Kubernetes secret is automatically encrypted in etcd to protect your data.</p><p>To bind a service to your cluster, you must provision an instance of the service first. For more information, about service binding, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-service-binding\">Adding services by using IBM Cloud service binding</a>.</p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><p>In the following example, you can bind a service to a cluster:</p><br /><p>terraform<br />resource \"ibm_container_bind_service\" \"bind_service\" {<br />  cluster_name_id       = \"cluster_name\"<br />  service_instance_name = \"service_name\"<br />  namespace_id          = \"default\"<br />}</p><br />", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument references that you can specify for your resource. </p><ul><li><code>cluster_name_id</code> - (Required, Forces new resource, String) The name or ID of the cluster to which you want to bind an IBM Cloud service. To find the cluster name or ID, run <code>ibmcloud ks cluster ls</code>.</li><li><code>key</code> - (Optional, Forces new resource, String) The name or guid of existing service credentials that you want to use for the service. If you do not provide this option, service credentials are automatically created as part of the service binding process.</li><li><code>namespace_id</code> - (Required, Forces new resource, String) The Kubernetes namespace where you want to create the Kubernetes secret that holds the service credentials of the service that you want to bind to the cluster.</li><li><code>resource_group_id</code> - (Optional, Forces new resource, String) The ID of the resource group where your IBM Cloud service is provisioned into. To list resource groups, run <code>ibmcloud resource groups</code>.</li><li><code>role</code> - (Optional, Forces new resource, String) The IAM service access role that you want to use to create the service credentials for the IBM Cloud service instance. If you specified existing service credentials in the <code>key</code> parameter, settings for the <code>role</code> parameter are ignored.</li><li><code>service_instance_id</code> - (Optional, Forces new resource, String) The ID of the service that you want to bind to the cluster. If you specify this parameter, do not specify <code>service_instance_name</code> at the same time.</li><li><code>service_instance_name</code> - (Optional, Forces new resource, String) The name of the service that you want to bind to the cluster. If you specify this parameter, do not specify <code>service_instance_id</code> at the same time.</li><li><code>tags</code> - (Optional, Array of string)  A list of tags that you want to associate with the IBM Cloud service instance that you bind to the cluster. <strong>Note</strong> <code>Tags</code> are managed locally and are not stored on the IBM Cloud service endpoint.</li></ul><p><strong>Deprecated reference</strong></p><ul><li><code>account_guid</code> - (Deprecated, Forces new resource, string) The GUID for the IBM Cloud account associated with the cluster. You can retrieve the value from data source <code>ibm_account</code> or by running the <code>ibmcloud iam accounts</code> command in the IBM Cloud CLI.</li><li><code>org_guid</code> - (Deprecated, Forces new resource, string) The GUID for the IBM Cloud organization associated with the cluster. You can retrieve the value from data source <code>ibm_org</code> or by running the <code>ibmcloud iam orgs --guid</code> command in the <a href=\"https://cloud.ibm.com/docs/cli?topic=cloud-cli-getting-started\">IBM Cloud CLI</a>.</li><li><code>region</code> - (Deprecated, Forces new resource, string) The region where the cluster is provisioned. If the region is not specified it will be defaulted to provider region(IC_REGION/IBMCLOUD_REGION). To get the list of supported regions please access this <a href=\"https://containers.bluemix.net/v1/regions\">link</a> and use the alias.</li><li><code>space_guid</code> - (Deprecated, Forces new resource, string) The GUID for the IBM Cloud space associated with the cluster. You can retrieve the value from data source <code>ibm_space</code> or by running the <code>ibmcloud iam space &lt;space-name&gt; --guid</code> command in the IBM Cloud CLI.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument reference list, you can access the following attribute reference after your resource is created.</p><ul><li><code>id</code> - (String) The unique identifier of the service bind resource in your cluster in the format <code>&lt;cluster_name_ID&gt;/&lt;service_instance_name&gt;</code> or <code>&lt;service_instance_id&gt;/&lt;namespace_id&gt;</code>.</li><li><code>namespace_id</code> - (String) The namespace in your cluster where the Kubernetes secret is located that holds the credentials to access your IBM Cloud service instance.</li><li><code>secret_name</code> - (String) The name of the Kubernetes secret that holds the credentials to access your IBM Cloud service instance.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>The <code>ibm_container_bind_service</code> can be imported by using cluster_name_id, service_instance_name or service_instance_id and namespace_id.</p><p><strong>Example</strong></p><p>$ terraform import ibm_container_bind_service.example mycluster/myservice/default</p>", "description": "<h1 id=\"ibm_container_bind_service\">ibm_container_bind_service</h1><p>Bind an IBM Cloud service to an IBM Cloud Kubernetes Service cluster. Service binding is a quick way to create service credentials for an IBM Cloud service by using its public service endpoint and storing these credentials in a Kubernetes secret in your cluster. The Kubernetes secret is automatically encrypted in etcd to protect your data.</p><p>To bind a service to your cluster, you must provision an instance of the service first. For more information, about service binding, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-service-binding\">Adding services by using IBM Cloud service binding</a>.</p>"}