{"ibm-container-cluster-feature": "<h1 id=\"ibm_container_cluster_feature\">ibm_container_cluster_feature</h1><p>Enable or disable a feature in your IBM Cloud Kubernetes Service cluster. For more information, about IBM container cluster feature, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-security\">Security for IBM Cloud Kubernetes Service</a>. Supported features include: <br />- Public service endpoint<br />- Private service endpoint</p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><p>The following example enables the private service endpoint feature for a cluster that is named <code>mycluster</code>.</p><p>terraform<br />resource \"ibm_container_cluster_feature\" \"feature\" {<br />  cluster                  = \"test1\"<br />  private_service_endpoint = \"true\"<br />}</p><p></p>", "timeouts": "<h2 id=\"timeouts\">Timeouts</h2><p>The <code>ibm_container_cluster_feature</code> provides the following <a href=\"https://www.terraform.io/docs/language/resources/syntax.html\">Timeouts</a> configuration options:</p><ul><li><strong>create</strong>: The enablement of the feature is considered <code>failed</code> if no response is received for 90 minutes.</li><li><strong>update</strong>: The update of the feature is considered <code>failed</code> if no response is received for 90 minutes. </li></ul>", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument references that you can specify for your resource. </p><ul><li><code>cluster</code> - (Required, Forces new resource, String) The name or ID of the cluster for which you want to enable or disabled a feature. To find the name or ID, use the <code>ibmcloud ks cluster ls</code> command.</li><li><code>public_service_endpoint</code> - (Optional, Bool) Enable(<strong>true</strong>) or disable (<strong>false</strong>) the public service endpoint for your cluster. You can use the public service endpoint to access the Kubernetes master from the public network. To use service endpoints, your account must be enabled for <a href=\"https://cloud.ibm.com/docs/account?topic=account-vrf-service-endpoint#vrf\">Virtual Routing and Forwarding (VRF)</a>. For more information, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-plan_clusters#workeruser-master\">Worker-to-master and user-to-master communication: Service endpoints</a>.</li><li><code>private_service_endpoint</code> - (Optional, Bool) Enable (<strong>true</strong>) or disable (<strong>false</strong>) the private service endpoint for your cluster. When the private service endpoint is enabled, communication between the Kubernetes and the worker nodes is established over the private network. If you enable the private service endpoint, you cannot disable it later. To use service endpoints, your account must be enabled for <a href=\"https://cloud.ibm.com/docs/account?topic=account-vrf-service-endpoint#vrf\">Virtual Routing and Forwarding (VRF)</a>. For more information, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-plan_clusters#workeruser-master\">Worker-to-master and user-to-master communication: Service endpoints</a>.</li><li><code>refresh_api_servers</code> - (Optional, Bool) If set to <strong>true</strong>, the Kubernetes master of the cluster is refreshed to apply the changes of your feature. If set to <strong>false</strong>, no refresh of the Kubernetes master is performed.</li><li><code>reload_workers</code> -  (Optional, Bool) If set to <strong>true</strong>, your worker nodes are reloaded after the feature is enabled. If set to <strong>false</strong>, no reload of the worker nodes is performed.</li><li><code>resource_group_id</code> - (Optional, String) The ID of the resource group that your cluster belongs to. You can retrieve the resource group by using the <code>ibm_resource_group</code> data source.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument reference list, you can access the following attribute reference after your resource is created.</p><ul><li><code>id</code> - (String) The ID of the cluster feature. </li><li><code>public_service_endpoint_url</code> - (String) The URL to the public service endpoint of your cluster. </li><li><code>private_service_endpoint_url</code> - (String) The URL to the private service endpoint of your cluster. </li></ul>", "description": "<h1 id=\"ibm_container_cluster_feature\">ibm_container_cluster_feature</h1><p>Enable or disable a feature in your IBM Cloud Kubernetes Service cluster. For more information, about IBM container cluster feature, see <a href=\"https://cloud.ibm.com/docs/containers?topic=containers-security\">Security for IBM Cloud Kubernetes Service</a>. Supported features include: <br />- Public service endpoint<br />- Private service endpoint</p>"}