{"ibm-cos-bucket": "<h1 id=\"ibm_cos_bucket\">ibm_cos_bucket</h1><p>Create or delete an IBM Cloud Object Storage bucket. The bucket is used to store your data. For more information, about configuration options, see <a href=\"https://cloud.ibm.com/docs/cloud-object-storage?topic=cloud-object-storage-getting-started-cloud-object-storage#gs-create-buckets\">Create some buckets to store your data</a>. </p><p>To create a bucket, you must provision an IBM Cloud Object Storage instance first by using the <a href=\"https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/resource_instance\"><code>ibm_resource_instance</code></a> resource.</p>", "example-usage": "<h2 id=\"example-usage_5\">Example usage</h2><p>terraform<br />data \"ibm_resource_group\" \"cos_group\" {<br />  name = \"cos-resource-group\"<br />}</p><br /><p>resource \"ibm_resource_instance\" \"cos_instance\" {<br />  name              = \"cos-instance\"<br />  resource_group_id = data.ibm_resource_group.cos_group.id<br />  service           = \"cloud-object-storage\"<br />}</p><br /><p>resource \"ibm_cos_bucket\" \"cos_bucket\" {<br />  bucket_name          = \"a-standard-bucket\"<br />  resource_instance_id = data.ibm_resource_instance.cos_instance.id<br />  bucket_region        = \"us-south\"<br />  storage_class        = \"Standard\"<br />  object_versioning {<br />    enable  = true<br />  }<br />  object_lock = true<br />}</p><br />", "cos-satellite-bucket": "<h1 id=\"cos-satellite-bucket\">cos satellite bucket</h1><p>Create or delete an COS satellite bucket. See the architecture of COS Satellite <br />https://cloud.ibm.com/docs/cloud-object-storage?topic=cloud-object-storage-about-cos-satellite for more details. We are using existing cos instance to create bucket , so no need to create any cos instance via a terraform. Cos satellite does not support all features see the section <strong>What features are currently supported?</strong> in https://cloud.ibm.com/docs/cloud-object-storage?topic=cloud-object-storage-about-cos-satellite.<br />IBM Satellite documentation https://cloud.ibm.com/docs/satellite?topic=satellite-getting-started. We are supporting object versioning and expiration features as of now. Firewall is not supported yet.</p>", "key-protect-enabled-cos-bucket": "<h1 id=\"key-protect-enabled-cos-bucket\">Key Protect enabled COS bucket</h1><p>Create or delete an COS bucket with a key protect root key.For more details about key protect see https://cloud.ibm.com/docs/key-protect?topic=key-protect-about  .We  need to create and manage root key using  <strong>ibm_kms_key</strong> resource. We are using existing cos instance to create bucket , so no need to create any cos instance via a terraform. https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/kms_key</p><p><strong>Note:</strong></p><p><code>key_protect</code> attribute has been renamed as <code>kms_key_crn</code> , hence it is recommended to all the new users to use <code>kms_key_crn</code>.Although the support for older attribute name <code>key_protect</code> will be continued for existing customers.</p>", "hpcs-enabled-cos-bucket": "<h1 id=\"hpcs-enabled-cos-bucket\">HPCS enabled COS bucket</h1><p>Create or delete a COS bucket with a Hyper Protect Crypto Services (HPCS) root key.For more details about HPCS see https://cloud.ibm.com/docs/hs-crypto?topic=hs-crypto-get-started .To enable HPCS on a COS bucket, an HPCS instance is required and needs to be initialized by loading the master key to create and manage HPCS keys. For more information on initializing the HPCS instance, see https://cloud.ibm.com/docs/hs-crypto?topic=hs-crypto-initialize-hsm-recovery-crypto-unit. To create an HPCS instance using terraform, see https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/hpcs.</p><p><strong>Note:</strong></p><p><code>key_protect</code> attribute has been renamed as <code>kms_key_crn</code> , hence it is recommended to all the new users to use <code>kms_key_crn</code>.Although the support for older attribute name <code>key_protect</code> will be continued for existing customers.</p>", "cos-one-rate-plan": "<h1 id=\"cos-one-rate-plan\">COS One-rate plan</h1><p>One-rate is one of the plans for cloud object storage instance .The One Rate plan is best suited for active workloads with large amounts of outbound bandwidth relative to storage capacity.For more information, see https://cloud.ibm.com/docs/cloud-object-storage?topic=cloud-object-storage-onerate&amp;mhsrc=ibmsearch_a&amp;mhq=One+rate</p>", "ibm-cos-object-lock-configuration": "<h1 id=\"ibm_cos_object_lock_configuration\">ibm_cos_object_lock_configuration</h1><p>COS Object Lock feature enables user to store the object in a bucket with an extra layer of protection against object changes and deletion.Object Lock can help prevent objects from being deleted or overwritten for a fixed amount of time or indefinitely by setting up retention period and legal hold for an object.</p>", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument references that you can specify for your resource. </p><ul><li><code>abort_incomplete_multipart_upload_days</code> (Optional,List) Nested block with the following structure.</li></ul><p>Nested scheme for <code>abort_incomplete_multipart_upload_days</code>:<br />  - <code>days_after_initiation</code> - (Optional, Integer) Specifies the number of days that govern the automatic cancellation of part upload. Clean up incomplete multi-part uploads after a period of time. Must be a value greater than 0 and less than 3650.<br />  - <code>enable</code> - (Required, Bool) A rule can either be <code>enabled</code> or <code>disabled</code>. A rule is active only when enabled.<br />  - <code>prefix</code> - (Optional, String)  A rule with a prefix will only apply to the objects that match. You can use multiple rules for different actions for different prefixes within the same bucket.<br />  - <code>rule_id</code> - (Optional, String) Unique identifier for the rule. Rules allow you to set a specific time frame after which objects are deleted. Set Rule ID for cos bucket.<br />- <code>allowed_ip</code> - (Optional, Array of string)  A list of IPv4 or IPv6 addresses in CIDR notation that you want to allow access to your IBM Cloud Object Storage bucket.<br />- <code>activity_tracking</code>- (List of objects) Object to enable auditing with IBM Cloud Activity Tracker - Optional - Configure your IBM Cloud Activity Tracker service instance and the type of events that you want to send to your service to audit activity against your bucket. For a list of supported actions, see <a href=\"https://cloud.ibm.com/docs/cloud-object-storage?topic=cloud-object-storage-at-events#at-actions-mngt-2\">Bucket actions</a>.</p><p>Nested scheme for <code>activity_tracking</code>:<br />  - <code>activity_tracker_crn</code>-  (Required, String) The CRN of your IBM Cloud Activity Tracker service instance that you want to send your events to. This value is required only when you configure your instance for the first time. <br />  - <code>read_data_events</code>-  (Required, Bool)  If set to <strong>true</strong>, all read events against a bucket are sent to your IBM Cloud Activity Tracker service instance.<br />  - <code>write_data_events</code>-  (Required, Bool) If set to <strong>true</strong>, all write events against a bucket are sent to your IBM Cloud Activity Tracker service instance.<br />- <code>archive_rule</code> - (Required, List) Nested archive_rule block has following structure.</p><p>Nested scheme for <code>archive_rule</code>:<br />  - <code>days</code> - (Required, Integer) Specifies the number of days when the specific rule action takes effect.<br />  - <code>enable</code> - (Required, Bool) Specifies archive rule status either <code>enable</code> or <code>disable</code> for a bucket.<br />  - <code>rule_id</code> -  (Optional, Computed, String) The unique ID for the rule. Archive rules allow you to set a specific time frame after the objects transition to the archive.<br />  - <code>type</code> - (Required, String) Specifies the storage class or archive type to which you want the object to transition. Allowed values are <code>Glacier</code> or <code>Accelerated</code>. </p><pre><code>**Note:** - Archive is available in certain regions only. For more information, see [Integrated Services](https://cloud.ibm.com/docs/cloud-object-storage/basics?topic=cloud-object-storage-service-availability).- Restoring object once archive is not supported yet.</code></pre><ul><li><code>bucket_name</code> - (Required, String) The name of the bucket.</li><li><code>cross_region_location</code> - (Optional, String) Specify the cross-regional bucket location. Supported values are <code>us</code>, <code>eu</code>, and <code>ap</code>. If you use this parameter, do not set <code>single_site_location</code> or <code>region_location</code> at the same time.</li><li><code>endpoint_type</code>- (Optional, String) The type of the endpoint either <code>public</code> or <code>private</code> or <code>direct</code> to be used for buckets. Default value is <code>public</code>.</li><li><code>expire_rule</code> - (Required, List) An expiration rule deletes objects after a defined period (from the object creation date). see <a href=\"https://cloud.ibm.com/docs/cloud-object-storage?topic=cloud-object-storage-versioning\">lifecycle actions</a>. Nested expire_rule block has following structure.</li></ul><p>Nested scheme for <code>expire_rule</code>:<br />  - <code>days</code> - (Optional, Integer) Specifies the number of days when the specific rule action takes effect.<br />  - <code>date</code> - (Optional, String) After the specifies date , the current version of objects in your bucket expires.<br />  - <code>enable</code> - (Required, Bool) Specifies expire rule status either <code>enable</code> or <code>disable</code> for a bucket.<br />  - <code>expired_object_delete_marker</code> - (Optional, String) Expired object delete markers can be automatically cleaned up to improve performance in your bucket. This cannot be used alongside version expiration. This element for the Expiration action which will only remove delete markers that have no non-current versions at all &amp; objects whose only version is a single delete marker.<br />  - <code>prefix</code> - (Optional, String) Specifies a prefix filter to apply to only a subset of objects with names that match the prefix.<br />  - <code>rule_id</code> -  (Optional, Computed, String) Unique ID for the rule. Expire rules allow you to set a specific time frame after which objects are deleted.</p><pre><code>**Note:** - Both `archive_rule` and `expire_rule` must be managed by  Terraform as they use the same lifecycle configuration. If user creates any of the rule outside of  Terraform by using command line or console, you can see unexpected difference like removal of any of the rule or one rule overrides another. The policy cannot match as expected due to API limitations, as the lifecycle is a single API request for both archive and expire.- When versioning is enabled/suspended, regular object expiration will no longer remove objects, instead it will create a delete marker, unless the current version is already a delete marker, then nothing happens. If the only version of the object is a delete marker, then the delete marker is removed after X days, or on a specific date.- expired_object_delete_marker element can not be used in conjunction with other expiry action elements (Days or Date).- The expiry 3 action elements (Days, Date, ExpiredObjectDeleteMarker) are all mutually exclusive.Anyone parameter can apply among 3 (Days, Date, ExpiredObjectDeleteMarker) in expire_rule.- You cannot specify both a Days and ExpiredObjectDeleteMarker tag on the same rule. Specifying the Days tag will automatically perform ExpiredObjectDeleteMarker cleanup once delete markers are old enough to satisfy the age criteria. You can create a separate rule with only the tag ExpiredObjectDeleteMarker to clean up delete markers as soon as they become the only version.</code></pre><ul><li><p><code>force_delete</code>- (Optional, Bool) As the default value set to <strong>true</strong>, it will delete all the objects in the COS Bucket and then delete the bucket. </p><p><strong>Note:</strong> <code>force_delete</code> will timeout on buckets with a large amount of objects. 24 hours before you delete the bucket you can set an expire rule to remove all the files over a day old.<br />- <code>hard_quota</code> - (Optional, Integer) Sets a maximum amount of storage (in bytes) available for a bucket. For more information, check the <a href=\"https://cloud.ibm.com/docs/cloud-object-storage?topic=cloud-object-storage-quota\">cloud documention</a>.<br />- <code>kms_key_crn</code> - (Optional, String) The CRN of the IBM Key Protect root key that you want to use to encrypt data that is sent and stored in IBM Cloud Object Storage. Before you can enable IBM Key Protect encryption, you must provision an instance of IBM Key Protect and authorize the service to access IBM Cloud Object Storage. For more information, see <a href=\"https://cloud.ibm.com/docs/cloud-object-storage?topic=cloud-object-storage-encryption\">Server-Side Encryption with IBM Key Protect or Hyper Protect Crypto Services (SSE-KP)</a>.<br /><strong>Note:</strong></p></li></ul><p><code>key_protect</code> attribute has been renamed as <code>kms_key_crn</code> , hence it is recommended to all the new users to use <code>kms_key_crn</code>.Although the support for older attribute name <code>key_protect</code> will be continued for existing customers.</p><ul><li><code>metrics_monitoring</code>- (Object) to enable metrics tracking with IBM Cloud Monitoring - Optional- Set up your IBM Cloud Monitoring service instance to receive metrics for your IBM Cloud Object Storage bucket.</li></ul><p>Nested scheme for <code>metrics_monitoring</code>:<br />  - <code>metrics_monitoring_crn</code> - (Required, string) Required the first time <code>metrics_monitoring</code> is configured. The instance of IBM Cloud Monitoring receives the bucket metrics. <br />  - <code>request_metrics_enabled</code> : (Optional, Bool) If set to <strong>true</strong>, all request metrics <code>ibm_cos_bucket_all_request</code> is sent to the monitoring service <code>@1mins</code> granulatiy.<br />  - <code>usage_metrics_enabled</code> : (Optional, Bool) If set to <strong>true</strong>, all usage metrics that is <code>bytes_used</code> is sent to the monitoring service.e.</p><pre><code>**Note:** - Request metrics are supported in all regions and console has the support. For more details check the [cloud documention](https://cloud.ibm.com/docs/cloud-object-storage?topic=cloud-object-storage-mm-cos-integration).- One of the location option must be present.</code></pre><ul><li><code>noncurrent_version_expiration</code> - (Required, List) lifecycle has a versioning related expiration action: non-current version expiration. This can remove old versions of objects after they've been non-current for a specified number of days which is specified with a NoncurrentDays parameter on the rule. see <a href=\"https://cloud.ibm.com/docs/cloud-object-storage?topic=cloud-object-storage-versioning\">lifecycle actions</a>. Nested noncurrent_version_expiration block has following structure.</li></ul><p>Nested scheme for <code>noncurrent_version_expiration</code>:<br />  - <code>enable</code> - (Requried, Bool) A rule can either be <code>enabled</code> or <code>disabled</code>. A rule is active only when enabled.<br />  - <code>noncurrent_days</code> - (Optional, Integer) Configuration parameter in your policy that says how long to retain a non-current version before deleting it. Must be greater than 0.<br />  - <code>prefix</code> - (Optional, String) The rule applies to any objects with keys that match this prefix. You can use multiple rules for different actions for different prefixes within the same bucket.<br />  - <code>rule_id</code> - (Optional, String) Unique identifier for the rule. Rules allow you to remove versions from objects. Set Rule ID for cos bucket.<br />- <code>object_versioning</code> - (Object) Object Versioning allows the COS user to keep multiple versions of an object in a bucket to protect against accidental deletion or overwrites. With versioning, you can easily recover from both unintended user actions and application failure. Nested block have the following structure:</p><p>Nested scheme for <code>object_versioning</code>:<br />  - <code>enable</code> : (Optional, Bool) Specifies Versioning status either enable or Suspended for the objects in the bucket.Default value set to false.</p><pre><code>**Note:**- Versioning allows multiple revisions of a single object to exist in the same bucket. Each version of an object can be queried, read, restored from an archived state, or deleted.- If cos bucket has versioning enabled and set to false, versioning will be suspended.- Versioning can only be suspended, we cannot disabled once after it is enabled.- To permanently delete individual versions of an object, a delete request must specify a version ID.- COS Object versioning and COS Bucket Protection `(WORM)` cannot be used together.- Containers with proxy configuration cannot use versioning and vice versa.- SoftLayer accounts cannot use versioning.- Currently, you cannot support `MFA_Delete`, that is a feature to add additional security to version delete.</code></pre><ul><li><code>region_location</code> - (Optional, String) The location of a regional bucket. Supported values are <code>au-syd</code>, <code>eu-de</code>, <code>eu-gb</code>, <code>jp-tok</code>, <code>us-east</code>, <code>us-south</code>, <code>ca-tor</code>, <code>jp-osa</code>, <code>br-sao</code>. If you set this parameter, do not set <code>single_site_location</code> or <code>cross_region_location</code> at the same time.</li><li><code>resource_instance_id</code> - (Required, String) The ID of the IBM Cloud Object Storage service instance for which you want to create a bucket.</li><li><code>retention_rule</code> - (List) Nested block have the following structure:</li></ul><p>Nested scheme for <code>retention rule</code>:<br />  - <code>default</code> - (Required, Integer) default retention period are defined by this policy and apply to all objects in the bucket.<br />  - <code>maximum</code> - (Required, Integer) Specifies maximum duration of time an object that can be kept unmodified in the bucket.<br />  - <code>minimum</code> - (Required, Integer) Specifies minimum duration of time an object must be kept unmodified in the bucket.<br />  - <code>permanent</code> : (Optional, Bool) Specifies a permanent retention status either enable or disable for a bucket.</p><pre><code>**Note:** - Retention policies cannot be removed. For a new bucket, ensure that you are creating the bucket in a supported region. For more information, see [Integrated Services](https://cloud.ibm.com/docs/cloud-object-storage/basics?topic=cloud-object-storage-service-availability). - The minimum retention period must be less than or equal to the default retention period, that in turn must be less than or equal to the maximum retention period. - Permanent retention can only be enabled at a IBM Cloud Object Storage bucket level with retention policy enabled and users are able to select the permanent retention period option during object uploads. Once enabled, this process can't be reversed and objects uploaded that use a permanent retention period cannot be deleted. It's the responsibility of the users to validate at their end if there's a legitimate need to permanently store objects by using Object Storage buckets with a retention policy. - force deleting the bucket will not work if any object is still under retention. As objects cannot be deleted or overwritten until the retention period has expired and all the legal holds have been removed.</code></pre><ul><li><code>single_site_location</code> - (Optional, String) The location for a single site bucket. Supported values are: <code>ams03</code>, <code>che01</code>, <code>hkg02</code>, <code>mel01</code>, <code>mex01</code>, <code>mil01</code>, <code>mon01</code>, <code>osl01</code>, <code>par01</code>, <code>sjc04</code>, <code>sao01</code>, <code>seo01</code>, <code>sng01</code>, and <code>tor01</code>. If you set this parameter, do not set <code>region_location</code> or <code>cross_region_location</code> at the same time.</li><li><code>storage_class</code> - (Optional, String) The storage class that you want to use for the bucket. Supported values are <code>standard</code>, <code>vault</code>, <code>cold</code> and <code>smart</code> for <code>standard</code> and <code>lite</code> COS plans, <code>onerate_active</code> for <code>cos-one-rate-plan</code> COS plan.For more information, about storage classes, see <a href=\"https://cloud.ibm.com/docs/cloud-object-storage?topic=cloud-object-storage-classes\">Use storage classes</a>.<code>storage_class</code> should not be used with Satellite location id.</li><li><code>satellite_location_id</code> - (Optional, String) satellite location id. Provided by end users.</li><li><p><code>object_lock</code> - (Optional, Bool) Enables Object Lock feature on a COS bucket.</p><p><strong>Note:</strong><br /> - To enable Object Lock on a bucket , object_versioning should be enabled.</p></li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument reference list, you can access the following attribute reference after your resource is created.</p><ul><li><code>crn</code> - (String) The CRN of the bucket.</li><li><code>cross_region_location</code> - (String) The location if you created a cross-regional bucket.</li><li><code>id</code> - (String) The ID of the bucket. </li><li><code>kms_key_crn</code> - (String) The CRN of the IBM Key Protect instance that you use to encrypt your data in IBM Cloud Object Storage.<br /><strong>Note:</strong></li></ul><p><code>key_protect</code> attribute has been renamed as <code>kms_key_crn</code> , hence it is recommended to all the new users to use <code>kms_key_crn</code>.Although the support for older attribute name <code>key_protect</code> will be continued for existing customers.<br />- <code>region_location</code> - (String) The location if you created a regional bucket.<br />- <code>resource_instance_id</code> - (String) The ID of IBM Cloud Object Storage instance. <br />- <code>single_site_location</code> - (String) The location if you created a single site bucket.<br />- <code>storage_class</code> - (String) The storage class of the bucket.<br />- <code>s3_endpoint_public</code> - (String) Public endpoint for cos bucket.<br />- <code>s3_endpoint_private</code> - (String) Private endpoint for cos bucket.<br />- <code>s3_endpoint_direct</code> - (String) Direct endpoint for cos bucket.</p>", "import-ibm-cos-bucket": "<h2 id=\"import-ibm-cos-bucket\">Import IBM COS Bucket</h2><p>The <code>ibm_cos_bucket</code> resource can be imported by using the <code>id</code>. The ID is formed from the <code>CRN</code> (Cloud Resource Name), the <code>bucket type</code> which must be <code>ssl</code> for single_site_location, <code>rl</code> for region_location or <code>crl</code> for cross_region_location, and the bucket location. The <code>CRN</code> and bucket location can be found on the portal.</p><p>id = <code>$CRN:meta:$buckettype:$bucketlocation</code></p><p><strong>Syntax</strong></p><p>$ terraform import ibm_cos_bucket.mybucket <code>$CRN:meta:$buckettype:$bucketlocation</code></p><p><strong>Example</strong></p><p>$ terraform import ibm_cos_bucket.mybucket crn:v1:bluemix:public:cloud-object-storage:global:a/4ea1882a2d3401ed1e459979941966ea:31fa970d-51d0-4b05-893e-251cba75a7b3:bucket:mybucketname:meta:crl:eu:public</p>", "import-cos-satelllite-bucket": "<h2 id=\"import-cos-satelllite-bucket\">Import COS Satelllite Bucket</h2><p>The <code>cos satellite bucket</code> resource can be imported by using the <code>id</code>. The ID is formed from the <code>CRN</code> (Cloud Resource Name), the <code>satellite_location_id</code> which must be <code>sl</code> for satellite_location_id and the bucket location. The <code>CRN</code> and bucket location can be found on the portal.</p><p>id = <code>$CRN:meta:$buckettype:$bucketlocation</code></p><p><strong>Example</strong></p><p>$ terraform import ibm_cos_bucket.cos_bucket crn:v1:staging:public:cloud-object-storage:satloc_dal_c8fctn320qtrspbisg80:a/81ee25188545f05150650a0a4ee015bb:a2deec95-0836-4720-bfc7-ca41c28a8c66:bucket:tf-listbuckettest:meta:sl:c8fctn320qtrspbisg80:public</p>", "description": "<h1 id=\"ibm_cos_bucket\">ibm_cos_bucket</h1><p>Create or delete an IBM Cloud Object Storage bucket. The bucket is used to store your data. For more information, about configuration options, see <a href=\"https://cloud.ibm.com/docs/cloud-object-storage?topic=cloud-object-storage-getting-started-cloud-object-storage#gs-create-buckets\">Create some buckets to store your data</a>. </p><p>To create a bucket, you must provision an IBM Cloud Object Storage instance first by using the <a href=\"https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/resource_instance\"><code>ibm_resource_instance</code></a> resource.</p>"}