{"ibm-dns-glb-monitor": "<h1 id=\"ibm_dns_glb_monitor\">ibm_dns_glb_monitor</h1><p>Provides a private DNS GLB (GLB) monitor resource. This allows DNS (GLB)) monitor to create, update, and delete. For more information, see <a href=\"https://cloud.ibm.com/docs/dns-svcs?topic=dns-svcs-health-check-events\">Viewing GLB events</a>. </p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><p><code>terraformresource \"ibm_dns_glb_monitor\" \"test-pdns-monitor\" {  depends_on     = [ibm_dns_zone.test-pdns-zone]  name           = \"test-pdns-glb-monitor\"  instance_id    = ibm_resource_instance.test-pdns-instance.guid  description    = \"test monitor description\"  interval       = 63  retries        = 3  timeout        = 8  port           = 8080  type           = \"HTTP\"  expected_codes = \"200\"  path           = \"/health\"  method         = \"GET\"  expected_body  = \"alive\"  headers {    name  = \"headerName\"    value = [\"example\", \"abc\"]  }}</code></p>", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument reference that you can specify for your resource. </p><ul><li><code>allow_insecure</code> - (Optional, String) Do not validate the certificate when monitor use HTTPS. This parameter is currently only valid for HTTPS monitors.</li><li><code>description</code> - (Optional, String)  Descriptive text of the Load Balancer monitor.</li><li><code>expected_body</code> - (Optional, String) A case-insensitive sub-string to look in the response body. If the string is not found, the origin will be marked as unhealthy. This parameter is only valid for HTTP and HTTPS monitors.</li><li><code>expected_codes</code> - (Optional, String) The expected HTTP response code or code range of the health check. This parameter is only valid for HTTP and HTTPS monitors. Allowable values are <code>200, 201, 202, 203, 204,205, 206, 207, 208, 226, xx</code>.</li><li><code>headers</code> - (Optional, Set) The HTTP request headers to send in the health check. It is recommended you set a host header by default. The <code>User-Agent</code> header cannot be overridden. This parameter is only valid for HTTP and HTTPS monitors.</li></ul><p>Nested scheme for <code>headers</code>:<br />    - <code>name</code> - (Required, String) The name of the HTTP request header.<br />  - <code>value</code>- (Required, List of string) The value of HTTP request header.<br />- <code>interval</code> - (Optional, Integer) The interval between each health check.<br />- <code>instance_id</code> - (Required, Forces new resource, String) The GUID of the private DNS.<br />- <code>method</code> - (Optional, String) The method to use for the health check applicable to HTTP or HTTPS based checks, the default value is <code>GET</code>.<br />- <code>name</code> - (Required, String) The name of the Load Balancer monitor.<br />- <code>path</code> - (Optional, String) The endpoint path to health check against. This parameter is only valid for HTTP and HTTPS monitors.<br />- <code>port</code> - (Optional, Integer) The port number to connect to for the health check. Required for TCP checks. HTTP and HTTPS checks should only define the port when using a non-standard port. For example, HTTP  default is <code>80</code>, and HTTPS default is <code>443</code>).<br />- <code>retries</code> - (Optional, Integer) The number of retries to attempt in case of a timeout before marking the origin as unhealthy.<br />- <code>timeout</code> - (Optional, Integer) The timeout (in seconds) before marking the health check as failed.<br />- <code>type</code> - (Optional, Forces new resource, String) The protocol to use for the health check. Currently supported protocols are <code>HTTP</code>,<code>HTTPS</code> and <code>TCP</code>. Default Value is <code>HTTP</code>.</p>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument reference list, you can access the following attribute references after your resource is created. </p><ul><li><code>created_on</code> - (Timestamp) The time (created on) of the DNS GLB monitor. </li><li><code>id</code> - (String) The unique ID of the private DNS Monitor. The ID is composed of <code>&lt;instance_id&gt;/&lt;glb_monitor_id&gt;</code>. </li><li><code>modified_on</code> - (Timestamp) The time (modified on) of the DNS GLB monitor.</li><li><code>monitor_id</code>- (String) The monitor ID.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>The <code>ibm_dns_glb_monitor</code> can be imported by using private DNS instance ID, and GLB Monitor ID.</p><p><strong>Example</strong></p><p><code>$ terraform import ibm_dns_glb_monitor.example 6ffda12064634723b079acdb018ef308/435da12064634723b079acdb018ef308</code></p>", "description": "<h1 id=\"ibm_dns_glb_monitor\">ibm_dns_glb_monitor</h1><p>Provides a private DNS GLB (GLB) monitor resource. This allows DNS (GLB)) monitor to create, update, and delete. For more information, see <a href=\"https://cloud.ibm.com/docs/dns-svcs?topic=dns-svcs-health-check-events\">Viewing GLB events</a>. </p>"}