{"ibm-hpcs": "<h1 id=\"ibm_hpcs\">ibm_hpcs</h1><p>Manages the Hyper Protect Crypto Services (HPCS) resource. This allows HPCS sub-resources to be added to an existing Hyper Protect Crypto Services instance.</p><p>~&gt; <strong>Note:</strong> As recovery crypto units are currently available only in the <code>us-south</code> and <code>us-east</code> regions, using Terraform to initialize Hyper Protect Crypto Services instances are supported only in these two regions. For more information about manual initialization, see <a href=\"https://cloud.ibm.com/docs/hs-crypto?topic=hs-crypto-initialize-instance-mode\">Introducing service instance initialization approaches.</a></p>", "set-up-crypto-unit-administrator-signature-keys": "<h2 id=\"set-up-crypto-unit-administrator-signature-keys\">Set up crypto unit administrator signature keys.</h2><p>You can select one of the following ways to create administrator signature keys:</p><h3 id=\"1-using-the-ibm-cloud-trusted-key-entry-tke-cli-plug-in\">1. Using the IBM Cloud Trusted Key Entry (TKE) CLI plug-in</h3><p>After you install and configure the TKE CLI plug-in by following these instructions, you can use the command <code>ibmcloud tke sigkey-add</code> to create administrator signature keys. The signature keys are stored in files that are protected by passwords on your local workstation. The file path is specified by the environment variable <code>CLOUDTKEFILES</code>.</p><h3 id=\"2-using-a-third-party-signing-service\">2. Using a third-party signing service</h3><p>A third-party signing service can be used to create, store, and access the signature keys used by both the TKE CLI plug-in and Terraform. To enable the signing service in the TKE CLI plug-in, you need to set the TKE_SIGNSERV_URL environment variable on the local workstation to the URL and port number where the signing service is running. To enable the signing service in Terraform, you need to set the <code>signature_server_url</code> parameter in the resource block to the same value.</p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><p>terraform<br />resource ibm_hpcs hpcs {<br />  location             = \"us-south\"<br />  name                 = \"test-hpcs\"<br />  plan                 = \"standard\"<br />  units                = 2<br />  signature_threshold  = 1<br />  revocation_threshold = 1<br />  admins {<br />    name  = \"admin1\"<br />    key   = \"/cloudTKE/1.sigkey\"<br />    token = \"<sensitive1234>\"<br />  }<br />  admins {<br />    name  = \"admin2\"<br />    key   = \"/cloudTKE/2.sigkey\"<br />    token = \"<sensitive1234>\"<br />  }<br />}</p><br />", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>The following arguments are supported:* <code>admins</code> - (Required, List) The list of administrators for the instance crypto units. You can set up to 8 administrators and the number needs to be equal to or greater than the thresholds that you specify. The following values need to be set for each administrator:<br />  Nested scheme for <code>admins</code>:<br />  * <code>key</code> - (Required, String) If you are using signature key files on the local workstation that are created by the TKE CLI plug-in and are not using a third-party signing service, specify the absolute path and the file name of the signature key file that is to be used.</p><pre><code>~&gt; **Note:** If you are using a signing service (`signature_server_url`) to provide signature keys, specify the name of the signature key depending on the signing service definition. The character string for the key name is appended to a URI that is sent to the signing service and must contain only unreserved characters as defined by section 2.3 of RFC3986.</code></pre><ul><li><code>name</code> - (Required, String) The name of the administrator. It needs to be no more than 30 characters in length.</li><li><p><code>token</code> - (Required, String, Sensitive) If you are using signature key files on the local workstation that are created by the TKE CLI plug-in and are not using a third-party signing service, specify the administrator password to access the corresponding signature key file.</p><p>~&gt; <strong>Note:</strong> If you are using a signing service (<code>signature_server_url</code>) to provide signature keys, specify the token that authorizes use of the signature key depending on the signing service definition.* <code>failover_units</code> - (Optional, Integer) The number of failover crypto units for your service instance. Valid values are <code>0</code>, <code>2</code>, or <code>3</code>, and it must be less than or equal to the number of operational crypto units. If you set it <code>0</code>, cross-region high availability will not be enabled. Currently, you can enable this option only in the <code>us-south</code> and <code>us-east</code> region. If you do not specify the value, the default value is 0. * <code>location</code> - (Required, String) The region abbreviation, such as <code>us-south</code>, that represents the geographic area where the operational crypto units of your service instance are located. For more information, see <a href=\"https://cloud.ibm.com/docs/hs-crypto?topic=hs-crypto-regions\">Regions and locations</a>. As recovery crypto units are available only in <code>us-south</code> and <code>us-east</code>, only these two regions are supported if you want to use Terraform for instance initialization.* <code>name</code> - (Required, String) The name of your Hyper Protect Crypto Services instance.* <code>plan</code> - (Required, String) The pricing plan for your service instance. Currently, only the standard plan is supportd.* <code>resource_group_id</code> - (Optional, String) The ID of resource group where you want to organize and manage your service instance.* <code>revocation_threshold</code> - (Required, Integer) The number of administrator signatures that is required to remove an administrator after you leave imprint mode. The valid value is between <code>1</code> and <code>8</code>.* <code>service_endpoints</code> - (Optional, String) The network access to your service instance. Valid values are <code>public-and-private</code> and <code>private-only</code>. If you do not specify the value, the default setting is <code>public-and-private</code>.* <code>signature_server_url</code> - (Optional, String) The URL and port number where the signing service is running. If you are using a third-party signing service to provide administrator signature keys, you need to specify this parameter.</p></li></ul><p>~&gt; <strong>Note:</strong> If you manage multiple service instances in the <code>main.tf</code> file, make sure to set the same <code>signature_server_url</code> parameter for each instance. Otherwise, you will not be able to perform the actions successfully.* <code>signature_threshold</code>- (Required, Integer) The number of administrator signatures that is required to execute administrative commands. The valid value is between 1 and 8. You need to set it to at least 2 to enable quorum authentication.* <code>tags</code> - (Optional, Array of strings) Tags that are associated with your instance are used to organize your resources. * <code>units</code> -(Required, Integer) The number of operational crypto units for your service instance. Valid values are <code>2</code> and <code>3</code>.</p>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all arguments above, the following attributes are exported:</p><ul><li><code>created_at</code> - (String) The date when the instance was created.</li><li><code>created_by</code> - (String) The subject who created the instance.</li><li><code>crn</code> - (String) CRN of the Hyper Protect Crypto Services instance.</li><li><code>deleted_at</code> - (String) The date when the instance was deleted.</li><li><code>deleted_by</code> - (String) The subject who deleted the instance.</li><li><code>extensions</code> - (List) The extended metadata as a map associated with the resource instance.</li><li><code>guid</code> - (String) Unique identifier of resource instance.</li><li><code>hsm_info</code> - (List) HSM config of the crypto units.<br />  Nested scheme for <code>hsm_info</code>:</li><li><code>admins</code> - (List) List of Admins for Crypto Units<br />    Nested scheme for <code>admins</code>:<ul><li><code>name</code> - (String) Name of an adminsitrator.</li><li><code>ski</code> - (String) Subject Key Identifier of the administrator signature key.</li></ul></li><li><code>current_mk_status</code> - (String) Status of Current Master Key Register.</li><li><code>current_mkvp</code> - (String) Current Master Key Register Verification Pattern.</li><li><code>hsm_id</code> - (String) HSM ID.</li><li><code>hsm_location</code> - (String) HSM Location.</li><li><code>hsm_type</code> - (String) HSM Type.</li><li><code>new_mk_status</code> - (String) Status of New Master Key Register.</li><li><code>new_mkvp</code> - (String) New Master Key Register Verification Pattern.</li><li><code>revocation_threshold</code> - (Int) Revocation Threshold for Crypto Units.</li><li><code>signature_threshold</code>- (Int) Signature Threshold for Crypto Units.</li><li><code>id</code> - (String) The unique identifier CRN of this Hyper Protect Crypto Services instance.</li><li><code>location</code> - (String) The location for this Hyper Protect Crypto Services instance.</li><li><code>plan</code> - (String) The pricing plan for your service instance.</li><li><code>resource_aliases_url</code> - (String) The relative path to the resource aliases for the instance.</li><li><code>resource_bindings_url</code> - (String) The relative path to the resource bindings for the instance.</li><li><code>resource_keys_url</code> - (String) The relative path to the resource keys for the instance.</li><li><code>restored_at</code> - (String) The date when the instance under reclamation was restored.</li><li><code>restored_by</code> - (String) The subject who restored the instance back from reclamation.</li><li><code>scheduled_reclaim_at</code> - (String) The date when the instance was scheduled for reclamation.</li><li><code>scheduled_reclaim_by</code> - (String) The subject who initiated the instance reclamation.</li><li><code>service</code> - (String) The service type (<code>hs-crypto</code>) of the instance.</li><li><code>state</code> - (String) The current state of the instance. For example, if the instance is deleted, it will return removed.</li><li><code>status</code> - (String) Status of the hpcs instance.</li><li><code>update_at</code> - (String) The date when the instance was last updated.</li><li><code>update_by</code> - (String) The subject who updated the instance.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>The <code>ibm_hpcs</code> can be imported by using the <code>crn</code>.</p><p>bash<br />terraform import ibm_hpcs.hpcs <crn></p><p><strong>Example</strong></p><p>$ terraform import ibm_hpcs.hpcs crn:v1:bluemix:public:hs-crypto:us-south:a/4448261269a14562b839e0a3019ed980:f115115b-5087-4a4e-9cc8-71acf0542c0d::</p>", "description": "<h1 id=\"ibm_hpcs\">ibm_hpcs</h1><p>Manages the Hyper Protect Crypto Services (HPCS) resource. This allows HPCS sub-resources to be added to an existing Hyper Protect Crypto Services instance.</p><p>~&gt; <strong>Note:</strong> As recovery crypto units are currently available only in the <code>us-south</code> and <code>us-east</code> regions, using Terraform to initialize Hyper Protect Crypto Services instances are supported only in these two regions. For more information about manual initialization, see <a href=\"https://cloud.ibm.com/docs/hs-crypto?topic=hs-crypto-initialize-instance-mode\">Introducing service instance initialization approaches.</a></p>"}