{"ibm-is-dedicated-host": "<h1 id=\"ibm_is_dedicated_host\">ibm_is_dedicated_host</h1><p>Create, update, delete and suspend the dedicated host resource. For more information, about dedicated host in your IBM Cloud VPC, see <a href=\"https://cloud.ibm.com/docs/vpc?topic=vpc-creating-dedicated-hosts-instances\">Dedicated hosts</a>.</p><p><strong>Note:</strong> <br />VPC infrastructure services are a regional specific based endpoint, by default targets to <code>us-south</code>. Please make sure to target right region in the provider block as shown in the <code>provider.tf</code> file, if VPC service is created in region other than <code>us-south</code>.</p><p><strong>provider.tf</strong></p><p><code>terraformprovider \"ibm\" {  region = \"eu-gb\"}</code></p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><p><code>terraformresource \"ibm_is_dedicated_host_group\" \"example\" {  family = \"memory\"  class  = \"beta\"  zone   = \"us-south-1\"}data \"ibm_is_dedicated_host_group\" \"example\" {  name = ibm_is_dedicated_host_group.example.name}resource \"ibm_is_dedicated_host\" \"example\" {  profile    = \"dh2-56x464\"  host_group = ibm_is_dedicated_host_group.example.id  name       = \"example-dh-host\"}</code></p>", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument reference that you can specify for your resource. </p><ul><li><code>access_tags</code>  - (Optional, List of Strings) A list of access management tags to attach to the dedicated host.</li></ul><p>~&gt; <strong>Note:</strong> <br /><strong>&#x2022;</strong> You can attach only those access tags that already exists.</br><br /><strong>&#x2022;</strong> For more information, about creating access tags, see <a href=\"https://cloud.ibm.com/docs/account?topic=account-tag&amp;interface=ui#create-access-console\">working with tags</a>.</br><br /><strong>&#x2022;</strong> You must have the access listed in the <a href=\"https://cloud.ibm.com/docs/account?topic=account-access\">Granting users access to tag resources</a> for <code>access_tags</code></br><br /><strong>&#x2022;</strong> <code>access_tags</code> must be in the format <code>key:value</code>.<br />- <code>host_group</code> - (Required, String)The unique ID of the dedicated host group for this dedicated host.<br />- <code>instance_placement_enabled</code>- (Optional, Bool) If set to <strong>true</strong> instances can be placed on the dedicated host.<br />- <code>name</code> - (Optional, String) The unique user-defined name for the dedicated host. If unspecified, the name will be a hyphenated list of randomly selected words.<br />- <code>profile</code>-  (String)  Required - The globally unique name of the dedicated host profile to use for the dedicated host.<br />- <code>resource_group</code>- (Optional, String) The unique ID of the resource group to use. If unspecified, the account's <a href=\"https://cloud.ibm.com/apidocs/resource-manager#introduction\">default resource group</a> is used.</p>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument reference list, you can access the following attribute reference after your resource is created.</p><ul><li><code>id</code>-  (String) The unique ID of the dedicated host.</li><li><code>available_memory</code>-  (String) The amount of memory in <code>GB</code> that is currently available for instances.</li><li><code>available_vcpu</code>-  (String) The available <code>VCPU</code> for the dedicated host.</li><li><code>created_at</code>-  (String) The date and time that the dedicated host was created.</li><li><p><code>crn</code>-  (String) The CRN for this dedicated host.</p></li><li><p><code>disks</code> - (List) Collection of the dedicated host's disks. Nested <code>disks</code> blocks have the following structure:</p></li></ul><p>Nested scheme for <code>disks</code>:<br />  - <code>available</code> - (String) The remaining space left for instance placement in GB (gigabytes).<br />  - <code>created_at</code> - (String) The date and time that the disk was created.<br />  - <code>href</code> - (String) The URL for this disk.<br />  - <code>id</code> - (String) The unique identifier for this disk.<br />  - <code>instance_disks</code> - (List) Instance disks that are on this dedicated host disk. Nested <code>instance_disks</code> blocks have the following structure:</p><pre><code>  Nested scheme for `instance_disks`:  - `deleted` - (List) If present, this property indicates the referenced resource has been deleted and providessome supplementary information. Nested `deleted` blocks have the following structure:      Nested scheme for `deleted`:      - `more_info` - (String) Link to documentation about deleted resources.  - `href` - (String) The URL for this instance disk.  - `id` - (String) The unique identifier for this instance disk.  - `name` - (String) The user defined name for this disk.  - `resource_type` - (String) The resource type.</code></pre><ul><li><code>interface_type</code> - (String) The disk interface used for attaching the disk. The enumerated values for this property are expected to expand in the future. When processing this property, check for and log unknown values. Optionally halt processing and surface the error, or bypass the resource on which the unexpected property value was encountered.</li><li><code>lifecycle_state</code> - (String) The lifecycle state of this dedicated host disk.</li><li><code>name</code> - (String) The user defined or system provided name for this disk.</li><li><code>provisionable</code> - (String) Indicates whether this dedicated host disk is available for instance disk creation.</li><li><code>resource_type</code> - (String) The type of resource reference.</li><li><code>size</code> - (String) The size of the disk in GB (gigabytes).</li><li><code>supported_instance_interface_types</code> - (String) The instance disk interfaces supported for this dedicated host disk.</li><li><code>host_group</code>-  (String) The unique ID of the dedicated host group this dedicated host is in.</li><li><code>href</code>-  (String) The URL for this dedicated host.</li><li><code>instance_placement_enabled</code>-  (String) If set to <strong>true</strong>, instances can be placed on this dedicated host.</li><li><code>instances</code>-  (List)  Array of instances that are allocated to this dedicated host.</li></ul><p>Nested scheme for <code>instance</code>:<br />  - <code>crn</code>-  (List) The CRN for the VSI.</p><pre><code>Nested scheme for `crn`:- `deleted`-  (List) If present, this property indicates the referenced resource has been deleted and provides supplementary information. Nested deleted blocks have the following structure.  Nested scheme for `deleted`:  - `more_info`-  (String) Link to documentation about deleted resources.- `href`-  (String) The URL for this VSI.- `id`-  (String) The unique ID for this virtual server instance.- `name`-  (String) The user defined name for the VSI and is the default system hostname.</code></pre><ul><li><code>lifecycle_state</code>-  (String) The lifecycle state of the dedicated host resource.</li><li><code>memory</code>-  (String) The total amount of memory in <code>GB</code> for this host.</li><li><code>name</code>-  (String) The unique user defined name for this dedicated host.</li><li><code>profile</code>-  (String) The profile this dedicated host uses.</li><li><code>provisionable</code>-  (String) Indicates whether this dedicated host is available for instance creation.</li><li><code>resource_group</code>-  (String) The unique identifier of the resource group for this dedicated host.</li><li><code>resource_type</code>-  (String) The type of resource referenced.</li><li><code>socket_count</code>-  (String) The total number of sockets for this host.</li><li><code>state</code>-  (String) The administrative state of the dedicated host. The enumerated values for this property are expected to expand in the future. When processing this property, check for and log unknown values. Optionally, halt processing and surface the error, or bypass the dedicated host on which the unexpected property value was encountered.</li><li><code>supported_instance_profiles</code>-  (String) Array of instance profiles that can be used by instances placed on this dedicated host.</li><li><code>vcpu</code>-  (String) The total <code>VCPU</code> of the dedicated host.</li><li><code>zone</code>-  (String) The zone this dedicated host resides in.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>The <code>ibm_is_dedicated_host</code> resource can be imported by using dedicated host ID.</p><p><strong>Example</strong></p><p><code>$ terraform import ibm_is_dedicated_host.example 0716-1c372bb2-decc-4555111a6-1010101</code></p>", "description": "<h1 id=\"ibm_is_dedicated_host\">ibm_is_dedicated_host</h1><p>Create, update, delete and suspend the dedicated host resource. For more information, about dedicated host in your IBM Cloud VPC, see <a href=\"https://cloud.ibm.com/docs/vpc?topic=vpc-creating-dedicated-hosts-instances\">Dedicated hosts</a>.</p><p><strong>Note:</strong> <br />VPC infrastructure services are a regional specific based endpoint, by default targets to <code>us-south</code>. Please make sure to target right region in the provider block as shown in the <code>provider.tf</code> file, if VPC service is created in region other than <code>us-south</code>.</p><p><strong>provider.tf</strong></p><p><code>terraformprovider \"ibm\" {  region = \"eu-gb\"}</code></p>"}