{"ibm-is-image-export-job": "<h1 id=\"ibm_is_image_export_job\">ibm_is_image_export_job</h1><p>Provides a resource for ImageExportJob. This allows ImageExportJob to be created, updated and deleted. For more information about VPC custom images export, see <a href=\"https://cloud.ibm.com/docs/vpc?topic=vpc-managing-custom-images&amp;interface=ui#custom-image-export-to-cos\">IBM Cloud Docs: Virtual Private Cloud - Exporting a custom image to IBM Cloud Object Storage</a>.</p><p>~&gt; <strong>Note</strong><br />  Image export jobs are asynchronous. Time taken to export the image depends on its size. Hence the resource will not wait for job status to be completed. It is recommended to check the status of the export job by refreshing this resource or the datasources <code>ibm_is_image_export_job</code> and <code>ibm_is_image_export_jobs</code> and recreate the export resource if it is failed.</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p><code>hclresource \"ibm_is_image\" \"example\" {  name               = \"example-image\"  href               = \"cos://us-south/custom-image-vpc-bucket/customImage-0.vhd\"  operating_system   = \"ubuntu-16-04-amd64\"  encrypted_data_key = \"eJxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx0=\"  encryption_key     = \"crn:v1:bluemix:public:kms:us-south:a/6xxxxxxxxxxxxxxx:xxxxxxx-xxxx-xxxx-xxxxxxx:key:dxxxxxx-fxxx-4xxx-9xxx-7xxxxxxxx\"}// Create export job with storage bucket nameresource \"ibm_is_image_export_job\" \"example\" {  image               = ibm_is_image.example.id  name                = \"my-image-export\"  storage_bucket {    name = \"bucket-27200-lwx4cfvcue\"  }}// Create export job with storage bucket CRNresource \"ibm_is_image_export_job\" \"example\" {  image               = ibm_is_image.example.id  name                = \"my-image-export\"  storage_bucket {    crn = \"crn:v1:bluemix:public:cloud-object-storage:global:a/XXXXeaXXXX5XXXX0f0XXXX92ff85XXXX:aaXXXXX1-07XX-42XX-b8d0-aXXXXXX243:bucket:dallas-bucket\"  }}</code></p>", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>Review the argument reference that you can specify for your resource.</p><ul><li><code>format</code> - (Optional, Forces new resource, String) The format to use for the exported image. If the image is encrypted, only <code>qcow2</code> is supported. Allowable values are: <code>qcow2</code>, <code>vhd</code>. Default value is <code>qcow2</code>.</li><li><code>image</code> - (Required, Forces new resource, String) The image identifier.</li><li><code>name</code> - (Optional, String) The user-defined name for this image export job. Names must be unique within the image this export job resides in. If unspecified, the name will be a hyphenated list of randomly-selected words prefixed with the first 16 characters of the parent image name.The exported image object name in Cloud Object Storage (<code>storage_object.name</code> in the response) will be based on this name. The object name will be unique within the bucket.</li><li><code>storage_bucket</code> - (Required, Forces new resource, List) The Cloud Object Storage bucket to export the image to. The bucket must exist and an IAM service authorization must grant Image Service for VPC of VPC Infrastructure Services writer access to the bucket.</li></ul><p>Nested scheme for <code>storage_bucket</code>:<br />  - <code>name</code> - (Optional, String) Name of this Cloud Object Storage bucket.<br />  - <code>crn</code> - (Optional, String) The CRN of this Cloud Object Storage bucket</p><p>-&gt; <strong>NOTE:</strong><br />  Within <code>storage_bucket</code>, <code>name</code> and <code>crn</code> are mutually exclusive. Provide either one of them.</p>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute Reference</h2><p>In addition to all argument references listed, you can access the following attribute references after your resource is created.</p><ul><li><code>completed_at</code> - (String) The date and time that the image export job was completed.If absent, the export job has not yet completed.</li><li><code>created_at</code> - (String) The date and time that the image export job was created.</li><li><code>encrypted_data_key</code> - (Optional, String) A base64-encoded, encrypted representation of the key that was used to encrypt the data for the exported image. This key can be unwrapped with the image's <code>encryption_key</code> root key using either Key Protect or Hyper Protect Crypto Service.If absent, the export job is for an unencrypted image.</li><li><code>href</code> - (String) The URL for this image export job.</li><li><code>id</code> - The unique identifier of the ImageExportJob. Follows the format <image_id>/<image_export_job_id>.</li><li><code>image_export_job</code> - (String) The unique identifier for this image export job.</li><li><code>resource_type</code> - (String) The type of resource referenced.</li><li><code>started_at</code> - (String) The date and time that the image export job started running.If absent, the export job has not yet started.</li><li><code>status</code> - (String) The status of this image export job:- <code>deleting</code>: Export job is being deleted- <code>failed</code>: Export job could not be completed successfully- <code>queued</code>: Export job is queued- <code>running</code>: Export job is in progress- <code>succeeded</code>: Export job was completed successfullyThe exported image object is automatically deleted for <code>failed</code> jobs. Allowable values are: <code>deleting</code>, <code>failed</code>, <code>queued</code>, <code>running</code>, <code>succeeded</code>.</li><li><code>status_reasons</code> - (List) The reasons for the current status (if any).The enumerated reason code values for this property will expand in the future. When processing this property, check for and log unknown values. Optionally halt processing and surface the error, or bypass the resource on which the unexpected reason code was encountered.<br />Nested scheme for <strong>status_reasons</strong>:</li><li><code>code</code> - (String) A snake case string succinctly identifying the status reason.</li><li><code>message</code> - (String) An explanation of the status reason.</li><li><code>more_info</code> - (Optional, String) Link to documentation about this status reason.</li><li><code>storage_href</code> - (String) The Cloud Object Storage location of the exported image object. The object at this location may not exist until the job is started, and will be incomplete while the job is running.After the job completes, the exported image object is not managed by the IBM VPC service, and may be removed or replaced with a different object by any user or service with IAM authorization to the bucket.</li><li><code>storage_object</code> - (List) The Cloud Object Storage object for the exported image. This object may not exist untilthe job is started, and will not be complete until the job completes.<br />Nested scheme for <strong>storage_object</strong>:</li><li><code>name</code> - (String) The name of this Cloud Object Storage object. Names are unique within a Cloud Object Storage bucket.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>You can import the <code>ibm_is_image_export_job</code> resource by using <code>id</code>.<br />The <code>id</code> property can be formed from <code>image_id</code>, and <code>id</code> in the following format:</p><p><code>&lt;image_id&gt;/&lt;id&gt;</code><br />- <code>image_id</code>: A string. The image identifier.<br />- <code>id</code>: A string. The image export job identifier.</p>", "syntax": "<h1 id=\"syntax\">Syntax</h1><p><code>$ terraform import ibm_is_image_export_job.is_image_export &lt;image_id&gt;/&lt;id&gt;</code></p>", "description": "<h1 id=\"ibm_is_image_export_job\">ibm_is_image_export_job</h1><p>Provides a resource for ImageExportJob. This allows ImageExportJob to be created, updated and deleted. For more information about VPC custom images export, see <a href=\"https://cloud.ibm.com/docs/vpc?topic=vpc-managing-custom-images&amp;interface=ui#custom-image-export-to-cos\">IBM Cloud Docs: Virtual Private Cloud - Exporting a custom image to IBM Cloud Object Storage</a>.</p><p>~&gt; <strong>Note</strong><br />  Image export jobs are asynchronous. Time taken to export the image depends on its size. Hence the resource will not wait for job status to be completed. It is recommended to check the status of the export job by refreshing this resource or the datasources <code>ibm_is_image_export_job</code> and <code>ibm_is_image_export_jobs</code> and recreate the export resource if it is failed.</p>"}