{"ibm-is-vpc": "<h1 id=\"ibm_is_vpc\">ibm_is_vpc</h1><p>Create, update, or delete a Virtual Private Cloud (VPC). VPCs allow you to create your own space in IBM Cloud to run an isolated environment within the public cloud. VPC gives you the security of a private cloud, with the agility and ease of a public cloud. For more information, about VPC, see <a href=\"https://cloud.ibm.com/docs/vpc?topic=vpc-getting-started\">getting started with Virtual Private Cloud</a>.</p><p><strong>Note:</strong> <br />VPC infrastructure services are a regional specific based endpoint, by default targets to <code>us-south</code>. Please make sure to target right region in the provider block as shown in the <code>provider.tf</code> file, if VPC service is created in region other than <code>us-south</code>.</p><p><strong>provider.tf</strong></p><p><code>terraformprovider \"ibm\" {  region = \"eu-gb\"}</code></p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><p>The following example to create a VPC:</p><p>terraform<br />resource \"ibm_is_vpc\" \"example\" {<br />  name = \"example-vpc\"<br />}</p><p></p>", "timeouts": "<h2 id=\"timeouts\">Timeouts</h2><p>The <code>ibm_is_vpc</code> resource provides the following [<a href=\"https://www.terraform.io/docs/language/resources/syntax.html\">Timeouts</a> configuration options:</p><ul><li><strong>create</strong>: The creation of the VPC is considered <code>failed</code> when no response is received for 10 minutes. </li><li><strong>delete</strong>: The deletion of the VPC is considered <code>failed</code> when no response is received for 10 minutes. </li></ul>", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument references that you can specify for your resource. </p><ul><li><code>access_tags</code>  - (Optional, List of Strings) A list of access management tags to attach to the bare metal server.</li></ul><p>~&gt; <strong>Note:</strong> <br /><strong>&#x2022;</strong> You can attach only those access tags that already exists.</br><br /><strong>&#x2022;</strong> For more information, about creating access tags, see <a href=\"https://cloud.ibm.com/docs/account?topic=account-tag&amp;interface=ui#create-access-console\">working with tags</a>.</br><br /><strong>&#x2022;</strong> You must have the access listed in the <a href=\"https://cloud.ibm.com/docs/account?topic=account-access\">Granting users access to tag resources</a> for <code>access_tags</code></br><br /><strong>&#x2022;</strong> <code>access_tags</code> must be in the format <code>key:value</code>.<br />- <code>address_prefix_management</code> - (Optional, Forces new resource, String) Indicates whether a default address prefix should be created automatically <code>auto</code> or manually <code>manual</code> for each zone in this VPC. Default value is <code>auto</code>.<br />- <code>classic_access</code> - (Optional, Bool) Specify if you want to create a VPC that can connect to classic infrastructure resources. Enter <strong>true</strong> to set up private network connectivity from your VPC to classic infrastructure resources that are created in the same IBM Cloud account, and <strong>false</strong> to disable this access. If you choose to not set up this access, you cannot enable it after the VPC is created. Make sure to review the <a href=\"https://cloud.ibm.com/docs/vpc-on-classic-network?topic=vpc-on-classic-setting-up-access-to-your-classic-infrastructure-from-vpc#vpc-prerequisites\">prerequisites</a> before you create a VPC with classic infrastructure access. Note that you can enable one VPC for classic infrastructure access per IBM Cloud account only.<br />- <code>default_network_acl_name</code> - (Optional, String) Enter the name of the default network access control list (ACL).<br />- <code>default_security_group_name</code> - (Optional, String) Enter the name of the default security group.<br />- <code>default_routing_table_name</code> - (Optional, String) Enter the name of the default routing table.<br />- <code>name</code> - (Required, String) Enter a name for your VPC. No.<br />- <code>no_sg_acl_rules</code> - (Optional, Bool) If set to true, delete all rules attached to default security group and default network ACL for a new VPC. This attribute has no impact on update. default false.<br />- <code>resource_group</code> - (Optional, Forces new resource, String) Enter the ID of the resource group where you want to create the VPC. To list available resource groups, run <code>ibmcloud resource groups</code>. If you do not specify a resource group, the VPC is created in the <code>default</code> resource group. <br />- <code>tags</code> - (Optional, Array of Strings) Enter any tags that you want to associate with your VPC. Tags might help you find your VPC more easily after it is created. Separate multiple tags with a comma (<code>,</code>).</p>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument reference list, you can access the following attribute reference after your resource is created.</p><ul><li><code>crn</code> - (String) The CRN of the VPC.</li><li><code>cse_source_addresses</code>- (List) A list of the cloud service endpoints that are associated with your VPC, including their source IP address and zone.<ul><li><code>address</code> - (String) The IP address of the cloud service endpoint.</li><li><code>zone_name</code> - (String) The zone where the cloud service endpoint is located.</li></ul></li><li><code>default_security_group_crn</code> - (String) CRN of the default security group created and attached to the VPC. </li><li><code>default_security_group</code> - (String) The default security group ID created and attached to the VPC. </li><li><code>default_network_acl_crn</code>-  (String) CRN of the default network ACL ID created and attached to the VPC.</li><li><code>default_network_acl</code>-  (String) The default network ACL ID created and attached to the VPC.</li><li><code>default_routing_table</code>-  (String) The unique identifier of the VPC default routing table.</li><li><code>id</code> - (String) The unique identifier of the VPC that you created.</li><li><code>subnets</code>- (List of Strings) A list of subnets that are attached to a VPC.</li></ul><p>Nested scheme for <code>subnets</code>:<br />  - <code>available_ipv4_address_count</code>-String - Available IPv4 addresses available for the usage in the subnet.<br />  - <code>available_ipv4_address_count</code>- (Integer) The number of IPv4 addresses in the subnet that are available for you to be used.<br />  - <code>id</code> - (String) The ID of the subnet.<br />  - <code>name</code> - (String) The name of the subnet.<br />  - <code>status</code> - (String) The status of the subnet.<br />  - <code>total_ipv4_address_count</code>- (Integer) The total number of IPv4 addresses in the subnet.<br />  - <code>zone</code> - (String) The Zone of the subnet. <br />- <code>status</code> - (String) The provisioning status of your VPC. <br />- <code>security_group</code> - (List) A list of security groups attached to VPC. </p><p>Nested scheme for <code>security_group</code>:<br />  - <code>group_id</code> - (String) The security group ID.<br />  - <code>group_name</code> - (String) The name of the security group.<br />  - <code>rules</code> - (List) Set of rules attached to a security group.</p><pre><code>Nested scheme for `rules`:- `code`- (String) The ICMP traffic code to allow.- `direction`- (String) The direction of the traffic either inbound or outbound.- `ip_version`-  (String) The IP version: **ipv4**.- `remote` -  (String) Security group ID, an IP address, a CIDR block, or a single security group identifier.- `rule_id` - (String) The rule ID.- `port_min` - (String) The inclusive lower bound of TCP port range.- `port_max` - (String) The inclusive upper bound of TCP port range.- `type` - (String) The ICMP traffic type to allow.</code></pre>", "import": "<h2 id=\"import\">Import</h2><p>The <code>ibm_is_vpc</code> resource can be imported by using the VPC ID.</p><p><strong>Syntax</strong></p><p><code>$ terraform import ibm_is_vpc.example &lt;vpc_ID&gt;</code></p><p><strong>Example</strong></p><p><code>$ terraform import ibm_is_vpc.example d7bec597-4726-451f-8a63-e62e6f19c32c</code></p>", "description": "<h1 id=\"ibm_is_vpc\">ibm_is_vpc</h1><p>Create, update, or delete a Virtual Private Cloud (VPC). VPCs allow you to create your own space in IBM Cloud to run an isolated environment within the public cloud. VPC gives you the security of a private cloud, with the agility and ease of a public cloud. For more information, about VPC, see <a href=\"https://cloud.ibm.com/docs/vpc?topic=vpc-getting-started\">getting started with Virtual Private Cloud</a>.</p><p><strong>Note:</strong> <br />VPC infrastructure services are a regional specific based endpoint, by default targets to <code>us-south</code>. Please make sure to target right region in the provider block as shown in the <code>provider.tf</code> file, if VPC service is created in region other than <code>us-south</code>.</p><p><strong>provider.tf</strong></p><p><code>terraformprovider \"ibm\" {  region = \"eu-gb\"}</code></p>"}