{"ibm-org": "<h1 id=\"ibm_org\">ibm_org</h1><p>Create, update, or delete a Cloud Foundry organization. For more information, about organization, see <a href=\"https://cloud.ibm.com/docs/account?topic=account-orgupdates\">updating organization and spaces</a>.</p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><p>The following example create the <code>myorg</code> Cloud Foundry organization and assigns users access to the organization. </p><br /><p>terraform<br />resource \"ibm_org\" \"testacc_org\" {<br />    name = \"myorg\"<br />    org_quota_definition_guid = \"myorgquotaguid\"<br />    auditors = [\"auditor@in.ibm.com\"]<br />    managers = [\"manager@in.ibm.com\"]<br />    users = [\"user@in.ibm.com\"]<br />    billing_managers = [\"billingmanager@in.ibm.com\"]<br />}</p><br />", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument reference that you can specify for your resource. </p><ul><li><code>auditors</code>(Optional, Sets) The email addresses of the users that you want to assign Cloud Foundry <strong>Auditor</strong> access to. The email address needs to be associated with an IBMID. Auditors have the following permissions within the org: <ul><li>View users and their assigned roles.</li><li>View quota information.</li></ul>.</li><li><code>billing_managers</code>(Optional, Sets) The email addresses of the users that you want to assign the <strong>Billing manager</strong> access to. The email address needs to be associated with an IBMID. Billing managers have the following permissions within the org: <ul><li>View runtime and service usage information on the usage dashboard.</li></ul>.</li><li><code>managers</code>(Optional, Sets) The email addresses of the users that you want to assign Cloud Foundry <strong>Manager</strong> access to. The email address needs to be associated with an IBMID. Managers have the following permissions within the org: <ul><li>Create, view, edit, or delete spaces.</li><li>View usage and quota information.</li><li>Invite users and manage user access. </li><li> Assign roles to users.</li><li>Manage custom domains.</li></ul>.</li><li><code>name</code> - (Required, String) The descriptive name used of the Cloud Foundry organization. The name must be unique in IBM Cloud.</li><li><code>org_quota_definition_guid</code> - (Optional, String) The GUID for the quota that is assigned to organization. The quota sets memory, service, and instance limits for the organization.</li><li><code>tags</code>-(Optional, array of strings) Tags associated with the org.  <strong>Note</strong> Tags are managed locally and not stored on the IBM Cloud service endpoint.</li><li><code>users</code>(Optional, Sets) The email addresses of the users that you want to grant org-level access to. The email address needs to be associated with an IBMID.</li></ul><p><strong>Note</strong></p><p>By default, the user that creates this resource is assigned the <strong>Manager</strong> Cloud Foundry role.  Terraform returns an error when you assign the <strong>Manager</strong> or Cloud Foundry user role to yourself. User information is not persisted in the  Terraform state file to avoid any incorrect information.</p>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument references list, you can access the following attribute references after your resource is created.</p><ul><li><code>id</code> - (String) The unique identifier of the Cloud Foundry organization.</li></ul><h3 id=\"import\">Import</h3><p>The Cloud Foundry organization can be imported by using the <code>id</code>.</p><p><strong>Syntax</strong></p><p>$ terraform import ibm_org.myorg <id></p><p><strong>Example</strong></p><p>$ terraform import ibm_org.myorg abde-12345</p><p>If you bring your current organization in Terraform management, you can perform others operations such as adding a user or assigning users with the required roles.</p>", "description": "<h1 id=\"ibm_org\">ibm_org</h1><p>Create, update, or delete a Cloud Foundry organization. For more information, about organization, see <a href=\"https://cloud.ibm.com/docs/account?topic=account-orgupdates\">updating organization and spaces</a>.</p>"}