{"ibm-schematics-workspace": "<h1 id=\"ibm_schematics_workspace\">ibm_schematics_workspace</h1><p>Create, read, update, and delete operations of Schematics workspace. Other Schematics operations such as plan, apply, destroy that are available through Schematics console are currently not supported. For more information, about IBM Cloud Schematics workspace, refer to <a href=\"https://cloud.ibm.com/docs/schematics?topic=schematics-workspace-setup\">setting up workspaces</a>.</p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><p><code>terraformresource \"ibm_schematics_workspace\" \"schematics_workspace\" {  name = \"&lt;workspace_name&gt;\"  description = \"&lt;workspace_description&gt;\"  location = \"us-east\"  resource_group = \"default\"  template_type = \"terraform_v0.13.5\"}</code></p>", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument reference that you can specify for your resource.</p><ul><li><code>applied_shareddata_ids</code> - (Optional, List) List of applied shared dataset ID.</li><li><code>catalog_ref</code> - (Optional, List) Information about the software template that you chose from the IBM Cloud catalog. This information is returned for IBM Cloud catalog offerings only. MaxItems:1.<br />Nested scheme for <strong>catalog_ref</strong>:<ul><li><code>dry_run</code> - (Optional, Boolean) Dry run.</li><li><code>owning_account</code> - (Optional, String) Owning account ID of the catalog.</li><li><code>item_icon_url</code> - (Optional, String) The URL to the icon of the software template in the IBM Cloud catalog.</li><li><code>item_id</code> - (Optional, String) The ID of the software template that you chose to install from the IBM Cloud catalog. This software is provisioned with Schematics.</li><li><code>item_name</code> - (Optional, String) The name of the software that you chose to install from the IBM Cloud catalog.</li><li><code>item_readme_url</code> - (Optional, String) The URL to the readme file of the software template in the IBM Cloud catalog.</li><li><code>item_url</code> - (Optional, String) The URL to the software template in the IBM Cloud catalog.</li><li><code>launch_url</code> - (Optional, String) The URL to the dashboard to access your software.</li><li><code>offering_version</code> - (Optional, String) The version of the software template that you chose to install from the IBM Cloud catalog.</li></ul></li><li><code>description</code> - (Optional, String) The description of the workspace.</li><li><code>location</code> - (Optional, String) The location where you want to create your Schematics workspace and run the Schematics jobs. The location that you enter must match the API endpoint that you use. For example, if you use the Frankfurt API endpoint, you must specify <code>eu-de</code> as your location. If you use an API endpoint for a geography and you do not specify a location, Schematics determines the location based on availability.</li><li><code>name</code> - (Required, String) The name of your workspace. The name can be up to 128 characters long and can include alphanumeric characters, spaces, dashes, and underscores. When you create a workspace for your own Terraform template, consider including the microservice component that you set up with your Terraform template and the IBM Cloud environment where you want to deploy your resources in your name.</li><li><code>resource_group</code> - (Optional, String) The ID of the resource group where you want to provision the workspace.</li><li><code>shared_data</code> - (Optional, List) Information about the Target used by the templates originating from the  IBM Cloud catalog offerings. This information is not relevant for workspace created using your own Terraform template. MaxItems:1.<br />Nested scheme for <strong>shared_data</strong>:<ul><li><code>cluster_created_on</code> - (Optional, String) Cluster created on.</li><li><code>cluster_id</code> - (Optional, String) The ID of the cluster where you want to provision the resources of all IBM Cloud catalog templates that are included in the catalog offering.</li><li><code>cluster_name</code> - (Optional, String) The cluster name.</li><li><code>cluster_type</code> - (Optional, String) The cluster type.</li><li><code>entitlement_keys</code> - (Optional, List) The entitlement key that you want to use to install IBM Cloud entitled software.</li><li><code>namespace</code> - (Optional, String) The Kubernetes namespace or OpenShift project where the resources of all IBM Cloud catalog templates that are included in the catalog offering are deployed into.</li><li><code>region</code> - (Optional, String) The IBM Cloud region that you want to use for the resources of all IBM Cloud catalog templates that are included in the catalog offering.</li><li><code>resource_group_id</code> - (Optional, String) The ID of the resource group that you want to use for the resources of all IBM Cloud catalog templates that are included in the catalog offering.</li><li><code>worker_count</code> - (Optional, Integer) The cluster worker count.</li><li><code>worker_machine_type</code> - (Optional, String) The cluster worker type.</li></ul></li><li><code>tags</code> - (Optional, List) A list of tags that are associated with the workspace.</li><li><code>template_env_settings</code> - (Optional, List) A list of environment variables that you want to apply during the execution of a bash script or Terraform job. This field must be provided as a list of key-value pairs, for example, <strong>TF_LOG=debug</strong>. Each entry will be a map with one entry where <code>key is the environment variable name and value is value</code>. You can define environment variables for IBM Cloud catalog offerings that are provisioned by using a bash script. See <a href=\"https://cloud.ibm.com/docs/schematics?topic=schematics-set-parallelism#parallelism-example\">example to use special environment variable</a>  that are supported by Schematics.</li><li><code>template_git_folder</code> - (Optional, String) The subfolder in your GitHub or GitLab repository where your Terraform template is stored.</li><li><code>template_init_state_file</code> - (Optional, String) The content of an existing Terraform statefile that you want to import in to your workspace. To get the content of a Terraform statefile for a specific Terraform template in an existing workspace, run <code>ibmcloud schematics state pull --id &lt;workspace_id&gt; --template &lt;template_id&gt;</code>.</li><li><code>template_type</code> - (Required, String) The Terraform version that you want to use to run your Terraform code. Enter <code>terraform_v0.12</code> to use Terraform version 0.12, and <code>terraform_v0.11</code> to use Terraform version 0.11. The Terraform config files are run with Terraform version 0.11. This is a required variable. Make sure that your Terraform config files are compatible with the Terraform version that you select. See <a href=\"https://cloud.ibm.com/docs/schematics?topic=schematics-migrating-terraform-version\">terraform versions</a> that are supported by Schematics.</li><li><code>template_uninstall_script_name</code> - (Optional, String) Uninstall script name.</li><li><code>template_values</code> - (Optional, String) A list of variable values that you want to apply during the Helm chart installation. The list must be provided in JSON format, such as <code>\"autoscaling: enabled: true minReplicas: 2\"</code>. The values that you define here override the default Helm chart values. This field is supported only for IBM Cloud catalog offerings that are provisioned by using the Terraform Helm provider.</li><li><code>template_values_metadata</code> - (Optional, List) List of values metadata.<br />Nested scheme for <strong>template_values_metadata</strong>:<ul><li><code>aliases</code> - (Optional, List) The list of aliases for the variable name.</li><li><code>cloud_data_type</code> - (Optional, String) Cloud data type of the variable. eg. resource_group_id, region, vpc_id.</li><li><code>default_value</code> - (Optional, String) Default value for the variable only if the override value is not specified.</li><li><code>description</code> - (Optional, String) The description of the meta data.</li><li><code>group_by</code> - (Optional, String) The display name of the group this variable belongs to.</li><li><code>hidden</code> - (Optional, Boolean) If <strong>true</strong>, the variable is not displayed on UI or Command line.</li><li><code>immutable</code> - (Optional, Boolean) Is the variable readonly ?.</li><li><code>link_status</code> - (Optional, String) The status of the link.<ul><li>Constraints: Allowable values are: <code>normal</code>, <code>broken</code>.</li></ul></li><li><code>matches</code> - (Optional, String) The regex for the variable value.</li><li><code>max_length</code> - (Optional, Integer) The maximum length of the variable value. Applicable for the string type.</li><li><code>max_value</code> - (Optional, Integer) The maximum value of the variable. Applicable for the integer type.</li><li><code>min_length</code> - (Optional, Integer) The minimum length of the variable value. Applicable for the string type.</li><li><code>min_value</code> - (Optional, Integer) The minimum value of the variable. Applicable for the integer type.</li><li><code>options</code> - (Optional, List) The list of possible values for this variable.  If type is <strong>integer</strong> or <strong>date</strong>, then the array of string is  converted to array of integers or date during the runtime.</li><li><code>position</code> - (Optional, Integer) The relative position of this variable in a list.</li><li><code>required</code> - (Optional, Boolean) If the variable required?.</li><li><code>secure</code> - (Optional, Boolean) Is the variable secure or sensitive ?.</li><li><code>source</code> - (Optional, String) The source of this meta-data.</li><li><code>type</code> - (Optional, String) Type of the variable.<ul><li>Constraints: Allowable values are: <code>boolean</code>, <code>string</code>, <code>integer</code>, <code>date</code>, <code>array</code>, <code>list</code>, <code>map</code>, <code>complex</code>, <code>link</code>.</li></ul></li></ul></li><li><code>template_inputs</code> - (Optional, List) VariablesRequest -.<br />Nested scheme for <strong>variablestore</strong>:<ul><li><code>description</code> - (Optional, String) The description of your input variable.</li><li><code>name</code> - (Required, String) The name of the variable.</li><li><code>secure</code> - (Optional, Boolean) If set to <code>true</code>, the value of your input variable is protected and not returned in your API response.</li><li><code>type</code> - (Required, String) <code>Terraform v0.11</code> supports <code>string</code>, <code>list</code>, <code>map</code> data type. For more information, about the syntax, see <a href=\"https://www.terraform.io/docs/configuration-0-11/variables.html\">Configuring input variables</a>.<br> <code>Terraform v0.12</code> additionally, supports <code>bool</code>, <code>number</code> and complex data types such as <code>list(type)</code>, <code>map(type)</code>,<code>object({attribute name=type,..})</code>, <code>set(type)</code>, <code>tuple([type])</code>. For more information, about the syntax to use the complex data type, see <a href=\"https://www.terraform.io/docs/configuration/variables.html#type-constraints\">Configuring variables</a>.</li><li><code>use_default</code> - (Optional, Boolean) Variable uses default value; and is not over-ridden.</li><li><code>value</code> - (Required, String) Enter the value as a string for the primitive types such as <code>bool</code>, <code>number</code>, <code>string</code>, and <code>HCL</code> format for the complex variables, as you provide in a <code>.tfvars</code> file. <strong>You need to enter escaped string of <code>HCL</code> format for the complex variable value</strong>. For more information, about how to declare variables in a terraform configuration file and provide value to schematics, see <a href=\"https://cloud.ibm.com/docs/schematics?topic=schematics-create-tf-config#declare-variable\">Providing values for the declared variables</a>.</li></ul></li><li><code>template_ref</code> - (Optional, String) Workspace template ref.</li><li><code>template_git_branch</code> - (Optional, String) The repository branch.</li><li><code>template_git_release</code> - (Optional, String) The repository release.</li><li><code>template_git_repo_sha_value</code> - (Optional, String) The repository SHA value.</li><li><code>template_git_repo_url</code> - (Optional, String) The repository URL.</li><li><code>template_git_url</code> - (Optional, String) The source URL.</li><li><code>frozen</code> - (Optional, Boolean) If set to true, the workspace is frozen and changes to the workspace are disabled.</li><li><code>frozen_at</code> - (Optional, String) The timestamp when the workspace was frozen.</li><li><code>frozen_by</code> - (Optional, String) The user ID that froze the workspace.</li><li><code>locked</code> - (Optional, Boolean) If set to true, the workspace is locked and disabled for changes.</li><li><code>locked_by</code> - (Optional, String) The user ID that initiated a resource-related job, such as applying or destroying resources, that locked the workspace.</li><li><code>locked_time</code> - (Optional, String) The timestamp when the workspace was locked.</li><li><code>x_github_token</code> - (Optional, String) The personal access token to authenticate with your private GitHub or GitLab repository and access your Terraform template.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument references listed, you can access the following attribute references after your resource is created.</p><ul><li><code>id</code> - The unique identifier of the schematics_workspace.</li><li><code>created_at</code> - (String) The timestamp when the workspace was created.</li><li><code>created_by</code> - (String) The user ID that created the workspace.</li><li><code>crn</code> - (Optional, String) The workspace CRN.</li><li><code>last_health_check_at</code> - (String) The timestamp when the last health check was performed by Schematics.</li><li><code>runtime_data</code> - (Optional, List) Information about the provisioning engine, state file, and runtime logs.<br />Nested scheme for <strong>runtime_data</strong>:<ul><li><code>engine_cmd</code> - (Optional, String) The command that was used to apply the Terraform template or IBM Cloud catalog software template.</li><li><code>engine_name</code> - (Optional, String) The provisioning engine that was used to apply the Terraform template or IBM Cloud catalog software template.</li><li><code>engine_version</code> - (Optional, String) The version of the provisioning engine that was used.</li><li><code>id</code> - (Optional, String) The ID that was assigned to your Terraform template or IBM Cloud catalog software template.</li><li><code>log_store_url</code> - (Optional, String) The URL to access the logs that were created during the creation, update, or deletion of your IBM Cloud resources.</li><li><code>output_values</code> - (Optional, List) List of Output values.</li><li><code>resources</code> - (Optional, List) List of resources.</li><li><code>state_store_url</code> - (Optional, String) The URL where the Terraform statefile (<code>terraform.tfstate</code>) is stored. You can use the statefile to find an overview of IBM Cloud resources that were created by Schematics. Schematics uses the statefile as an inventory list to determine future create, update, or deletion jobs.</li></ul></li><li><code>status</code> - (String) The status of the workspace.   <strong>Active</strong>: After you successfully ran your infrastructure code by applying your Terraform execution plan, the state of your workspace changes to <code>Active</code>.   <strong>Connecting</strong>: Schematics tries to connect to the template in your source repo. If successfully connected, the template is downloaded and metadata, such as input parameters, is extracted. After the template is downloaded, the state of the workspace changes to <code>Scanning</code>.   <strong>Draft</strong>: The workspace is created without a reference to a GitHub or GitLab repository.   <strong>Failed</strong>: If errors occur during the execution of your infrastructure code in IBM Cloud Schematics, your workspace status is set to <code>Failed</code>.   <strong>Inactive</strong>: The Terraform template was scanned successfully and the workspace creation is complete. You can now start running Schematics plan and apply jobs to provision the IBM Cloud resources that you specified in your template. If you have an <code>Active</code> workspace and decide to remove all your resources, your workspace is set to <code>Inactive</code> after all your resources are removed.   <strong>In progress</strong>: When you instruct IBM Cloud Schematics to run your infrastructure code by applying your Terraform execution plan, the status of our workspace changes to <code>In progress</code>.   <strong>Scanning</strong>: The download of the Terraform template is complete and vulnerability scanning started. If the scan is successful, the workspace state changes to <code>Inactive</code>. If errors in your template are found, the state changes to <code>Template Error</code>.   <strong>Stopped</strong>: The Schematics plan, apply, or destroy job was cancelled manually.   <strong>Template Error</strong>: The Schematics template contains errors and cannot be processed.</li><li><code>updated_at</code> - (String) The timestamp when the workspace was last updated.</li><li><code>updated_by</code> - (String) The user ID that updated the workspace.</li><li><code>status_code</code> - (String) The success or error code that was returned for the last plan, apply, or destroy job that ran against your workspace.</li><li><code>status_msg</code> - (String) The success or error message that was returned for the last plan, apply, or destroy job that ran against your workspace.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>You can import the <code>ibm_schematics_workspace</code> resource by using <code>id</code>. The unique identifier of the workspace.</p>", "syntax": "<h1 id=\"syntax\">Syntax</h1><p><code>$ terraform import ibm_schematics_workspace.schematics_workspace &lt;id&gt;</code><br /><strong>Note</strong></p><p>This resource can perform create, read, update and delete operations of schematics workspace. Other schematics operations such as <code>Plan</code> and <code>Apply</code> which are available in IBM Cloud Schematics console are currently not supported.</p>", "description": "<h1 id=\"ibm_schematics_workspace\">ibm_schematics_workspace</h1><p>Create, read, update, and delete operations of Schematics workspace. Other Schematics operations such as plan, apply, destroy that are available through Schematics console are currently not supported. For more information, about IBM Cloud Schematics workspace, refer to <a href=\"https://cloud.ibm.com/docs/schematics?topic=schematics-workspace-setup\">setting up workspaces</a>.</p>"}