{"ibm-space": "<h1 id=\"ibm_space\">ibm_space</h1><p>Create, update, or delete a Cloud Foundry space. For more information, about Cloud Foundry space, see <a href=\"https://cloud.ibm.com/docs/cloud-foundry?topic=cloud-foundry-getting-started\">getting started with IBM Cloud Foundry Enterprise Environment</a>.</p>", "example-usage": "<h2 id=\"example-usage\">Example usage</h2><p>The following example creates the <code>myspace</code> Cloud Foundry space. </p><br /><p>terraform<br />resource \"ibm_space\" \"space\" {<br />  name        = \"myspace\"<br />  org         = \"myorg\"<br />  space_quota = \"myspacequota\"<br />  managers    = [\"manager@example.com\"]<br />  auditors    = [\"auditor@example.com\"]<br />  developers  = [\"developer@example.com\"]<br />}</p><br />", "argument-reference": "<h2 id=\"argument-reference\">Argument reference</h2><p>Review the argument reference that you can specify for your resource. </p><ul><li><code>auditors</code>(Optional, Sets)  The email addresses (associated with IBM IDs) of the users to whom you want to give an auditor role in this space. Users with the auditor role can view logs, reports, and settings in the given space.</li><li><code>developers</code>(Optional, Sets) The email addresses (associated with IBM IDs) of the users to whom you want to give a developer role in this space. Users with the developer role can create apps and services, manage apps and services, and see logs and reports in the given space.</li><li><code>managers</code>(Optional, Sets) The email addresses (associated with IBM IDs) of the users to whom you want to give a manager role in this space. Users with the manager role can invite users, manage users, and enable features for the given space.</li><li><code>name</code> - (Required, String) The descriptive name for the space.</li><li><code>org</code> - (Required, String) The name of the Cloud Foundry organization to which this space belongs.</li><li><code>space_quota</code> - (Optional, String) The name of the space quota definition that is associated with the space.</li><li><code>tags</code> (Optional, Array of Strings) The tags that you want to add to the space. Tags can help you find the space more easily later. <strong>Note</strong> Currently, <code>Tags</code> that are managed locally and not sored on the IBM Cloud service endpoint.</li></ul><p><strong>Note</strong><br /> By default, the newly created space has no user associated with it. Add your own email address to the <code>managers</code> or <code>developers</code> field in order to be able to use the space correctly for the first time.</p>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute reference</h2><p>In addition to all argument references list, you can access the following attribute references after your resource is created. </p><ul><li><code>id</code> - (String) The unique identifier of the new space.</li></ul>", "description": "<h1 id=\"ibm_space\">ibm_space</h1><p>Create, update, or delete a Cloud Foundry space. For more information, about Cloud Foundry space, see <a href=\"https://cloud.ibm.com/docs/cloud-foundry?topic=cloud-foundry-getting-started\">getting started with IBM Cloud Foundry Enterprise Environment</a>.</p>"}