{"resource-aws-db-proxy": "<h1 id=\"resource-aws_db_proxy\">Resource: aws_db_proxy</h1><p>Provides an RDS DB proxy resource. For additional information, see the <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/rds-proxy.html\">RDS User Guide</a>.</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p>terraform<br />resource \"aws_db_proxy\" \"example\" {<br />  name                   = \"example\"<br />  debug_logging          = false<br />  engine_family          = \"MYSQL\"<br />  idle_client_timeout    = 1800<br />  require_tls            = true<br />  role_arn               = aws_iam_role.example.arn<br />  vpc_security_group_ids = [aws_security_group.example.id]<br />  vpc_subnet_ids         = [aws_subnet.example.id]</p><br /><p>auth {<br />    auth_scheme = \"SECRETS\"<br />    description = \"example\"<br />    iam_auth    = \"DISABLED\"<br />    secret_arn  = aws_secretsmanager_secret.example.arn<br />  }</p><br /><p>tags = {<br />    Name = \"example\"<br />    Key  = \"value\"<br />  }<br />}</p><br />", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>This resource supports the following arguments:</p><ul><li><code>name</code> - (Required) The identifier for the proxy. This name must be unique for all proxies owned by your AWS account in the specified AWS Region. An identifier must begin with a letter and must contain only ASCII letters, digits, and hyphens; it can't end with a hyphen or contain two consecutive hyphens.</li><li><code>auth</code> - (Required) Configuration block(s) with authorization mechanisms to connect to the associated instances or clusters. Described below.</li><li><code>debug_logging</code> - (Optional) Whether the proxy includes detailed information about SQL statements in its logs. This information helps you to debug issues involving SQL behavior or the performance and scalability of the proxy connections. The debug information includes the text of SQL statements that you submit through the proxy. Thus, only enable this setting when needed for debugging, and only when you have security measures in place to safeguard any sensitive information that appears in the logs.</li><li><code>engine_family</code> - (Required, Forces new resource) The kinds of databases that the proxy can connect to. This value determines which database network protocol the proxy recognizes when it interprets network traffic to and from the database. For Aurora MySQL, RDS for MariaDB, and RDS for MySQL databases, specify <code>MYSQL</code>. For Aurora PostgreSQL and RDS for PostgreSQL databases, specify <code>POSTGRESQL</code>. For RDS for Microsoft SQL Server, specify <code>SQLSERVER</code>. Valid values are <code>MYSQL</code>, <code>POSTGRESQL</code>, and <code>SQLSERVER</code>.</li><li><code>idle_client_timeout</code> - (Optional) The number of seconds that a connection to the proxy can be inactive before the proxy disconnects it. You can set this value higher or lower than the connection timeout limit for the associated database.</li><li><code>require_tls</code> - (Optional) A Boolean parameter that specifies whether Transport Layer Security (TLS) encryption is required for connections to the proxy. By enabling this setting, you can enforce encrypted TLS connections to the proxy.</li><li><code>role_arn</code> - (Required) The Amazon Resource Name (ARN) of the IAM role that the proxy uses to access secrets in AWS Secrets Manager.</li><li><code>vpc_security_group_ids</code> - (Optional) One or more VPC security group IDs to associate with the new proxy.</li><li><code>vpc_subnet_ids</code> - (Required) One or more VPC subnet IDs to associate with the new proxy.</li><li><code>tags</code> - (Optional) A mapping of tags to assign to the resource. If configured with a provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a> present, tags with matching keys will overwrite those defined at the provider-level.</li></ul><p><code>auth</code> blocks support the following:</p><ul><li><code>auth_scheme</code> - (Optional) The type of authentication that the proxy uses for connections from the proxy to the underlying database. One of <code>SECRETS</code>.</li><li><code>client_password_auth_type</code> - (Optional) The type of authentication the proxy uses for connections from clients. Valid values are <code>MYSQL_NATIVE_PASSWORD</code>, <code>POSTGRES_SCRAM_SHA_256</code>, <code>POSTGRES_MD5</code>, and <code>SQL_SERVER_AUTHENTICATION</code>.</li><li><code>description</code> - (Optional) A user-specified description about the authentication used by a proxy to log in as a specific database user.</li><li><code>iam_auth</code> - (Optional) Whether to require or disallow AWS Identity and Access Management (IAM) authentication for connections to the proxy. One of <code>DISABLED</code>, <code>REQUIRED</code>.</li><li><code>secret_arn</code> - (Optional) The Amazon Resource Name (ARN) representing the secret that the proxy uses to authenticate to the RDS DB instance or Aurora DB cluster. These secrets are stored within Amazon Secrets Manager.</li><li><code>username</code> - (Optional) The name of the database user to which the proxy connects.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute Reference</h2><p>This resource exports the following attributes in addition to the arguments above:</p><ul><li><code>id</code> - The Amazon Resource Name (ARN) for the proxy.</li><li><code>arn</code> - The Amazon Resource Name (ARN) for the proxy.</li><li><code>endpoint</code> - The endpoint that you can use to connect to the proxy. You include the endpoint value in the connection string for a database client application.</li><li><code>tags_all</code> - A map of tags assigned to the resource, including those inherited from the provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a>.</li></ul>", "timeouts": "<h2 id=\"timeouts\">Timeouts</h2><p><a href=\"https://developer.hashicorp.com/terraform/language/resources/syntax#operation-timeouts\">Configuration options</a>:</p><ul><li><code>create</code> - (Default <code>30m</code>)</li><li><code>update</code> - (Default <code>30m</code>)</li><li><code>delete</code> - (Default <code>60m</code>)</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>In Terraform v1.5.0 and later, use an <a href=\"https://developer.hashicorp.com/terraform/language/import\"><code>import</code> block</a> to import DB proxies using the <code>name</code>. For example:</p><p>terraform<br />import {<br />  to = aws_db_proxy.example<br />  id = \"example\"<br />}</p><p>Using <code>terraform import</code>, import DB proxies using the <code>name</code>. For example:</p><p>console<br />% terraform import aws_db_proxy.example example</p>", "description": "<h1 id=\"resource-aws_db_proxy\">Resource: aws_db_proxy</h1><p>Provides an RDS DB proxy resource. For additional information, see the <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/rds-proxy.html\">RDS User Guide</a>.</p>"}