{"resource-aws-dms-endpoint": "<h1 id=\"resource-aws_dms_endpoint\">Resource: aws_dms_endpoint</h1><p>Provides a DMS (Data Migration Service) endpoint resource. DMS endpoints can be created, updated, deleted, and imported.</p><p>~&gt; <strong>Note:</strong> All arguments including the password will be stored in the raw state as plain-text. <a href=\"https://www.terraform.io/docs/state/sensitive-data.html\">Read more about sensitive data in state</a>.</p><p>~&gt; <strong>Note:</strong> The <code>s3_settings</code> argument is deprecated, may not be maintained, and will be removed in a future version. Use the <a href=\"/docs/providers/aws/r/dms_s3_endpoint.html\"><code>aws_dms_s3_endpoint</code></a> resource instead.</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p>terraform</p><br />", "create-a-new-endpoint": "<h1 id=\"create-a-new-endpoint\">Create a new endpoint</h1><p>resource \"aws_dms_endpoint\" \"test\" {<br />  certificate_arn             = \"arn:aws:acm:us-east-1:123456789012:certificate/12345678-1234-1234-1234-123456789012\"<br />  database_name               = \"test\"<br />  endpoint_id                 = \"test-dms-endpoint-tf\"<br />  endpoint_type               = \"source\"<br />  engine_name                 = \"aurora\"<br />  extra_connection_attributes = \"\"<br />  kms_key_arn                 = \"arn:aws:kms:us-east-1:123456789012:key/12345678-1234-1234-1234-123456789012\"<br />  password                    = \"test\"<br />  port                        = 3306<br />  server_name                 = \"test\"<br />  ssl_mode                    = \"none\"</p><p>tags = {<br />    Name = \"test\"<br />  }</p><p>username = \"test\"<br />}</p>", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>The following arguments are required:</p><ul><li><code>endpoint_id</code> - (Required) Database endpoint identifier. Identifiers must contain from 1 to 255 alphanumeric characters or hyphens, begin with a letter, contain only ASCII letters, digits, and hyphens, not end with a hyphen, and not contain two consecutive hyphens.</li><li><code>endpoint_type</code> - (Required) Type of endpoint. Valid values are <code>source</code>, <code>target</code>.</li><li><code>engine_name</code> - (Required) Type of engine for the endpoint. Valid values are <code>aurora</code>, <code>aurora-postgresql</code>, <code>azuredb</code>, <code>azure-sql-managed-instance</code>, <code>babelfish</code>, <code>db2</code>, <code>db2-zos</code>, <code>docdb</code>, <code>dynamodb</code>, <code>elasticsearch</code>, <code>kafka</code>, <code>kinesis</code>, <code>mariadb</code>, <code>mongodb</code>, <code>mysql</code>, <code>opensearch</code>, <code>oracle</code>, <code>postgres</code>, <code>redshift</code>, <code>s3</code>, <code>sqlserver</code>, <code>sybase</code>. Please note that some of engine names are available only for <code>target</code> endpoint type (e.g. <code>redshift</code>).</li><li><code>kms_key_arn</code> - (Required when <code>engine_name</code> is <code>mongodb</code>, cannot be set when <code>engine_name</code> is <code>s3</code>, optional otherwise) ARN for the KMS key that will be used to encrypt the connection parameters. If you do not specify a value for <code>kms_key_arn</code>, then AWS DMS will use your default encryption key. AWS KMS creates the default encryption key for your AWS account. Your AWS account has a different default encryption key for each AWS region. To encrypt an S3 target with a KMS Key, use the parameter <code>s3_settings.server_side_encryption_kms_key_id</code>. When <code>engine_name</code> is <code>redshift</code>, <code>kms_key_arn</code> is the KMS Key for the Redshift target and the parameter <code>redshift_settings.server_side_encryption_kms_key_id</code> encrypts the S3 intermediate storage.</li></ul><p>The following arguments are optional:</p><ul><li><code>certificate_arn</code> - (Optional, Default: empty string) ARN for the certificate.</li><li><code>database_name</code> - (Optional) Name of the endpoint database.</li><li><code>elasticsearch_settings</code> - (Optional) Configuration block for OpenSearch settings. See below.</li><li><code>extra_connection_attributes</code> - (Optional) Additional attributes associated with the connection. For available attributes for a <code>source</code> Endpoint, see <a href=\"https://docs.aws.amazon.com/dms/latest/userguide/CHAP_Source.html\">Sources for data migration</a>. For available attributes for a <code>target</code> Endpoint, see <a href=\"https://docs.aws.amazon.com/dms/latest/userguide/CHAP_Target.html\">Targets for data migration</a>.</li><li><code>kafka_settings</code> - (Optional) Configuration block for Kafka settings. See below.</li><li><code>kinesis_settings</code> - (Optional) Configuration block for Kinesis settings. See below.</li><li><code>mongodb_settings</code> - (Optional) Configuration block for MongoDB settings. See below.</li><li><code>password</code> - (Optional) Password to be used to login to the endpoint database.</li><li><code>port</code> - (Optional) Port used by the endpoint database.</li><li><code>redshift_settings</code> - (Optional) Configuration block for Redshift settings. See below.</li><li><code>s3_settings</code> - (Optional) (<strong>Deprecated</strong>, use the <a href=\"/docs/providers/aws/r/dms_s3_endpoint.html\"><code>aws_dms_s3_endpoint</code></a> resource instead) Configuration block for S3 settings. See below.</li><li><code>secrets_manager_access_role_arn</code> - (Optional) ARN of the IAM role that specifies AWS DMS as the trusted entity and has the required permissions to access the value in SecretsManagerSecret.</li><li><code>secrets_manager_arn</code> - (Optional) Full ARN, partial ARN, or friendly name of the SecretsManagerSecret that contains the endpoint connection details. Supported only when <code>engine_name</code> is <code>aurora</code>, <code>aurora-postgresql</code>, <code>mariadb</code>, <code>mongodb</code>, <code>mysql</code>, <code>oracle</code>, <code>postgres</code>, <code>redshift</code>, or <code>sqlserver</code>.</li><li><code>server_name</code> - (Optional) Host name of the server.</li><li><code>service_access_role</code> - (Optional) ARN used by the service access IAM role for dynamodb endpoints.</li><li><code>ssl_mode</code> - (Optional, Default: <code>none</code>) SSL mode to use for the connection. Valid values are <code>none</code>, <code>require</code>, <code>verify-ca</code>, <code>verify-full</code></li><li><code>tags</code> - (Optional) Map of tags to assign to the resource. If configured with a provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a> present, tags with matching keys will overwrite those defined at the provider-level.</li><li><code>username</code> - (Optional) User name to be used to login to the endpoint database.</li></ul><h3 id=\"elasticsearch_settings\">elasticsearch_settings</h3><p>-&gt; Additional information can be found in the <a href=\"https://docs.aws.amazon.com/dms/latest/userguide/CHAP_Target.Elasticsearch.html\">Using Amazon OpenSearch Service as a Target for AWS Database Migration Service documentation</a>.</p><ul><li><code>endpoint_uri</code> - (Required) Endpoint for the OpenSearch cluster.</li><li><code>error_retry_duration</code> - (Optional) Maximum number of seconds for which DMS retries failed API requests to the OpenSearch cluster. Default is <code>300</code>.</li><li><code>full_load_error_percentage</code> - (Optional) Maximum percentage of records that can fail to be written before a full load operation stops. Default is <code>10</code>.</li><li><code>service_access_role_arn</code> - (Required) ARN of the IAM Role with permissions to write to the OpenSearch cluster.</li></ul><h3 id=\"kafka_settings\">kafka_settings</h3><p>-&gt; Additional information can be found in the <a href=\"https://docs.aws.amazon.com/dms/latest/userguide/CHAP_Target.Kafka.html\">Using Apache Kafka as a Target for AWS Database Migration Service documentation</a>.</p><ul><li><code>broker</code> - (Required) Kafka broker location. Specify in the form broker-hostname-or-ip:port.</li><li><code>include_control_details</code> - (Optional) Shows detailed control information for table definition, column definition, and table and column changes in the Kafka message output. Default is <code>false</code>.</li><li><code>include_null_and_empty</code> - (Optional) Include NULL and empty columns for records migrated to the endpoint. Default is <code>false</code>.</li><li><code>include_partition_value</code> - (Optional) Shows the partition value within the Kafka message output unless the partition type is <code>schema-table-type</code>. Default is <code>false</code>.</li><li><code>include_table_alter_operations</code> - (Optional) Includes any data definition language (DDL) operations that change the table in the control data, such as <code>rename-table</code>, <code>drop-table</code>, <code>add-column</code>, <code>drop-column</code>, and <code>rename-column</code>. Default is <code>false</code>.</li><li><code>include_transaction_details</code> - (Optional) Provides detailed transaction information from the source database. This information includes a commit timestamp, a log position, and values for <code>transaction_id</code>, previous <code>transaction_id</code>, and <code>transaction_record_id</code> (the record offset within a transaction). Default is <code>false</code>.</li><li><code>message_format</code> - (Optional) Output format for the records created on the endpoint. Message format is <code>JSON</code> (default) or <code>JSON_UNFORMATTED</code> (a single line with no tab).</li><li><code>message_max_bytes</code> - (Optional) Maximum size in bytes for records created on the endpoint Default is <code>1,000,000</code>.</li><li><code>no_hex_prefix</code> - (Optional) Set this optional parameter to true to avoid adding a '0x' prefix to raw data in hexadecimal format. For example, by default, AWS DMS adds a '0x' prefix to the LOB column type in hexadecimal format moving from an Oracle source to a Kafka target. Use the <code>no_hex_prefix</code> endpoint setting to enable migration of RAW data type columns without adding the <code>'0x'</code> prefix.</li><li><code>partition_include_schema_table</code> - (Optional) Prefixes schema and table names to partition values, when the partition type is <code>primary-key-type</code>. Doing this increases data distribution among Kafka partitions. For example, suppose that a SysBench schema has thousands of tables and each table has only limited range for a primary key. In this case, the same primary key is sent from thousands of tables to the same partition, which causes throttling. Default is <code>false</code>.</li><li><code>sasl_password</code> - (Optional) Secure password you created when you first set up your MSK cluster to validate a client identity and make an encrypted connection between server and client using SASL-SSL authentication.</li><li><code>sasl_username</code> - (Optional) Secure user name you created when you first set up your MSK cluster to validate a client identity and make an encrypted connection between server and client using SASL-SSL authentication.</li><li><code>security_protocol</code> - (Optional) Set secure connection to a Kafka target endpoint using Transport Layer Security (TLS). Options include <code>ssl-encryption</code>, <code>ssl-authentication</code>, and <code>sasl-ssl</code>. <code>sasl-ssl</code> requires <code>sasl_username</code> and <code>sasl_password</code>.</li><li><code>ssl_ca_certificate_arn</code> - (Optional) ARN for the private certificate authority (CA) cert that AWS DMS uses to securely connect to your Kafka target endpoint.</li><li><code>ssl_client_certificate_arn</code> - (Optional) ARN of the client certificate used to securely connect to a Kafka target endpoint.</li><li><code>ssl_client_key_arn</code> - (Optional) ARN for the client private key used to securely connect to a Kafka target endpoint.</li><li><code>ssl_client_key_password</code> - (Optional) Password for the client private key used to securely connect to a Kafka target endpoint.</li><li><code>topic</code> - (Optional) Kafka topic for migration. Default is <code>kafka-default-topic</code>.</li></ul><h3 id=\"kinesis_settings\">kinesis_settings</h3><p>-&gt; Additional information can be found in the <a href=\"https://docs.aws.amazon.com/dms/latest/userguide/CHAP_Target.Kinesis.html\">Using Amazon Kinesis Data Streams as a Target for AWS Database Migration Service documentation</a>.</p><ul><li><code>include_control_details</code> - (Optional) Shows detailed control information for table definition, column definition, and table and column changes in the Kinesis message output. Default is <code>false</code>.</li><li><code>include_null_and_empty</code> - (Optional) Include NULL and empty columns in the target. Default is <code>false</code>.</li><li><code>include_partition_value</code> - (Optional) Shows the partition value within the Kinesis message output, unless the partition type is schema-table-type. Default is <code>false</code>.</li><li><code>include_table_alter_operations</code> - (Optional) Includes any data definition language (DDL) operations that change the table in the control data. Default is <code>false</code>.</li><li><code>include_transaction_details</code> - (Optional) Provides detailed transaction information from the source database. Default is <code>false</code>.</li><li><code>message_format</code> - (Optional) Output format for the records created. Default is <code>json</code>. Valid values are <code>json</code> and <code>json-unformatted</code> (a single line with no tab).</li><li><code>partition_include_schema_table</code> - (Optional) Prefixes schema and table names to partition values, when the partition type is primary-key-type. Default is <code>false</code>.</li><li><code>service_access_role_arn</code> - (Optional) ARN of the IAM Role with permissions to write to the Kinesis data stream.</li><li><code>stream_arn</code> - (Optional) ARN of the Kinesis data stream.</li></ul><h3 id=\"mongodb_settings\">mongodb_settings</h3><p>-&gt; Additional information can be found in the <a href=\"https://docs.aws.amazon.com/dms/latest/userguide/CHAP_Source.MongoDB.html\">Using MongoDB as a Source for AWS DMS documentation</a>.</p><ul><li><code>auth_mechanism</code> - (Optional) Authentication mechanism to access the MongoDB source endpoint. Default is <code>default</code>.</li><li><code>auth_source</code> - (Optional) Authentication database name. Not used when <code>auth_type</code> is <code>no</code>. Default is <code>admin</code>.</li><li><code>auth_type</code> - (Optional) Authentication type to access the MongoDB source endpoint. Default is <code>password</code>.</li><li><code>docs_to_investigate</code> - (Optional) Number of documents to preview to determine the document organization. Use this setting when <code>nesting_level</code> is set to <code>one</code>. Default is <code>1000</code>.</li><li><code>extract_doc_id</code> - (Optional) Document ID. Use this setting when <code>nesting_level</code> is set to <code>none</code>. Default is <code>false</code>.</li><li><code>nesting_level</code> - (Optional) Specifies either document or table mode. Default is <code>none</code>. Valid values are <code>one</code> (table mode) and <code>none</code> (document mode).</li></ul><h3 id=\"redis_settings\">redis_settings</h3><p>-&gt; Additional information can be found in the <a href=\"https://docs.aws.amazon.com/dms/latest/userguide/CHAP_Target.Redis.html\">Using Redis as a target for AWS Database Migration Service</a>.</p><ul><li><code>auth_password</code> - (Optional) The password provided with the auth-role and auth-token options of the AuthType setting for a Redis target endpoint.</li><li><code>auth_type</code> - (Required) The type of authentication to perform when connecting to a Redis target. Options include <code>none</code>, <code>auth-token</code>, and <code>auth-role</code>. The <code>auth-token</code> option requires an <code>auth_password</code> value to be provided. The <code>auth-role</code> option requires <code>auth_user_name</code> and <code>auth_password</code> values to be provided.</li><li><code>auth_user_name</code> - (Optional) The username provided with the <code>auth-role</code> option of the AuthType setting for a Redis target endpoint.</li><li><code>server_name</code> - (Required) Fully qualified domain name of the endpoint.</li><li><code>port</code> - (Required) Transmission Control Protocol (TCP) port for the endpoint.</li><li><code>ssl_ca_certificate_arn</code> - (Optional) The Amazon Resource Name (ARN) for the certificate authority (CA) that DMS uses to connect to your Redis target endpoint.</li><li><code>ssl_security_protocol</code>- (Optional) The plaintext option doesn't provide Transport Layer Security (TLS) encryption for traffic between endpoint and database. Options include <code>plaintext</code>, <code>ssl-encryption</code>. The default is <code>ssl-encryption</code>.</li></ul><h3 id=\"redshift_settings\">redshift_settings</h3><p>-&gt; Additional information can be found in the <a href=\"https://docs.aws.amazon.com/dms/latest/userguide/CHAP_Target.Redshift.html\">Using Amazon Redshift as a Target for AWS Database Migration Service documentation</a>.</p><ul><li><code>bucket_folder</code> - (Optional) Custom S3 Bucket Object prefix for intermediate storage.</li><li><code>bucket_name</code> - (Optional) Custom S3 Bucket name for intermediate storage.</li><li><code>encryption_mode</code> - (Optional) The server-side encryption mode that you want to encrypt your intermediate .csv object files copied to S3. Defaults to <code>SSE_S3</code>. Valid values are <code>SSE_S3</code> and <code>SSE_KMS</code>.</li><li><code>server_side_encryption_kms_key_id</code> - (Required when <code>encryption_mode</code> is  <code>SSE_KMS</code>, must not be set otherwise) ARN or Id of KMS Key to use when <code>encryption_mode</code> is <code>SSE_KMS</code>.</li><li><code>service_access_role_arn</code> - (Optional) Amazon Resource Name (ARN) of the IAM Role with permissions to read from or write to the S3 Bucket for intermediate storage.</li></ul><h3 id=\"s3_settings\">s3_settings</h3><p>~&gt; <strong>Deprecated:</strong> This argument is deprecated, may not be maintained, and will be removed in a future version. Use the <a href=\"/docs/providers/aws/r/dms_s3_endpoint.html\"><code>aws_dms_s3_endpoint</code></a> resource instead.</p><p>-&gt; Additional information can be found in the <a href=\"https://docs.aws.amazon.com/dms/latest/userguide/CHAP_Source.S3.html\">Using Amazon S3 as a Source for AWS Database Migration Service documentation</a> and <a href=\"https://docs.aws.amazon.com/dms/latest/userguide/CHAP_Target.S3.html\">Using Amazon S3 as a Target for AWS Database Migration Service documentation</a>.</p><ul><li><code>add_column_name</code> - (Optional) Whether to add column name information to the .csv output file. Default is <code>false</code>.</li><li><code>bucket_folder</code> - (Optional) S3 object prefix.</li><li><code>bucket_name</code> - (Optional) S3 bucket name.</li><li><code>canned_acl_for_objects</code> - (Optional) Predefined (canned) access control list for objects created in an S3 bucket. Valid values include <code>none</code>, <code>private</code>, <code>public-read</code>, <code>public-read-write</code>, <code>authenticated-read</code>, <code>aws-exec-read</code>, <code>bucket-owner-read</code>, and <code>bucket-owner-full-control</code>. Default is <code>none</code>.</li><li><code>cdc_inserts_and_updates</code> - (Optional) Whether to write insert and update operations to .csv or .parquet output files. Default is <code>false</code>.</li><li><code>cdc_inserts_only</code> - (Optional) Whether to write insert operations to .csv or .parquet output files. Default is <code>false</code>.</li><li><code>cdc_max_batch_interval</code> - (Optional) Maximum length of the interval, defined in seconds, after which to output a file to Amazon S3. Default is <code>60</code>.</li><li><code>cdc_min_file_size</code> - (Optional) Minimum file size condition as defined in kilobytes to output a file to Amazon S3. Default is <code>32000</code>. <strong>NOTE:</strong> Previously, this setting was measured in megabytes but now represents kilobytes. Update configurations accordingly.</li><li><code>cdc_path</code> - (Optional) Folder path of CDC files. For an S3 source, this setting is required if a task captures change data; otherwise, it's optional. If <code>cdc_path</code> is set, AWS DMS reads CDC files from this path and replicates the data changes to the target endpoint. Supported in AWS DMS versions 3.4.2 and later.</li><li><code>compression_type</code> - (Optional) Set to compress target files. Default is <code>NONE</code>. Valid values are <code>GZIP</code> and <code>NONE</code>.</li><li><code>csv_delimiter</code> - (Optional) Delimiter used to separate columns in the source files. Default is <code>,</code>.</li><li><code>csv_no_sup_value</code> - (Optional) String to use for all columns not included in the supplemental log.</li><li><code>csv_null_value</code> - (Optional) String to as null when writing to the target.</li><li><code>csv_row_delimiter</code> - (Optional) Delimiter used to separate rows in the source files. Default is <code>\\n</code>.</li><li><code>data_format</code> - (Optional) Output format for the files that AWS DMS uses to create S3 objects. Valid values are <code>csv</code> and <code>parquet</code>. Default is <code>csv</code>.</li><li><code>data_page_size</code> - (Optional) Size of one data page in bytes. Default is <code>1048576</code> (1 MiB).</li><li><code>date_partition_delimiter</code> - (Optional) Date separating delimiter to use during folder partitioning. Valid values are <code>SLASH</code>, <code>UNDERSCORE</code>, <code>DASH</code>, and <code>NONE</code>. Default is <code>SLASH</code>.</li><li><code>date_partition_enabled</code> - (Optional) Partition S3 bucket folders based on transaction commit dates. Default is <code>false</code>.</li><li><code>date_partition_sequence</code> - (Optional) Date format to use during folder partitioning. Use this parameter when <code>date_partition_enabled</code> is set to true. Valid values are <code>YYYYMMDD</code>, <code>YYYYMMDDHH</code>, <code>YYYYMM</code>, <code>MMYYYYDD</code>, and <code>DDMMYYYY</code>. Default is <code>YYYYMMDD</code>.</li><li><code>dict_page_size_limit</code> - (Optional) Maximum size in bytes of an encoded dictionary page of a column. Default is <code>1048576</code> (1 MiB).</li><li><code>enable_statistics</code> - (Optional) Whether to enable statistics for Parquet pages and row groups. Default is <code>true</code>.</li><li><code>encoding_type</code> - (Optional) Type of encoding to use. Value values are <code>rle_dictionary</code>, <code>plain</code>, and <code>plain_dictionary</code>. Default is <code>rle_dictionary</code>.</li><li><code>encryption_mode</code> - (Optional) Server-side encryption mode that you want to encrypt your .csv or .parquet object files copied to S3. Valid values are <code>SSE_S3</code> and <code>SSE_KMS</code>. Default is <code>SSE_S3</code>.</li><li><code>external_table_definition</code> - (Optional) JSON document that describes how AWS DMS should interpret the data.</li><li><code>ignore_header_rows</code> - (Optional) When this value is set to <code>1</code>, DMS ignores the first row header in a .csv file. Default is <code>0</code>.</li><li><code>include_op_for_full_load</code> - (Optional) Whether to enable a full load to write INSERT operations to the .csv output files only to indicate how the rows were added to the source database. Default is <code>false</code>.</li><li><code>max_file_size</code> - (Optional) Maximum size (in KB) of any .csv file to be created while migrating to an S3 target during full load. Valid values are from <code>1</code> to <code>1048576</code>. Default is <code>1048576</code> (1 GB).</li><li><code>parquet_timestamp_in_millisecond</code> - (Optional) - Specifies the precision of any TIMESTAMP column values written to an S3 object file in .parquet format. Default is <code>false</code>.</li><li><code>parquet_version</code> - (Optional) Version of the .parquet file format. Default is <code>parquet-1-0</code>. Valid values are <code>parquet-1-0</code> and <code>parquet-2-0</code>.</li><li><code>preserve_transactions</code> - (Optional) Whether DMS saves the transaction order for a CDC load on the S3 target specified by <code>cdc_path</code>. Default is <code>false</code>.</li><li><code>rfc_4180</code> - (Optional) For an S3 source, whether each leading double quotation mark has to be followed by an ending double quotation mark. Default is <code>true</code>.</li><li><code>row_group_length</code> - (Optional) Number of rows in a row group. Default is <code>10000</code>.</li><li><code>server_side_encryption_kms_key_id</code> - (Required when <code>encryption_mode</code> is  <code>SSE_KMS</code>, must not be set otherwise) ARN or Id of KMS Key to use when <code>encryption_mode</code> is <code>SSE_KMS</code>.</li><li><code>service_access_role_arn</code> - (Optional) ARN of the IAM Role with permissions to read from or write to the S3 Bucket.</li><li><code>timestamp_column_name</code> - (Optional) Column to add with timestamp information to the endpoint data for an Amazon S3 target.</li><li><code>use_csv_no_sup_value</code> - (Optional) Whether to use <code>csv_no_sup_value</code> for columns not included in the supplemental log.</li><li><code>use_task_start_time_for_full_load_timestamp</code> - (Optional) When set to true, uses the task start time as the timestamp column value instead of the time data is written to target. For full load, when set to true, each row of the timestamp column contains the task start time. For CDC loads, each row of the timestamp column contains the transaction commit time. When set to false, the full load timestamp in the timestamp column increments with the time data arrives at the target. Default is <code>false</code>.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute Reference</h2><p>This resource exports the following attributes in addition to the arguments above:</p><ul><li><code>endpoint_arn</code> - ARN for the endpoint.</li><li><code>tags_all</code> - Map of tags assigned to the resource, including those inherited from the provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a>.</li></ul>", "timeouts": "<h2 id=\"timeouts\">Timeouts</h2><p><a href=\"https://developer.hashicorp.com/terraform/language/resources/syntax#operation-timeouts\">Configuration options</a>:</p><ul><li><code>create</code> - (Default <code>5m</code>)</li><li><code>delete</code> - (Default <code>10m</code>)</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>In Terraform v1.5.0 and later, use an <a href=\"https://developer.hashicorp.com/terraform/language/import\"><code>import</code> block</a> to import endpoints using the <code>endpoint_id</code>. For example:</p><p>terraform<br />import {<br />  to = aws_dms_endpoint.test<br />  id = \"test-dms-endpoint-tf\"<br />}</p><p>Using <code>terraform import</code>, import endpoints using the <code>endpoint_id</code>. For example:</p><p>console<br />% terraform import aws_dms_endpoint.test test-dms-endpoint-tf</p>", "description": "<h1 id=\"resource-aws_dms_endpoint\">Resource: aws_dms_endpoint</h1><p>Provides a DMS (Data Migration Service) endpoint resource. DMS endpoints can be created, updated, deleted, and imported.</p><p>~&gt; <strong>Note:</strong> All arguments including the password will be stored in the raw state as plain-text. <a href=\"https://www.terraform.io/docs/state/sensitive-data.html\">Read more about sensitive data in state</a>.</p><p>~&gt; <strong>Note:</strong> The <code>s3_settings</code> argument is deprecated, may not be maintained, and will be removed in a future version. Use the <a href=\"/docs/providers/aws/r/dms_s3_endpoint.html\"><code>aws_dms_s3_endpoint</code></a> resource instead.</p>"}