{"resource-aws-ec2-fleet": "<h1 id=\"resource-aws_ec2_fleet\">Resource: aws_ec2_fleet</h1><p>Provides a resource to manage EC2 Fleets.</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p>terraform<br />resource \"aws_ec2_fleet\" \"example\" {<br />  launch_template_config {<br />    launch_template_specification {<br />      launch_template_id = aws_launch_template.example.id<br />      version            = aws_launch_template.example.latest_version<br />    }<br />  }</p><br /><p>target_capacity_specification {<br />    default_target_capacity_type = \"spot\"<br />    total_target_capacity        = 5<br />  }<br />}</p><br />", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>This resource supports the following arguments:</p><ul><li><code>context</code> - (Optional) Reserved.</li><li><code>excess_capacity_termination_policy</code> - (Optional) Whether running instances should be terminated if the total target capacity of the EC2 Fleet is decreased below the current size of the EC2. Valid values: <code>no-termination</code>, <code>termination</code>. Defaults to <code>termination</code>. Supported only for fleets of type <code>maintain</code>.</li><li><code>launch_template_config</code> - (Required) Nested argument containing EC2 Launch Template configurations. Defined below.</li><li><code>on_demand_options</code> - (Optional) Nested argument containing On-Demand configurations. Defined below.</li><li><code>replace_unhealthy_instances</code> - (Optional) Whether EC2 Fleet should replace unhealthy instances. Defaults to <code>false</code>. Supported only for fleets of type <code>maintain</code>.</li><li><code>spot_options</code> - (Optional) Nested argument containing Spot configurations. Defined below.</li><li><code>tags</code> - (Optional) Map of Fleet tags. To tag instances at launch, specify the tags in the Launch Template. If configured with a provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a> present, tags with matching keys will overwrite those defined at the provider-level.</li><li><code>target_capacity_specification</code> - (Required) Nested argument containing target capacity configurations. Defined below.</li><li><code>terminate_instances</code> - (Optional) Whether to terminate instances for an EC2 Fleet if it is deleted successfully. Defaults to <code>false</code>.</li><li><code>terminate_instances_with_expiration</code> - (Optional) Whether running instances should be terminated when the EC2 Fleet expires. Defaults to <code>false</code>.</li><li><code>type</code> - (Optional) The type of request. Indicates whether the EC2 Fleet only requests the target capacity, or also attempts to maintain it. Valid values: <code>maintain</code>, <code>request</code>, <code>instant</code>. Defaults to <code>maintain</code>.</li><li><code>valid_from</code> - (Optional) The start date and time of the request, in UTC format (for example, YYYY-MM-DDTHH:MM:SSZ). The default is to start fulfilling the request immediately.</li><li><code>valid_until</code> - (Optional) The end date and time of the request, in UTC format (for example, YYYY-MM-DDTHH:MM:SSZ). At this point, no new EC2 Fleet requests are placed or able to fulfill the request. If no value is specified, the request remains until you cancel it.</li></ul><h3 id=\"launch_template_config\">launch_template_config</h3><p>Describes a launch template and overrides.</p><ul><li><code>launch_template_specification</code> - (Optional) Nested argument containing EC2 Launch Template to use. Defined below.</li><li><code>override</code> - (Optional) Nested argument(s) containing parameters to override the same parameters in the Launch Template. Defined below.</li></ul><h4 id=\"launch_template_specification\">launch_template_specification</h4><p>The launch template to use. You must specify either the launch template ID or launch template name in the request.</p><ul><li><code>launch_template_id</code> - (Optional) The ID of the launch template.</li><li><code>launch_template_name</code> - (Optional) The name of the launch template.</li><li><code>version</code> - (Required) The launch template version number, <code>$Latest</code>, or <code>$Default.</code></li></ul><h4 id=\"override\">override</h4><p>Any parameters that you specify override the same parameters in the launch template. For fleets of type <code>request</code> and <code>maintain</code>, a maximum of 300 items is allowed across all launch templates.</p><p>Example:</p><p>terraform<br />resource \"aws_ec2_fleet\" \"example\" {<br />  # ... other configuration ...</p><p>launch_template_config {<br />    # ... other configuration ...</p><pre><code>override {  instance_type     = \"m4.xlarge\"  weighted_capacity = 1}override {  instance_type     = \"m4.2xlarge\"  weighted_capacity = 2}</code></pre><p>}<br />}</p><ul><li><code>availability_zone</code> - (Optional) Availability Zone in which to launch the instances.</li><li><code>instance_requirements</code> - (Optional) Override the instance type in the Launch Template with instance types that satisfy the requirements.</li><li><code>instance_type</code> - (Optional) Instance type.</li><li><code>max_price</code> - (Optional) Maximum price per unit hour that you are willing to pay for a Spot Instance.</li><li><code>priority</code> - (Optional) Priority for the launch template override. If <code>on_demand_options</code> <code>allocation_strategy</code> is set to <code>prioritized</code>, EC2 Fleet uses priority to determine which launch template override to use first in fulfilling On-Demand capacity. The highest priority is launched first. The lower the number, the higher the priority. If no number is set, the launch template override has the lowest priority. Valid values are whole numbers starting at 0.</li><li><code>subnet_id</code> - (Optional) ID of the subnet in which to launch the instances.</li><li><code>weighted_capacity</code> - (Optional) Number of units provided by the specified instance type.</li></ul><h5 id=\"instance_requirements\">instance_requirements</h5><p>The attributes for the instance types. For a list of currently supported values, please see <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_InstanceRequirementsRequest.html\">'InstanceRequirementsRequest'</a>.</p><p>This configuration block supports the following:</p><p>~&gt; <strong>NOTE:</strong> Both <code>memory_mib.min</code> and <code>vcpu_count.min</code> must be specified.</p><ul><li><code>accelerator_count</code> - (Optional) Block describing the minimum and maximum number of accelerators (GPUs, FPGAs, or AWS Inferentia chips). Default is no minimum or maximum limits.<ul><li><code>min</code> - (Optional) Minimum.</li><li><code>max</code> - (Optional) Maximum. Set to <code>0</code> to exclude instance types with accelerators.</li></ul></li><li><code>accelerator_manufacturers</code> - (Optional) List of accelerator manufacturer names. Default is any manufacturer.</li><li><code>accelerator_names</code> - (Optional) List of accelerator names. Default is any acclerator.</li><li><code>accelerator_total_memory_mib</code> - (Optional) Block describing the minimum and maximum total memory of the accelerators. Default is no minimum or maximum.<ul><li><code>min</code> - (Optional) The minimum amount of accelerator memory, in MiB. To specify no minimum limit, omit this parameter.</li><li><code>max</code> - (Optional) The maximum amount of accelerator memory, in MiB. To specify no maximum limit, omit this parameter.</li></ul></li><li><code>accelerator_types</code> - (Optional) The accelerator types that must be on the instance type. Default is any accelerator type.</li><li><p><code>allowed_instance_types</code> - (Optional) The instance types to apply your specified attributes against. All other instance types are ignored, even if they match your specified attributes. You can use strings with one or more wild cards,represented by an asterisk (*). The following are examples: <code>c5*</code>, <code>m5a.*</code>, <code>r*</code>, <code>*3*</code>. For example, if you specify <code>c5*</code>, you are excluding the entire C5 instance family, which includes all C5a and C5n instance types. If you specify <code>m5a.*</code>, you are excluding all the M5a instance types, but not the M5n instance types. Maximum of 400 entries in the list; each entry is limited to 30 characters. Default is no excluded instance types. Default is any instance type.</p><p>If you specify <code>AllowedInstanceTypes</code>, you can't specify <code>ExcludedInstanceTypes</code>.</p></li><li><p><code>bare_metal</code> - (Optional) Indicate whether bare metal instace types should be <code>included</code>, <code>excluded</code>, or <code>required</code>. Default is <code>excluded</code>.</p></li><li><code>baseline_ebs_bandwidth_mbps</code> - (Optional) Block describing the minimum and maximum baseline EBS bandwidth, in Mbps. Default is no minimum or maximum.<ul><li><code>min</code> - (Optional) The minimum baseline bandwidth, in Mbps. To specify no minimum limit, omit this parameter..</li><li><code>max</code> - (Optional) The maximum baseline bandwidth, in Mbps. To specify no maximum limit, omit this parameter..</li></ul></li><li><code>burstable_performance</code> - (Optional) Indicates whether burstable performance T instance types are <code>included</code>, <code>excluded</code>, or <code>required</code>. Default is <code>excluded</code>.</li><li><code>cpu_manufacturers</code> (Optional) The CPU manufacturers to include. Default is any manufacturer.<br />    ~&gt; <strong>NOTE:</strong> Don't confuse the CPU hardware manufacturer with the CPU hardware architecture. Instances will be launched with a compatible CPU architecture based on the Amazon Machine Image (AMI) that you specify in your launch template.</li><li><p><code>excluded_instance_types</code> - (Optional) The instance types to exclude. You can use strings with one or more wild cards, represented by an asterisk (*). The following are examples: <code>c5*</code>, <code>m5a.*</code>, <code>r*</code>, <code>*3*</code>. For example, if you specify <code>c5*</code>, you are excluding the entire C5 instance family, which includes all C5a and C5n instance types. If you specify <code>m5a.*</code>, you are excluding all the M5a instance types, but not the M5n instance types. Maximum of 400 entries in the list; each entry is limited to 30 characters. Default is no excluded instance types.</p><p>If you specify <code>AllowedInstanceTypes</code>, you can't specify <code>ExcludedInstanceTypes</code>.</p></li><li><p><code>instance_generations</code> - (Optional) Indicates whether current or previous generation instance types are included. The current generation instance types are recommended for use. Valid values are <code>current</code> and <code>previous</code>. Default is <code>current</code> and <code>previous</code> generation instance types.</p></li><li><code>local_storage</code> - (Optional) Indicate whether instance types with local storage volumes are <code>included</code>, <code>excluded</code>, or <code>required</code>. Default is <code>included</code>.</li><li><code>local_storage_types</code> - (Optional) List of local storage type names. Valid values are <code>hdd</code> and <code>ssd</code>. Default any storage type.</li><li><code>memory_gib_per_vcpu</code> - (Optional) Block describing the minimum and maximum amount of memory (GiB) per vCPU. Default is no minimum or maximum.<ul><li><code>min</code> - (Optional) The minimum amount of memory per vCPU, in GiB. To specify no minimum limit, omit this parameter.</li><li><code>max</code> - (Optional) The maximum amount of memory per vCPU, in GiB. To specify no maximum limit, omit this parameter.</li></ul></li><li><code>memory_mib</code> - (Required) The minimum and maximum amount of memory per vCPU, in GiB. Default is no minimum or maximum limits.<ul><li><code>min</code> - (Required) The minimum amount of memory, in MiB. To specify no minimum limit, specify <code>0</code>.</li><li><code>max</code> - (Optional) The maximum amount of memory, in MiB. To specify no maximum limit, omit this parameter.</li></ul></li><li><code>network_bandwidth_gbps</code> - (Optional) The minimum and maximum amount of network bandwidth, in gigabits per second (Gbps). Default is No minimum or maximum.<ul><li><code>min</code> - (Optional) The minimum amount of network bandwidth, in Gbps. To specify no minimum limit, omit this parameter.</li><li><code>max</code> - (Optional) The maximum amount of network bandwidth, in Gbps. To specify no maximum limit, omit this parameter.</li></ul></li><li><code>network_interface_count</code> - (Optional) Block describing the minimum and maximum number of network interfaces. Default is no minimum or maximum.<ul><li><code>min</code> - (Optional) The minimum number of network interfaces. To specify no minimum limit, omit this parameter.</li><li><code>max</code> - (Optional) The maximum number of network interfaces. To specify no maximum limit, omit this parameter.</li></ul></li><li><p><code>on_demand_max_price_percentage_over_lowest_price</code> - (Optional) The price protection threshold for On-Demand Instances. This is the maximum you’ll pay for an On-Demand Instance, expressed as a percentage higher than the cheapest M, C, or R instance type with your specified attributes. When Amazon EC2 Auto Scaling selects instance types with your attributes, we will exclude instance types whose price is higher than your threshold. The parameter accepts an integer, which Amazon EC2 Auto Scaling interprets as a percentage. To turn off price protection, specify a high value, such as 999999. Default is 20.</p><p>If you set <code>target_capacity_unit_type</code> to <code>vcpu</code> or <code>memory-mib</code>, the price protection threshold is applied based on the per-vCPU or per-memory price instead of the per-instance price.</p></li><li><p><code>require_hibernate_support</code> - (Optional) Indicate whether instance types must support On-Demand Instance Hibernation, either <code>true</code> or <code>false</code>. Default is <code>false</code>.</p></li><li><p><code>spot_max_price_percentage_over_lowest_price</code> - (Optional) The price protection threshold for Spot Instances. This is the maximum you’ll pay for a Spot Instance, expressed as a percentage higher than the cheapest M, C, or R instance type with your specified attributes. When Amazon EC2 Auto Scaling selects instance types with your attributes, we will exclude instance types whose price is higher than your threshold. The parameter accepts an integer, which Amazon EC2 Auto Scaling interprets as a percentage. To turn off price protection, specify a high value, such as 999999. Default is 100.</p><p>If you set DesiredCapacityType to vcpu or memory-mib, the price protection threshold is applied based on the per vCPU or per memory price instead of the per instance price.</p></li><li><p><code>total_local_storage_gb</code> - (Optional) Block describing the minimum and maximum total local storage (GB). Default is no minimum or maximum.</p><ul><li><code>min</code> - (Optional) The minimum amount of total local storage, in GB. To specify no minimum limit, omit this parameter.</li><li><code>max</code> - (Optional) The maximum amount of total local storage, in GB. To specify no maximum limit, omit this parameter.</li></ul></li><li><code>vcpu_count</code> - (Required) Block describing the minimum and maximum number of vCPUs. Default is no maximum.<ul><li><code>min</code> - (Required) The minimum number of vCPUs. To specify no minimum limit, specify <code>0</code>.</li><li><code>max</code> - (Optional) The maximum number of vCPUs. To specify no maximum limit, omit this parameter.</li></ul></li></ul><h3 id=\"on_demand_options\">on_demand_options</h3><ul><li><code>allocation_strategy</code> - (Optional) The order of the launch template overrides to use in fulfilling On-Demand capacity. Valid values: <code>lowestPrice</code>, <code>prioritized</code>. Default: <code>lowestPrice</code>.</li><li><code>capacity_reservation_options</code> (Optional) The strategy for using unused Capacity Reservations for fulfilling On-Demand capacity. Supported only for fleets of type <code>instant</code>.<ul><li><code>usage_strategy</code> - (Optional) Indicates whether to use unused Capacity Reservations for fulfilling On-Demand capacity. Valid values: <code>use-capacity-reservations-first</code>.</li></ul></li><li><code>max_total_price</code> - (Optional) The maximum amount per hour for On-Demand Instances that you're willing to pay.</li><li><p><code>min_target_capacity</code> - (Optional) The minimum target capacity for On-Demand Instances in the fleet. If the minimum target capacity is not reached, the fleet launches no instances. Supported only for fleets of type <code>instant</code>.<br />    If you specify <code>min_target_capacity</code>, at least one of the following must be specified: <code>single_availability_zone</code> or <code>single_instance_type</code>.</p></li><li><p><code>single_availability_zone</code> - (Optional) Indicates that the fleet launches all On-Demand Instances into a single Availability Zone. Supported only for fleets of type <code>instant</code>.</p></li><li><code>single_instance_type</code> - (Optional) Indicates that the fleet uses a single instance type to launch all On-Demand Instances in the fleet. Supported only for fleets of type <code>instant</code>.</li></ul><h3 id=\"spot_options\">spot_options</h3><ul><li><code>allocation_strategy</code> - (Optional) How to allocate the target capacity across the Spot pools. Valid values: <code>diversified</code>, <code>lowestPrice</code>, <code>capacity-optimized</code>, <code>capacity-optimized-prioritized</code> and <code>price-capacity-optimized</code>. Default: <code>lowestPrice</code>.</li><li><code>instance_interruption_behavior</code> - (Optional) Behavior when a Spot Instance is interrupted. Valid values: <code>hibernate</code>, <code>stop</code>, <code>terminate</code>. Default: <code>terminate</code>.</li><li><code>instance_pools_to_use_count</code> - (Optional) Number of Spot pools across which to allocate your target Spot capacity. Valid only when Spot <code>allocation_strategy</code> is set to <code>lowestPrice</code>. Default: <code>1</code>.</li><li><code>maintenance_strategies</code> - (Optional) Nested argument containing maintenance strategies for managing your Spot Instances that are at an elevated risk of being interrupted. Defined below.</li><li><code>max_total_price</code> - (Optional) The maximum amount per hour for Spot Instances that you're willing to pay.</li><li><code>min_target_capacity</code> - (Optional) The minimum target capacity for Spot Instances in the fleet. If the minimum target capacity is not reached, the fleet launches no instances. Supported only for fleets of type <code>instant</code>.</li><li><code>single_availability_zone</code> - (Optional) Indicates that the fleet launches all Spot Instances into a single Availability Zone. Supported only for fleets of type <code>instant</code>.</li><li><code>single_instance_type</code> - (Optional) Indicates that the fleet uses a single instance type to launch all Spot Instances in the fleet. Supported only for fleets of type <code>instant</code>.</li></ul><h3 id=\"maintenance_strategies\">maintenance_strategies</h3><ul><li><code>capacity_rebalance</code> - (Optional) Nested argument containing the capacity rebalance for your fleet request. Defined below.</li></ul><h3 id=\"capacity_rebalance\">capacity_rebalance</h3><ul><li><code>replacement_strategy</code> - (Optional) The replacement strategy to use. Only available for fleets of <code>type</code> set to <code>maintain</code>. Valid values: <code>launch</code>.</li></ul><h3 id=\"target_capacity_specification\">target_capacity_specification</h3><ul><li><code>default_target_capacity_type</code> - (Required) Default target capacity type. Valid values: <code>on-demand</code>, <code>spot</code>.</li><li><code>on_demand_target_capacity</code> - (Optional) The number of On-Demand units to request.</li><li><code>spot_target_capacity</code> - (Optional) The number of Spot units to request.</li><li><p><code>target_capacity_unit_type</code> - (Optional) The unit for the target capacity.<br />    If you specify <code>target_capacity_unit_type</code>, <code>instance_requirements</code> must be specified.</p></li><li><p><code>total_target_capacity</code> - (Required) The number of units to request, filled using <code>default_target_capacity_type</code>.</p></li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute Reference</h2><p>This resource exports the following attributes in addition to the arguments above:</p><ul><li><code>id</code> - Fleet identifier</li><li><code>arn</code> - The ARN of the fleet</li><li><code>fleet_instance_set</code> - Information about the instances that were launched by the fleet. Available only when <code>type</code> is set to <code>instant</code>.<ul><li><code>instance_ids</code> - The IDs of the instances.</li><li><code>instance_type</code> - The instance type.</li><li><code>lifecycle</code> - Indicates if the instance that was launched is a Spot Instance or On-Demand Instance.</li><li><code>platform</code> - The value is <code>Windows</code> for Windows instances. Otherwise, the value is blank.</li></ul></li><li><code>fleet_state</code> - The state of the EC2 Fleet.</li><li><code>fulfilled_capacity</code> - The number of units fulfilled by this request compared to the set target capacity.</li><li><code>fulfilled_on_demand_capacity</code> - The number of units fulfilled by this request compared to the set target On-Demand capacity.</li><li><code>tags_all</code> - A map of tags assigned to the resource, including those inherited from the provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a>.</li></ul>", "timeouts": "<h2 id=\"timeouts\">Timeouts</h2><p><a href=\"https://developer.hashicorp.com/terraform/language/resources/syntax#operation-timeouts\">Configuration options</a>:</p><ul><li><code>create</code> - (Default <code>10m</code>)</li><li><code>update</code> - (Default <code>10m</code>)</li><li><code>delete</code> - (Default <code>10m</code>)</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>In Terraform v1.5.0 and later, use an <a href=\"https://developer.hashicorp.com/terraform/language/import\"><code>import</code> block</a> to import <code>aws_ec2_fleet</code> using the Fleet identifier. For example:</p><p>terraform<br />import {<br />  to = aws_ec2_fleet.example<br />  id = \"fleet-b9b55d27-c5fc-41ac-a6f3-48fcc91f080c\"<br />}</p><p>Using <code>terraform import</code>, import <code>aws_ec2_fleet</code> using the Fleet identifier. For example:</p><p>console<br />% terraform import aws_ec2_fleet.example fleet-b9b55d27-c5fc-41ac-a6f3-48fcc91f080c</p>", "description": "<h1 id=\"resource-aws_ec2_fleet\">Resource: aws_ec2_fleet</h1><p>Provides a resource to manage EC2 Fleets.</p>"}