{"resource-aws-elastictranscoder-preset": "<h1 id=\"resource-aws_elastictranscoder_preset\">Resource: aws_elastictranscoder_preset</h1><p>Provides an Elastic Transcoder preset resource.</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p>terraform<br />resource \"aws_elastictranscoder_preset\" \"bar\" {<br />  container   = \"mp4\"<br />  description = \"Sample Preset\"<br />  name        = \"sample_preset\"</p><p>audio {<br />    audio_packing_mode = \"SingleTrack\"<br />    bit_rate           = 96<br />    channels           = 2<br />    codec              = \"AAC\"<br />    sample_rate        = 44100<br />  }</p><p>audio_codec_options {<br />    profile = \"AAC-LC\"<br />  }</p><p>video {<br />    bit_rate             = \"1600\"<br />    codec                = \"H.264\"<br />    display_aspect_ratio = \"16:9\"<br />    fixed_gop            = \"false\"<br />    frame_rate           = \"auto\"<br />    max_frame_rate       = \"60\"<br />    keyframes_max_dist   = 240<br />    max_height           = \"auto\"<br />    max_width            = \"auto\"<br />    padding_policy       = \"Pad\"<br />    sizing_policy        = \"Fit\"<br />  }</p><p>video_codec_options = {<br />    Profile                  = \"main\"<br />    Level                    = \"2.2\"<br />    MaxReferenceFrames       = 3<br />    InterlacedMode           = \"Progressive\"<br />    ColorSpaceConversionMode = \"None\"<br />  }</p><p>video_watermarks {<br />    id                = \"Terraform Test\"<br />    max_width         = \"20%\"<br />    max_height        = \"20%\"<br />    sizing_policy     = \"ShrinkToFit\"<br />    horizontal_align  = \"Right\"<br />    horizontal_offset = \"10px\"<br />    vertical_align    = \"Bottom\"<br />    vertical_offset   = \"10px\"<br />    opacity           = \"55.5\"<br />    target            = \"Content\"<br />  }</p><p>thumbnails {<br />    format         = \"png\"<br />    interval       = 120<br />    max_width      = \"auto\"<br />    max_height     = \"auto\"<br />    padding_policy = \"Pad\"<br />    sizing_policy  = \"Fit\"<br />  }<br />}<br /></p>", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>See <a href=\"http://docs.aws.amazon.com/elastictranscoder/latest/developerguide/create-preset.html\">\"Create Preset\"</a> in the AWS docs for reference.</p><p>This argument supports the following arguments:</p><ul><li><code>audio</code> - (Optional, Forces new resource) Audio parameters object (documented below).</li><li><code>audio_codec_options</code> - (Optional, Forces new resource) Codec options for the audio parameters (documented below)</li><li><code>container</code> - (Required, Forces new resource) The container type for the output file. Valid values are <code>flac</code>, <code>flv</code>, <code>fmp4</code>, <code>gif</code>, <code>mp3</code>, <code>mp4</code>, <code>mpg</code>, <code>mxf</code>, <code>oga</code>, <code>ogg</code>, <code>ts</code>, and <code>webm</code>.</li><li><code>description</code> - (Optional, Forces new resource) A description of the preset (maximum 255 characters)</li><li><code>name</code> - (Optional, Forces new resource) The name of the preset. (maximum 40 characters)</li><li><code>thumbnails</code> - (Optional, Forces new resource) Thumbnail parameters object (documented below)</li><li><code>video</code> - (Optional, Forces new resource) Video parameters object (documented below)</li><li><code>video_watermarks</code> - (Optional, Forces new resource) Watermark parameters for the video parameters (documented below)</li><li><code>video_codec_options</code> (Optional, Forces new resource) Codec options for the video parameters</li></ul><p>The <code>audio</code> object supports the following:</p><ul><li><code>audio_packing_mode</code> - The method of organizing audio channels and tracks. Use Audio:Channels to specify the number of channels in your output, and Audio:AudioPackingMode to specify the number of tracks and their relation to the channels. If you do not specify an Audio:AudioPackingMode, Elastic Transcoder uses SingleTrack.</li><li><code>bit_rate</code> - The bit rate of the audio stream in the output file, in kilobits/second. Enter an integer between 64 and 320, inclusive.</li><li><code>channels</code> - The number of audio channels in the output file</li><li><code>codec</code> - The audio codec for the output file. Valid values are <code>AAC</code>, <code>flac</code>, <code>mp2</code>, <code>mp3</code>, <code>pcm</code>, and <code>vorbis</code>.</li><li><code>sample_rate</code> - The sample rate of the audio stream in the output file, in hertz. Valid values are: <code>auto</code>, <code>22050</code>, <code>32000</code>, <code>44100</code>, <code>48000</code>, <code>96000</code></li></ul><p>The <code>audio_codec_options</code> object supports the following:</p><ul><li><code>bit_depth</code> - The bit depth of a sample is how many bits of information are included in the audio samples. Valid values are <code>16</code> and <code>24</code>. (FLAC/PCM Only)</li><li><code>bit_order</code> - The order the bits of a PCM sample are stored in. The supported value is LittleEndian. (PCM Only)</li><li><code>profile</code> - If you specified AAC for Audio:Codec, choose the AAC profile for the output file.</li><li><code>signed</code> - Whether audio samples are represented with negative and positive numbers (signed) or only positive numbers (unsigned). The supported value is Signed. (PCM Only)</li></ul><p>The <code>thumbnails</code> object supports the following:</p><ul><li><code>aspect_ratio</code> - The aspect ratio of thumbnails. The following values are valid: auto, 1:1, 4:3, 3:2, 16:9</li><li><code>format</code> - The format of thumbnails, if any. Valid formats are jpg and png.</li><li><code>interval</code> - The approximate number of seconds between thumbnails. The value must be an integer. The actual interval can vary by several seconds from one thumbnail to the next.</li><li><code>max_height</code> - The maximum height of thumbnails, in pixels. If you specify auto, Elastic Transcoder uses 1080 (Full HD) as the default value. If you specify a numeric value, enter an even integer between 32 and 3072, inclusive.</li><li><code>max_width</code> - The maximum width of thumbnails, in pixels. If you specify auto, Elastic Transcoder uses 1920 (Full HD) as the default value. If you specify a numeric value, enter an even integer between 32 and 4096, inclusive.</li><li><code>padding_policy</code> - When you set PaddingPolicy to Pad, Elastic Transcoder might add black bars to the top and bottom and/or left and right sides of thumbnails to make the total size of the thumbnails match the values that you specified for thumbnail MaxWidth and MaxHeight settings.</li><li><code>resolution</code> - The width and height of thumbnail files in pixels, in the format WidthxHeight, where both values are even integers. The values cannot exceed the width and height that you specified in the Video:Resolution object. (To better control resolution and aspect ratio of thumbnails, we recommend that you use the thumbnail values <code>max_width</code>, <code>max_height</code>, <code>sizing_policy</code>, and <code>padding_policy</code> instead of <code>resolution</code> and <code>aspect_ratio</code>. The two groups of settings are mutually exclusive. Do not use them together)</li><li><code>sizing_policy</code> - A value that controls scaling of thumbnails. Valid values are: <code>Fit</code>, <code>Fill</code>, <code>Stretch</code>, <code>Keep</code>, <code>ShrinkToFit</code>, and <code>ShrinkToFill</code>.</li></ul><p>The <code>video</code> object supports the following:</p><ul><li><code>aspect_ratio</code> - The display aspect ratio of the video in the output file. Valid values are: <code>auto</code>, <code>1:1</code>, <code>4:3</code>, <code>3:2</code>, <code>16:9</code>. (Note; to better control resolution and aspect ratio of output videos, we recommend that you use the values <code>max_width</code>, <code>max_height</code>, <code>sizing_policy</code>, <code>padding_policy</code>, and <code>display_aspect_ratio</code> instead of <code>resolution</code> and <code>aspect_ratio</code>.)</li><li><code>bit_rate</code> - The bit rate of the video stream in the output file, in kilobits/second. You can configure variable bit rate or constant bit rate encoding.</li><li><code>codec</code> - The video codec for the output file. Valid values are <code>gif</code>, <code>H.264</code>, <code>mpeg2</code>, <code>vp8</code>, and <code>vp9</code>.</li><li><code>display_aspect_ratio</code> - The value that Elastic Transcoder adds to the metadata in the output file. If you set DisplayAspectRatio to auto, Elastic Transcoder chooses an aspect ratio that ensures square pixels. If you specify another option, Elastic Transcoder sets that value in the output file.</li><li><code>fixed_gop</code> - Whether to use a fixed value for Video:FixedGOP. Not applicable for containers of type gif. Valid values are true and false. Also known as, Fixed Number of Frames Between Keyframes.</li><li><code>frame_rate</code> - The frames per second for the video stream in the output file. The following values are valid: <code>auto</code>, <code>10</code>, <code>15</code>, <code>23.97</code>, <code>24</code>, <code>25</code>, <code>29.97</code>, <code>30</code>, <code>50</code>, <code>60</code>.</li><li><code>keyframes_max_dist</code> - The maximum number of frames between key frames. Not applicable for containers of type gif.</li><li><code>max_frame_rate</code> - If you specify auto for FrameRate, Elastic Transcoder uses the frame rate of the input video for the frame rate of the output video, up to the maximum frame rate. If you do not specify a MaxFrameRate, Elastic Transcoder will use a default of 30.</li><li><code>max_height</code> - The maximum height of the output video in pixels. If you specify auto, Elastic Transcoder uses 1080 (Full HD) as the default value. If you specify a numeric value, enter an even integer between 96 and 3072, inclusive.</li><li><code>max_width</code> - The maximum width of the output video in pixels. If you specify auto, Elastic Transcoder uses 1920 (Full HD) as the default value. If you specify a numeric value, enter an even integer between 128 and 4096, inclusive.</li><li><code>padding_policy</code> - When you set PaddingPolicy to Pad, Elastic Transcoder might add black bars to the top and bottom and/or left and right sides of the output video to make the total size of the output video match the values that you specified for <code>max_width</code> and <code>max_height</code>.</li><li><code>resolution</code> - The width and height of the video in the output file, in pixels. Valid values are <code>auto</code> and <code>widthxheight</code>. (see note for <code>aspect_ratio</code>)</li><li><code>sizing_policy</code> - A value that controls scaling of the output video. Valid values are: <code>Fit</code>, <code>Fill</code>, <code>Stretch</code>, <code>Keep</code>, <code>ShrinkToFit</code>, <code>ShrinkToFill</code>.</li></ul><p>The <code>video_watermarks</code> object supports the following:</p><ul><li><code>horizontal_align</code> - The horizontal position of the watermark unless you specify a nonzero value for <code>horzontal_offset</code>.</li><li><code>horizontal_offset</code> - The amount by which you want the horizontal position of the watermark to be offset from the position specified by <code>horizontal_align</code>.</li><li><code>id</code> - A unique identifier for the settings for one watermark. The value of Id can be up to 40 characters long. You can specify settings for up to four watermarks.</li><li><code>max_height</code> - The maximum height of the watermark.</li><li><code>max_width</code> - The maximum width of the watermark.</li><li><code>opacity</code> - A percentage that indicates how much you want a watermark to obscure the video in the location where it appears.</li><li><code>sizing_policy</code> - A value that controls scaling of the watermark. Valid values are: <code>Fit</code>, <code>Stretch</code>, <code>ShrinkToFit</code></li><li><code>target</code> - A value that determines how Elastic Transcoder interprets values that you specified for <code>video_watermarks.horizontal_offset</code>, <code>video_watermarks.vertical_offset</code>, <code>video_watermarks.max_width</code>, and <code>video_watermarks.max_height</code>. Valid values are <code>Content</code> and <code>Frame</code>.</li><li><code>vertical_align</code> - The vertical position of the watermark unless you specify a nonzero value for <code>vertical_align</code>. Valid values are <code>Top</code>, <code>Bottom</code>, <code>Center</code>.</li><li><code>vertical_offset</code> - The amount by which you want the vertical position of the watermark to be offset from the position specified by <code>vertical_align</code></li></ul><p>The <code>video_codec_options</code> map supports the following:</p><ul><li><code>Profile</code> - The codec profile that you want to use for the output file. (H.264/VP8 Only)</li><li><code>Level</code> - The H.264 level that you want to use for the output file. Elastic Transcoder supports the following levels: <code>1</code>, <code>1b</code>, <code>1.1</code>, <code>1.2</code>, <code>1.3</code>, <code>2</code>, <code>2.1</code>, <code>2.2</code>, <code>3</code>, <code>3.1</code>, <code>3.2</code>, <code>4</code>, <code>4.1</code> (H.264 only)</li><li><code>MaxReferenceFrames</code> - The maximum number of previously decoded frames to use as a reference for decoding future frames. Valid values are integers 0 through 16. (H.264 only)</li><li><code>MaxBitRate</code> - The maximum number of kilobits per second in the output video. Specify a value between 16 and 62,500 inclusive, or <code>auto</code>. (Optional, H.264/MPEG2/VP8/VP9 only)</li><li><code>BufferSize</code> - The maximum number of kilobits in any x seconds of the output video. This window is commonly 10 seconds, the standard segment duration when you're using ts for the container type of the output video. Specify an integer greater than 0. If you specify MaxBitRate and omit BufferSize, Elastic Transcoder sets BufferSize to 10 times the value of MaxBitRate. (Optional, H.264/MPEG2/VP8/VP9 only)</li><li><code>InterlacedMode</code> -  The interlace mode for the output video. (Optional, H.264/MPEG2 Only)</li><li><code>ColorSpaceConversion</code> - The color space conversion Elastic Transcoder applies to the output video. Valid values are <code>None</code>, <code>Bt709toBt601</code>, <code>Bt601toBt709</code>, and <code>Auto</code>. (Optional, H.264/MPEG2 Only)</li><li><code>ChromaSubsampling</code> - The sampling pattern for the chroma (color) channels of the output video. Valid values are <code>yuv420p</code> and <code>yuv422p</code>.</li><li><code>LoopCount</code> - The number of times you want the output gif to loop (Gif only)</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute Reference</h2><p>This resource exports the following attributes in addition to the arguments above:</p><ul><li><code>arn</code> - Amazon Resource Name (ARN) of the Elastic Transcoder Preset.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>In Terraform v1.5.0 and later, use an <a href=\"https://developer.hashicorp.com/terraform/language/import\"><code>import</code> block</a> to import Elastic Transcoder presets using the <code>id</code>. For example:</p><p><code>terraformimport {  to = aws_elastictranscoder_preset.basic_preset  id = \"1407981661351-cttk8b\"}</code></p><p>Using <code>terraform import</code>, import Elastic Transcoder presets using the <code>id</code>. For example:</p><p><code>console% terraform import aws_elastictranscoder_preset.basic_preset 1407981661351-cttk8b</code></p>", "description": "<h1 id=\"resource-aws_elastictranscoder_preset\">Resource: aws_elastictranscoder_preset</h1><p>Provides an Elastic Transcoder preset resource.</p>"}