{"resource-aws-lex-bot": "<h1 id=\"resource-aws_lex_bot\">Resource: aws_lex_bot</h1><p>Provides an Amazon Lex Bot resource. For more information see<br /><a href=\"https://docs.aws.amazon.com/lex/latest/dg/how-it-works.html\">Amazon Lex: How It Works</a></p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p>terraform<br />resource \"aws_lex_bot\" \"order_flowers_bot\" {<br />  abort_statement {<br />    message {<br />      content      = \"Sorry, I am not able to assist at this time\"<br />      content_type = \"PlainText\"<br />    }<br />  }</p><p>child_directed = false</p><p>clarification_prompt {<br />    max_attempts = 2</p><pre><code>message {  content      = \"I didn't understand you, what would you like to do?\"  content_type = \"PlainText\"}</code></pre><p>}</p><p>create_version              = false<br />  description                 = \"Bot to order flowers on the behalf of a user\"<br />  idle_session_ttl_in_seconds = 600</p><p>intent {<br />    intent_name    = \"OrderFlowers\"<br />    intent_version = \"1\"<br />  }</p><p>locale           = \"en-US\"<br />  name             = \"OrderFlowers\"<br />  process_behavior = \"BUILD\"<br />  voice_id         = \"Salli\"<br />}<br /></p>", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>This resource supports the following arguments:</p><ul><li><code>abort_statement</code> - (Required) The message that Amazon Lex uses to abort a conversation. Attributes are documented under <a href=\"#statement\">statement</a>.</li><li><code>child_directed</code> - (Required) By specifying true, you confirm that your use of Amazon Lex is related to a website, program, or other application that is directed or targeted, in whole or in part, to children under age 13 and subject to COPPA. For more information see the <a href=\"https://aws.amazon.com/lex/faqs#data-security\">Amazon Lex FAQ</a> and the <a href=\"https://docs.aws.amazon.com/lex/latest/dg/API_PutBot.html#lex-PutBot-request-childDirected\">Amazon Lex PutBot API Docs</a>.</li><li><code>clarification_prompt</code> - (Required) The message that Amazon Lex uses when it doesn't understand the user's request. Attributes are documented under <a href=\"#prompt\">prompt</a>.</li><li><code>create_version</code> - (Optional) Determines if a new bot version is created when the initial resource is created and on each update. Defaults to <code>false</code>.</li><li><code>description</code> - (Optional) A description of the bot. Must be less than or equal to 200 characters in length.</li><li><code>detect_sentiment</code> - (Optional) When set to true user utterances are sent to Amazon Comprehend for sentiment analysis. If you don't specify detectSentiment, the default is <code>false</code>.</li><li><code>enable_model_improvements</code> - (Optional) Set to <code>true</code> to enable access to natural language understanding improvements. When you set the <code>enable_model_improvements</code> parameter to true you can use the <code>nlu_intent_confidence_threshold</code> parameter to configure confidence scores. For more information, see <a href=\"https://docs.aws.amazon.com/lex/latest/dg/confidence-scores.html\">Confidence Scores</a>. You can only set the <code>enable_model_improvements</code> parameter in certain Regions. If you set the parameter to true, your bot has access to accuracy improvements. For more information see the <a href=\"https://docs.aws.amazon.com/lex/latest/dg/API_PutBot.html#lex-PutBot-request-enableModelImprovements\">Amazon Lex Bot PutBot API Docs</a>.</li><li><code>idle_session_ttl_in_seconds</code> - (Optional) The maximum time in seconds that Amazon Lex retains the data gathered in a conversation. Default is <code>300</code>. Must be a number between 60 and 86400 (inclusive).</li><li><code>locale</code> - (Optional) Specifies the target locale for the bot. Any intent used in the bot must be compatible with the locale of the bot. For available locales, see <a href=\"https://docs.aws.amazon.com/lex/latest/dg/API_PutBot.html#lex-PutBot-request-locale\">Amazon Lex Bot PutBot API Docs</a>. Default is <code>en-US</code>.</li><li><code>intent</code> - (Required) A set of Intent objects. Each intent represents a command that a user can express. Attributes are documented under <a href=\"#intent\">intent</a>. Can have up to 250 Intent objects.</li><li><code>name</code> - (Required) The name of the bot that you want to create, case sensitive. Must be between 2 and 50 characters in length.</li><li><code>nlu_intent_confidence_threshold</code> - (Optional) Determines the threshold where Amazon Lex will insert the AMAZON.FallbackIntent, AMAZON.KendraSearchIntent, or both when returning alternative intents in a PostContent or PostText response. AMAZON.FallbackIntent and AMAZON.KendraSearchIntent are only inserted if they are configured for the bot. For more information see <a href=\"https://docs.aws.amazon.com/lex/latest/dg/API_PutBot.html#lex-PutBot-request-nluIntentConfidenceThreshold\">Amazon Lex Bot PutBot API Docs</a> This value requires <code>enable_model_improvements</code> to be set to <code>true</code> and the default is <code>0</code>. Must be a float between 0 and 1.</li><li><code>process_behavior</code> - (Optional) If you set the <code>process_behavior</code> element to <code>BUILD</code>, Amazon Lex builds the bot so that it can be run. If you set the element to <code>SAVE</code> Amazon Lex saves the bot, but doesn't build it. Default is <code>SAVE</code>.</li><li><code>voice_id</code> - (Optional) The Amazon Polly voice ID that you want Amazon Lex to use for voice interactions with the user. The locale configured for the voice must match the locale of the bot. For more information, see <a href=\"http://docs.aws.amazon.com/polly/latest/dg/voicelist.html\">Available Voices</a> in the Amazon Polly Developer Guide.</li></ul><h3 id=\"intent\">intent</h3><p>Identifies the specific version of an intent.</p><ul><li><code>intent_name</code> - (Required) The name of the intent. Must be less than or equal to 100 characters in length.</li><li><code>intent_version</code> - (Required) The version of the intent. Must be less than or equal to 64 characters in length.</li></ul><h3 id=\"message\">message</h3><p>The message object that provides the message text and its type.</p><ul><li><code>content</code> - (Required) The text of the message.</li><li><code>content_type</code> - (Required) The content type of the message string.</li><li><code>group_number</code> - (Optional) Identifies the message group that the message belongs to. When a group<br />is assigned to a message, Amazon Lex returns one message from each group in the response.</li></ul><h3 id=\"prompt\">prompt</h3><p>Obtains information from the user. To define a prompt, provide one or more messages and specify the<br />number of attempts to get information from the user. If you provide more than one message, Amazon<br />Lex chooses one of the messages to use to prompt the user.</p><ul><li><code>max_attempts</code> - (Required) The number of times to prompt the user for information.</li><li><code>message</code> - (Required) A set of messages, each of which provides a message string and its type.<br />You can specify the message string in plain text or in Speech Synthesis Markup Language (SSML).<br />Attributes are documented under <a href=\"#message\">message</a>.</li><li><code>response_card</code> - (Optional) The response card. Amazon Lex will substitute session attributes and<br />slot values into the response card. For more information, see<br /><a href=\"https://docs.aws.amazon.com/lex/latest/dg/ex-resp-card.html\">Example: Using a Response Card</a>.</li></ul><h3 id=\"statement\">statement</h3><p>A statement is a map with a set of message maps and an optional response card string. Messages<br />convey information to the user. At runtime, Amazon Lex selects the message to convey.</p><ul><li><code>message</code> - (Required) A set of messages, each of which provides a message string and its type. You<br />can specify the message string in plain text or in Speech Synthesis Markup Language (SSML). Attributes<br />are documented under <a href=\"#message\">message</a>.</li><li><code>response_card</code> - (Optional) The response card. Amazon Lex will substitute session attributes and<br />slot values into the response card. For more information, see<br /><a href=\"https://docs.aws.amazon.com/lex/latest/dg/ex-resp-card.html\">Example: Using a Response Card</a>.</li></ul>", "timeouts": "<h2 id=\"timeouts\">Timeouts</h2><p><a href=\"https://developer.hashicorp.com/terraform/language/resources/syntax#operation-timeouts\">Configuration options</a>:</p><ul><li><code>create</code> - (Default <code>5m</code>)</li><li><code>update</code> - (Default <code>5m</code>)</li><li><code>delete</code> - (Default <code>5m</code>)</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute Reference</h2><p>This resource exports the following attributes in addition to the arguments above:</p><ul><li><code>checksum</code> - Checksum identifying the version of the bot that was created. The checksum is not<br />included as an argument because the resource will add it automatically when updating the bot.</li><li><code>created_date</code> - The date when the bot version was created.</li><li><code>failure_reason</code> - If status is FAILED, Amazon Lex provides the reason that it failed to build the bot.</li><li><code>last_updated_date</code> - The date when the $LATEST version of this bot was updated.</li><li><code>status</code> - When you send a request to create or update a bot, Amazon Lex sets the status response<br />element to BUILDING. After Amazon Lex builds the bot, it sets status to READY. If Amazon Lex can't<br />build the bot, it sets status to FAILED. Amazon Lex returns the reason for the failure in the<br />failure_reason response element.</li><li><code>version</code> - The version of the bot.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>In Terraform v1.5.0 and later, use an <a href=\"https://developer.hashicorp.com/terraform/language/import\"><code>import</code> block</a> to import bots using their name. For example:</p><p><code>terraformimport {  to = aws_lex_bot.order_flowers_bot  id = \"OrderFlowers\"}</code></p><p>Using <code>terraform import</code>, import bots using their name. For example:</p><p><code>console% terraform import aws_lex_bot.order_flowers_bot OrderFlowers</code></p>", "description": "<h1 id=\"resource-aws_lex_bot\">Resource: aws_lex_bot</h1><p>Provides an Amazon Lex Bot resource. For more information see<br /><a href=\"https://docs.aws.amazon.com/lex/latest/dg/how-it-works.html\">Amazon Lex: How It Works</a></p>"}