{"resource-aws-macie2-classification-job": "<h1 id=\"resource-aws_macie2_classification_job\">Resource: aws_macie2_classification_job</h1><p>Provides a resource to manage an <a href=\"https://docs.aws.amazon.com/macie/latest/APIReference/jobs.html\">AWS Macie Classification Job</a>.</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p>terraform<br />resource \"aws_macie2_account\" \"test\" {}</p><p>resource \"aws_macie2_classification_job\" \"test\" {<br />  job_type = \"ONE_TIME\"<br />  name     = \"NAME OF THE CLASSIFICATION JOB\"<br />  s3_job_definition {<br />    bucket_definitions {<br />      account_id = \"ACCOUNT ID\"<br />      buckets    = [\"S3 BUCKET NAME\"]<br />    }<br />  }<br />  depends_on = [aws_macie2_account.test]<br />}<br /></p>", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>This resource supports the following arguments:</p><ul><li><code>schedule_frequency</code> -  (Optional) The recurrence pattern for running the job. To run the job only once, don't specify a value for this property and set the value for the <code>job_type</code> property to <code>ONE_TIME</code>. (documented below)</li><li><code>custom_data_identifier_ids</code> -  (Optional) The custom data identifiers to use for data analysis and classification.</li><li><code>sampling_percentage</code> -  (Optional) The sampling depth, as a percentage, to apply when processing objects. This value determines the percentage of eligible objects that the job analyzes. If this value is less than 100, Amazon Macie selects the objects to analyze at random, up to the specified percentage, and analyzes all the data in those objects.</li><li><code>name</code> -  (Optional) A custom name for the job. The name can contain as many as 500 characters. If omitted, Terraform will assign a random, unique name. Conflicts with <code>name_prefix</code>.</li><li><code>name_prefix</code> -  (Optional) Creates a unique name beginning with the specified prefix. Conflicts with <code>name</code>.</li><li><code>description</code> -  (Optional) A custom description of the job. The description can contain as many as 200 characters.</li><li><code>initial_run</code> -  (Optional) Specifies whether to analyze all existing, eligible objects immediately after the job is created.</li><li><code>job_type</code> -  (Required) The schedule for running the job. Valid values are: <code>ONE_TIME</code> - Run the job only once. If you specify this value, don't specify a value for the <code>schedule_frequency</code> property. <code>SCHEDULED</code> - Run the job on a daily, weekly, or monthly basis. If you specify this value, use the <code>schedule_frequency</code> property to define the recurrence pattern for the job.</li><li><code>s3_job_definition</code> -  (Optional) The S3 buckets that contain the objects to analyze, and the scope of that analysis. (documented below)</li><li><code>tags</code> -  (Optional) A map of key-value pairs that specifies the tags to associate with the job. A job can have a maximum of 50 tags. Each tag consists of a tag key and an associated tag value. The maximum length of a tag key is 128 characters. The maximum length of a tag value is 256 characters.</li><li><code>job_status</code> -  (Optional) The status for the job. Valid values are: <code>CANCELLED</code>, <code>RUNNING</code> and <code>USER_PAUSED</code></li></ul><p>The <code>schedule_frequency</code> object supports the following:</p><ul><li><code>daily_schedule</code> -  (Optional) Specifies a daily recurrence pattern for running the job.</li><li><code>weekly_schedule</code> -  (Optional) Specifies a weekly recurrence pattern for running the job.</li><li><code>monthly_schedule</code> -  (Optional) Specifies a monthly recurrence pattern for running the job.</li></ul><p>The <code>s3_job_definition</code> object supports the following:</p><ul><li><code>bucket_criteria</code> - (Optional) The property- and tag-based conditions that determine which S3 buckets to include or exclude from the analysis. Conflicts with <code>bucket_definitions</code>. (documented below)</li><li><code>bucket_definitions</code> -  (Optional) An array of objects, one for each AWS account that owns buckets to analyze. Each object specifies the account ID for an account and one or more buckets to analyze for the account. Conflicts with <code>bucket_criteria</code>. (documented below)</li><li><code>scoping</code> -  (Optional) The property- and tag-based conditions that determine which objects to include or exclude from the analysis. (documented below)</li></ul><h3 id=\"bucket_criteria-configuration-block\">bucket_criteria Configuration Block</h3><p>The <code>bucket_criteria</code> object supports the following:</p><ul><li><code>excludes</code> -  (Optional) The property- or tag-based conditions that determine which S3 buckets to exclude from the analysis. (documented below)</li><li><code>includes</code> -  (Optional) The property- or tag-based conditions that determine which S3 buckets to include in the analysis. (documented below)</li></ul><p>The <code>excludes</code> and <code>includes</code> object supports the following:</p><ul><li><code>and</code> -  (Optional) An array of conditions, one for each condition that determines which S3 buckets to include or exclude from the job. (documented below)</li></ul><p>The <code>and</code> object supports the following:</p><ul><li><code>simple_criterion</code> -  (Optional) A property-based condition that defines a property, operator, and one or more values for including or excluding an S3 buckets from the job. (documented below)</li><li><code>tag_criterion</code> -  (Optional) A tag-based condition that defines the operator and tag keys or tag key and value pairs for including or excluding an S3 buckets from the job. (documented below)</li></ul><p>The <code>simple_criterion</code> object supports the following:</p><ul><li><code>comparator</code> -  (Required) The operator to use in a condition. Valid combination of values are available in the <a href=\"https://docs.aws.amazon.com/macie/latest/APIReference/jobs.html#jobs-model-jobcomparator\">AWS Documentation</a></li><li><code>key</code> -  (Required) The object property to use in the condition. Valid combination of values are available in the <a href=\"https://docs.aws.amazon.com/macie/latest/APIReference/jobs.html#jobs-model-simplecriterionkeyforjob\">AWS Documentation</a></li><li><code>values</code> -  (Required) An array that lists the values to use in the condition. Valid combination of values are available in the <a href=\"https://docs.aws.amazon.com/macie/latest/APIReference/jobs.html#jobs-model-simplecriterionforjob\">AWS Documentation</a></li></ul><p>The <code>tag_criterion</code> object supports the following:</p><ul><li><code>comparator</code> -  (Required) The operator to use in the condition. Valid combination and values are available in the <a href=\"https://docs.aws.amazon.com/macie/latest/APIReference/jobs.html#jobs-model-jobcomparator\">AWS Documentation</a></li><li><code>tag_values</code> -  (Required) The  tag key and value pairs to use in the condition. One or more blocks are allowed. (documented below)</li></ul><p>The <code>tag_values</code> object supports the following:</p><ul><li><code>key</code> - (Required) The tag key.</li><li><code>value</code> - (Required) The tag value.</li></ul><h3 id=\"bucket_definitions-configuration-block\">bucket_definitions Configuration Block</h3><p>The <code>bucket_definitions</code> object supports the following:</p><ul><li><code>account_id</code> -  (Required) The unique identifier for the AWS account that owns the buckets.</li><li><code>buckets</code> -  (Required) An array that lists the names of the buckets.</li></ul><h3 id=\"scoping-configuration-block\">scoping Configuration Block</h3><p>The <code>scoping</code> object supports the following:</p><ul><li><code>excludes</code> -  (Optional) The property- or tag-based conditions that determine which objects to exclude from the analysis. (documented below)</li><li><code>includes</code> -  (Optional) The property- or tag-based conditions that determine which objects to include in the analysis. (documented below)</li></ul><p>The <code>excludes</code> and <code>includes</code> object supports the following:</p><ul><li><code>and</code> -  (Optional) An array of conditions, one for each condition that determines which objects to include or exclude from the job. (documented below)</li></ul><p>The <code>and</code> object supports the following:</p><ul><li><code>simple_scope_term</code> -  (Optional) A property-based condition that defines a property, operator, and one or more values for including or excluding an object from the job. (documented below)</li><li><code>tag_scope_term</code> -  (Optional) A tag-based condition that defines the operator and tag keys or tag key and value pairs for including or excluding an object from the job. (documented below)</li></ul><p>The <code>simple_scope_term</code> object supports the following:</p><ul><li><code>comparator</code> -  (Optional) The operator to use in a condition. Valid values are: <code>EQ</code>, <code>GT</code>, <code>GTE</code>, <code>LT</code>, <code>LTE</code>, <code>NE</code>, <code>CONTAINS</code>, <code>STARTS_WITH</code></li><li><code>values</code> -  (Optional) An array that lists the values to use in the condition.</li><li><code>key</code> -  (Optional) The object property to use in the condition.</li></ul><p>The <code>tag_scope_term</code> object supports the following:</p><ul><li><code>comparator</code> -  (Optional) The operator to use in the condition.</li><li><code>tag_values</code> -  (Optional) The tag keys or tag key and value pairs to use in the condition.</li><li><code>key</code> -  (Required) The tag key to use in the condition. The only valid value is <code>TAG</code>.</li><li><code>target</code> -  (Required) The type of object to apply the condition to. The only valid value is <code>S3_OBJECT</code>.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute Reference</h2><p>This resource exports the following attributes in addition to the arguments above:</p><ul><li><code>id</code> - The unique identifier (ID) of the macie classification job.</li><li><code>created_at</code> -  The date and time, in UTC and extended RFC 3339 format, when the job was created.</li><li><code>user_paused_details</code> - If the current status of the job is <code>USER_PAUSED</code>, specifies when the job was paused and when the job or job run will expire and be cancelled if it isn't resumed. This value is present only if the value for <code>job-status</code> is <code>USER_PAUSED</code>.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>In Terraform v1.5.0 and later, use an <a href=\"https://developer.hashicorp.com/terraform/language/import\"><code>import</code> block</a> to import <code>aws_macie2_classification_job</code> using the id. For example:</p><p><code>terraformimport {  to = aws_macie2_classification_job.example  id = \"abcd1\"}</code></p><p>Using <code>terraform import</code>, import <code>aws_macie2_classification_job</code> using the id. For example:</p><p><code>console% terraform import aws_macie2_classification_job.example abcd1</code></p>", "description": "<h1 id=\"resource-aws_macie2_classification_job\">Resource: aws_macie2_classification_job</h1><p>Provides a resource to manage an <a href=\"https://docs.aws.amazon.com/macie/latest/APIReference/jobs.html\">AWS Macie Classification Job</a>.</p>"}