{"resource-aws-network-interface": "<h1 id=\"resource-aws_network_interface\">Resource: aws_network_interface</h1><p>Provides an Elastic network interface (ENI) resource.</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p>terraform<br />resource \"aws_network_interface\" \"test\" {<br />  subnet_id       = aws_subnet.public_a.id<br />  private_ips     = [\"10.0.0.50\"]<br />  security_groups = [aws_security_group.web.id]</p><p>attachment {<br />    instance     = aws_instance.test.id<br />    device_index = 1<br />  }<br />}<br /></p><h3 id=\"example-of-managing-multiple-ips-on-a-network-interface\">Example of Managing Multiple IPs on a Network Interface</h3><p>By default, private IPs are managed through the <code>private_ips</code> and <code>private_ips_count</code> arguments which manage IPs as a set of IPs that are configured without regard to order. For a new network interface, the same primary IP address is consistently selected from a given set of addresses, regardless of the order provided. However, modifications of the set of addresses of an existing interface will not alter the current primary IP address unless it has been removed from the set.</p><p>In order to manage the private IPs as a sequentially ordered list, configure <code>private_ip_list_enabled</code> to <code>true</code> and use <code>private_ip_list</code> to manage the IPs. This will disable the <code>private_ips</code> and <code>private_ips_count</code> settings, which must be removed from the config file but are still exported. Note that changing the first address of <code>private_ip_list</code>, which is the primary, always requires a new interface.</p><p>If you are managing a specific set or list of IPs, instead of just using <code>private_ips_count</code>, this is a potential workflow for also leveraging <code>private_ips_count</code> to have AWS automatically assign additional IP addresses:</p><ol><li>Comment out <code>private_ips</code>, <code>private_ip_list</code>, <code>private_ip_list_enabled</code> in your configuration</li><li>Set the desired <code>private_ips_count</code> (count of the number of secondaries, the primary is not included)</li><li>Apply to assign the extra IPs</li><li>Remove <code>private_ips_count</code> and restore your settings from the first step</li><li>Add the new IPs to your current settings</li><li>Apply again to update the stored state</li></ol><p>This process can also be used to remove IP addresses in addition to the option of manually removing them. Adding IP addresses in a manually is more difficult because it requires knowledge of which addresses are available.</p>", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>The following arguments are required:</p><ul><li><code>subnet_id</code> - (Required) Subnet ID to create the ENI in.</li></ul><p>The following arguments are optional:</p><ul><li><code>attachment</code> - (Optional) Configuration block to define the attachment of the ENI. See <a href=\"#attachment\">Attachment</a> below for more details!</li><li><code>description</code> - (Optional) Description for the network interface.</li><li><code>interface_type</code> - (Optional) Type of network interface to create. Set to <code>efa</code> for Elastic Fabric Adapter. Changing <code>interface_type</code> will cause the resource to be destroyed and re-created.</li><li><code>ipv4_prefix_count</code> - (Optional) Number of IPv4 prefixes that AWS automatically assigns to the network interface.</li><li><code>ipv4_prefixes</code> - (Optional) One or more IPv4 prefixes assigned to the network interface.</li><li><code>ipv6_address_count</code> - (Optional) Number of IPv6 addresses to assign to a network interface. You can't use this option if specifying specific <code>ipv6_addresses</code>. If your subnet has the AssignIpv6AddressOnCreation attribute set to <code>true</code>, you can specify <code>0</code> to override this setting.</li><li><code>ipv6_address_list_enabled</code> - (Optional) Whether <code>ipv6_address_list</code> is allowed and controls the IPs to assign to the ENI and <code>ipv6_addresses</code> and <code>ipv6_address_count</code> become read-only. Default false.</li><li><code>ipv6_address_list</code> - (Optional) List of private IPs to assign to the ENI in sequential order.</li><li><code>ipv6_addresses</code> - (Optional) One or more specific IPv6 addresses from the IPv6 CIDR block range of your subnet. Addresses are assigned without regard to order. You can't use this option if you're specifying <code>ipv6_address_count</code>.</li><li><code>ipv6_prefix_count</code> - (Optional) Number of IPv6 prefixes that AWS automatically assigns to the network interface.</li><li><code>ipv6_prefixes</code> - (Optional) One or more IPv6 prefixes assigned to the network interface.</li><li><code>private_ip_list</code> - (Optional) List of private IPs to assign to the ENI in sequential order. Requires setting <code>private_ip_list_enabled</code> to <code>true</code>.</li><li><code>private_ip_list_enabled</code> - (Optional) Whether <code>private_ip_list</code> is allowed and controls the IPs to assign to the ENI and <code>private_ips</code> and <code>private_ips_count</code> become read-only. Default false.</li><li><code>private_ips</code> - (Optional) List of private IPs to assign to the ENI without regard to order.</li><li><code>private_ips_count</code> - (Optional) Number of secondary private IPs to assign to the ENI. The total number of private IPs will be 1 + <code>private_ips_count</code>, as a primary private IP will be assiged to an ENI by default.</li><li><code>security_groups</code> - (Optional) List of security group IDs to assign to the ENI.</li><li><code>source_dest_check</code> - (Optional) Whether to enable source destination checking for the ENI. Default true.</li><li><code>tags</code> - (Optional) Map of tags to assign to the resource. If configured with a provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a> present, tags with matching keys will overwrite those defined at the provider-level.</li></ul><h3 id=\"attachment\">Attachment</h3><p>The <code>attachment</code> block supports the following:</p><ul><li><code>instance</code> - (Required) ID of the instance to attach to.</li><li><code>device_index</code> - (Required) Integer to define the devices index.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute Reference</h2><p>This resource exports the following attributes in addition to the arguments above:</p><ul><li><code>arn</code> - ARN of the network interface.</li><li><code>id</code> - ID of the network interface.</li><li><code>mac_address</code> - MAC address of the network interface.</li><li><code>owner_id</code> - AWS account ID of the owner of the network interface.</li><li><code>private_dns_name</code> - Private DNS name of the network interface (IPv4).</li><li><code>tags_all</code> - Map of tags assigned to the resource, including those inherited from the provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a>.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>In Terraform v1.5.0 and later, use an <a href=\"https://developer.hashicorp.com/terraform/language/import\"><code>import</code> block</a> to import Network Interfaces using the <code>id</code>. For example:</p><p><code>terraformimport {  to = aws_network_interface.test  id = \"eni-e5aa89a3\"}</code></p><p>Using <code>terraform import</code>, import Network Interfaces using the <code>id</code>. For example:</p><p><code>console% terraform import aws_network_interface.test eni-e5aa89a3</code></p>", "description": "<h1 id=\"resource-aws_network_interface\">Resource: aws_network_interface</h1><p>Provides an Elastic network interface (ENI) resource.</p>"}