{"resource-aws-opsworks-custom-layer": "<h1 id=\"resource-aws_opsworks_custom_layer\">Resource: aws_opsworks_custom_layer</h1><p>Provides an OpsWorks custom layer resource.</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p>terraform<br />resource \"aws_opsworks_custom_layer\" \"custlayer\" {<br />  name       = \"My Awesome Custom Layer\"<br />  short_name = \"awesome\"<br />  stack_id   = aws_opsworks_stack.main.id<br />}</p><br />", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>This resource supports the following arguments:</p><ul><li><code>name</code> - (Required) A human-readable name for the layer.</li><li><code>short_name</code> - (Required) A short, machine-readable name for the layer, which will be used to identify it in the Chef node JSON.</li><li><code>stack_id</code> - (Required) ID of the stack the layer will belong to.</li><li><code>auto_assign_elastic_ips</code> - (Optional) Whether to automatically assign an elastic IP address to the layer's instances.</li><li><code>auto_assign_public_ips</code> - (Optional) For stacks belonging to a VPC, whether to automatically assign a public IP address to each of the layer's instances.</li><li><code>cloudwatch_configuration</code> - (Optional) Will create an EBS volume and connect it to the layer's instances. See <a href=\"#cloudwatch-configuration\">Cloudwatch Configuration</a>.</li><li><code>custom_instance_profile_arn</code> - (Optional) The ARN of an IAM profile that will be used for the layer's instances.</li><li><code>custom_security_group_ids</code> - (Optional) Ids for a set of security groups to apply to the layer's instances.</li><li><code>auto_healing</code> - (Optional) Whether to enable auto-healing for the layer.</li><li><code>install_updates_on_boot</code> - (Optional) Whether to install OS and package updates on each instance when it boots.</li><li><code>instance_shutdown_timeout</code> - (Optional) The time, in seconds, that OpsWorks will wait for Chef to complete after triggering the Shutdown event.</li><li><code>elastic_load_balancer</code> - (Optional) Name of an Elastic Load Balancer to attach to this layer</li><li><code>drain_elb_on_shutdown</code> - (Optional) Whether to enable Elastic Load Balancing connection draining.</li><li><code>load_based_auto_scaling</code> - (Optional) Load-based auto scaling configuration. See <a href=\"#load-based-autoscaling\">Load Based AutoScaling</a></li><li><code>system_packages</code> - (Optional) Names of a set of system packages to install on the layer's instances.</li><li><code>use_ebs_optimized_instances</code> - (Optional) Whether to use EBS-optimized instances.</li><li><code>ebs_volume</code> - (Optional) Will create an EBS volume and connect it to the layer's instances. See <a href=\"#ebs-volume\">EBS Volume</a>.</li><li><code>custom_json</code> - (Optional) Custom JSON attributes to apply to the layer.</li><li><code>tags</code> - (Optional) A map of tags to assign to the resource. If configured with a provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a> present, tags with matching keys will overwrite those defined at the provider-level.</li></ul><p>The following extra optional arguments, all lists of Chef recipe names, allow<br />custom Chef recipes to be applied to layer instances at the five different<br />lifecycle events, if custom cookbooks are enabled on the layer's stack:</p><ul><li><code>custom_configure_recipes</code></li><li><code>custom_deploy_recipes</code></li><li><code>custom_setup_recipes</code></li><li><code>custom_shutdown_recipes</code></li><li><code>custom_undeploy_recipes</code></li></ul><h3 id=\"ebs-volume\">EBS Volume</h3><ul><li><code>mount_point</code> - (Required) The path to mount the EBS volume on the layer's instances.</li><li><code>size</code> - (Required) The size of the volume in gigabytes.</li><li><code>number_of_disks</code> - (Required) The number of disks to use for the EBS volume.</li><li><code>raid_level</code> - (Required) The RAID level to use for the volume.</li><li><code>type</code> - (Optional) The type of volume to create. This may be <code>standard</code> (the default), <code>io1</code> or <code>gp2</code>.</li><li><code>iops</code> - (Optional) For PIOPS volumes, the IOPS per disk.</li><li><code>encrypted</code> - (Optional) Encrypt the volume.</li></ul><h3 id=\"cloudwatch-configuration\">Cloudwatch Configuration</h3><ul><li><code>enabled</code> - (Optional)</li><li><code>log_streams</code> - (Optional) A block the specifies how an opsworks logs look like. See <a href=\"#log-streams\">Log Streams</a>.</li></ul><h4 id=\"log-streams\">Log Streams</h4><ul><li><code>file</code> - (Required) Specifies log files that you want to push to CloudWatch Logs. File can point to a specific file or multiple files (by using wild card characters such as /var/log/system.log*).</li><li><code>log_group_name</code> - (Required) Specifies the destination log group. A log group is created automatically if it doesn't already exist.</li><li><code>batch_count</code> - (Optional) Specifies the max number of log events in a batch, up to <code>10000</code>. The default value is <code>1000</code>.</li><li><code>batch_size</code> - (Optional) Specifies the maximum size of log events in a batch, in bytes, up to <code>1048576</code> bytes. The default value is <code>32768</code> bytes.</li><li><code>buffer_duration</code> - (Optional) Specifies the time duration for the batching of log events. The minimum value is <code>5000</code> and default value is <code>5000</code>.</li><li><code>datetime_format</code> - (Optional) Specifies how the timestamp is extracted from logs. For more information, see the CloudWatch Logs Agent Reference (https://docs.aws.amazon.com/AmazonCloudWatch/latest/logs/AgentReference.html).</li><li><code>encoding</code> - (Optional) Specifies the encoding of the log file so that the file can be read correctly. The default is <code>utf_8</code>.</li><li><code>file_fingerprint_lines</code> - (Optional) Specifies the range of lines for identifying a file. The valid values are one number, or two dash-delimited numbers, such as <code>1</code>, <code>2-5</code>. The default value is <code>1</code>.</li><li><code>initial_position</code> - (Optional) Specifies where to start to read data (<code>start_of_file</code> or <code>end_of_file</code>). The default is <code>start_of_file</code>.</li><li><code>multiline_start_pattern</code> - (Optional) Specifies the pattern for identifying the start of a log message.</li><li><code>time_zone</code> - (Optional) Specifies the time zone of log event time stamps.</li></ul><h3 id=\"load-based-autoscaling\">Load Based Autoscaling</h3><ul><li><code>downscaling</code> - (Optional) The downscaling settings, as defined below, used for load-based autoscaling</li><li><code>enable</code> - (Optional) Whether load-based auto scaling is enabled for the layer.</li><li><code>upscaling</code> - (Optional) The upscaling settings, as defined below, used for load-based autoscaling</li></ul><p>The <code>downscaling</code> and <code>upscaling</code> blocks supports the following arguments:</p><p>Though the three thresholds are optional, at least one threshold must be set when using load-based autoscaling.</p><ul><li><code>alarms</code> - (Optional) Custom Cloudwatch auto scaling alarms, to be used as thresholds. This parameter takes a list of up to five alarm names, which are case sensitive and must be in the same region as the stack.</li><li><code>cpu_threshold</code> - (Optional) The CPU utilization threshold, as a percent of the available CPU. A value of -1 disables the threshold.</li><li><code>ignore_metrics_time</code> - (Optional) The amount of time (in minutes) after a scaling event occurs that AWS OpsWorks Stacks should ignore metrics and suppress additional scaling events.</li><li><code>instance_count</code> - (Optional) The number of instances to add or remove when the load exceeds a threshold.</li><li><code>load_threshold</code> - (Optional) The load threshold. A value of -1 disables the threshold.</li><li><code>memory_threshold</code> - (Optional) The memory utilization threshold, as a percent of the available memory. A value of -1 disables the threshold.</li><li><code>thresholds_wait_time</code> - (Optional) The amount of time, in minutes, that the load must exceed a threshold before more instances are added or removed.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute Reference</h2><p>This resource exports the following attributes in addition to the arguments above:</p><ul><li><code>id</code> - The id of the layer.</li><li><code>arn</code> - The Amazon Resource Name(ARN) of the layer.</li><li><code>tags_all</code> - A map of tags assigned to the resource, including those inherited from the provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a>.</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>In Terraform v1.5.0 and later, use an <a href=\"https://developer.hashicorp.com/terraform/language/import\"><code>import</code> block</a> to import OpsWorks Custom Layers using the <code>id</code>. For example:</p><p>terraform<br />import {<br />  to = aws_opsworks_custom_layer.bar<br />  id = \"00000000-0000-0000-0000-000000000000\"<br />}</p><p>Using <code>terraform import</code>, import OpsWorks Custom Layers using the <code>id</code>. For example:</p><p>console<br />% terraform import aws_opsworks_custom_layer.bar 00000000-0000-0000-0000-000000000000</p>", "description": "<h1 id=\"resource-aws_opsworks_custom_layer\">Resource: aws_opsworks_custom_layer</h1><p>Provides an OpsWorks custom layer resource.</p>"}