{"resource-aws-redshift-cluster": "<h1 id=\"resource-aws_redshift_cluster\">Resource: aws_redshift_cluster</h1><p>Provides a Redshift Cluster Resource.</p><p>~&gt; <strong>Note:</strong> All arguments including the username and password will be stored in the raw state as plain-text.<br /><a href=\"https://www.terraform.io/docs/state/sensitive-data.html\">Read more about sensitive data in state</a>.</p><p>~&gt; <strong>NOTE:</strong> A Redshift cluster's default IAM role can be managed both by this resource's <code>default_iam_role_arn</code> argument and the <a href=\"redshift_cluster_iam_roles.html\"><code>aws_redshift_cluster_iam_roles</code></a> resource's <code>default_iam_role_arn</code> argument. Do not configure different values for both arguments. Doing so will cause a conflict of default IAM roles.</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p><code>terraformresource \"aws_redshift_cluster\" \"example\" {  cluster_identifier = \"tf-redshift-cluster\"  database_name      = \"mydb\"  master_username    = \"exampleuser\"  master_password    = \"Mustbe8characters\"  node_type          = \"dc1.large\"  cluster_type       = \"single-node\"}</code></p>", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>For more detailed documentation about each argument, refer to<br />the <a href=\"http://docs.aws.amazon.com/cli/latest/reference/redshift/index.html#cli-aws-redshift\">AWS official documentation</a>.</p><p>This argument supports the following arguments:</p><ul><li><code>cluster_identifier</code> - (Required) The Cluster Identifier. Must be a lower case string.</li><li><code>database_name</code> - (Optional) The name of the first database to be created when the cluster is created.<br />  If you do not provide a name, Amazon Redshift will create a default database called <code>dev</code>.</li><li><code>default_iam_role_arn</code> - (Optional) The Amazon Resource Name (ARN) for the IAM role that was set as default for the cluster when the cluster was created.</li><li><code>node_type</code> - (Required) The node type to be provisioned for the cluster.</li><li><code>cluster_type</code> - (Optional) The cluster type to use. Either <code>single-node</code> or <code>multi-node</code>.</li><li><code>master_password</code> - (Required unless a <code>snapshot_identifier</code> is provided) Password for the master DB user.<br />  Note that this may show up in logs, and it will be stored in the state file. Password must contain at least 8 chars and<br />  contain at least one uppercase letter, one lowercase letter, and one number.</li><li><code>master_username</code> - (Required unless a <code>snapshot_identifier</code> is provided) Username for the master DB user.</li><li><code>vpc_security_group_ids</code> - (Optional) A list of Virtual Private Cloud (VPC) security groups to be associated with the cluster.</li><li><code>cluster_subnet_group_name</code> - (Optional) The name of a cluster subnet group to be associated with this cluster. If this parameter is not provided the resulting cluster will be deployed outside virtual private cloud (VPC).</li><li><code>availability_zone</code> - (Optional) The EC2 Availability Zone (AZ) in which you want Amazon Redshift to provision the cluster. For example, if you have several EC2 instances running in a specific Availability Zone, then you might want the cluster to be provisioned in the same zone in order to decrease network latency. Can only be changed if <code>availability_zone_relocation_enabled</code> is <code>true</code>.</li><li><code>availability_zone_relocation_enabled</code> - (Optional) If true, the cluster can be relocated to another availabity zone, either automatically by AWS or when requested. Default is <code>false</code>. Available for use on clusters from the RA3 instance family.</li><li><code>preferred_maintenance_window</code> - (Optional) The weekly time range (in UTC) during which automated cluster maintenance can occur.<br />  Format: ddd:hh24:mi-ddd:hh24:mi</li><li><code>cluster_parameter_group_name</code> - (Optional) The name of the parameter group to be associated with this cluster.</li><li><code>automated_snapshot_retention_period</code> - (Optional) The number of days that automated snapshots are retained. If the value is 0, automated snapshots are disabled. Even if automated snapshots are disabled, you can still create manual snapshots when you want with create-cluster-snapshot. Default is 1.</li><li><code>port</code> - (Optional) The port number on which the cluster accepts incoming connections. Valid values are between <code>1115</code> and <code>65535</code>.<br />  The cluster is accessible only via the JDBC and ODBC connection strings.<br />  Part of the connection string requires the port on which the cluster will listen for incoming connections.<br />  Default port is <code>5439</code>.</li><li><code>cluster_version</code> - (Optional) The version of the Amazon Redshift engine software that you want to deploy on the cluster.<br />  The version selected runs on all the nodes in the cluster.</li><li><code>allow_version_upgrade</code> - (Optional) If true , major version upgrades can be applied during the maintenance window to the Amazon Redshift engine that is running on the cluster. Default is <code>true</code>.</li><li><code>apply_immediately</code> - (Optional) Specifies whether any cluster modifications are applied immediately, or during the next maintenance window. Default is <code>false</code>.</li><li><code>aqua_configuration_status</code> - (Optional, <strong>Deprecated</strong>) The value represents how the cluster is configured to use AQUA (Advanced Query Accelerator) after the cluster is restored.<br />  No longer supported by the AWS API.<br />  Always returns <code>auto</code>.</li><li><code>number_of_nodes</code> - (Optional) The number of compute nodes in the cluster. This parameter is required when the ClusterType parameter is specified as multi-node. Default is 1.</li><li><code>publicly_accessible</code> - (Optional) If true, the cluster can be accessed from a public network. Default is <code>true</code>.</li><li><code>encrypted</code> - (Optional) If true , the data in the cluster is encrypted at rest.</li><li><code>enhanced_vpc_routing</code> - (Optional) If true , enhanced VPC routing is enabled.</li><li><code>kms_key_id</code> - (Optional) The ARN for the KMS encryption key. When specifying <code>kms_key_id</code>, <code>encrypted</code> needs to be set to true.</li><li><code>elastic_ip</code> - (Optional) The Elastic IP (EIP) address for the cluster.</li><li><code>skip_final_snapshot</code> - (Optional) Determines whether a final snapshot of the cluster is created before Amazon Redshift deletes the cluster. If true , a final cluster snapshot is not created. If false , a final cluster snapshot is created before the cluster is deleted. Default is false.</li><li><code>final_snapshot_identifier</code> - (Optional) The identifier of the final snapshot that is to be created immediately before deleting the cluster. If this parameter is provided, <code>skip_final_snapshot</code> must be false.</li><li><code>snapshot_identifier</code> - (Optional) The name of the snapshot from which to create the new cluster.</li><li><code>snapshot_cluster_identifier</code> - (Optional) The name of the cluster the source snapshot was created from.</li><li><code>owner_account</code> - (Optional) The AWS customer account used to create or copy the snapshot. Required if you are restoring a snapshot you do not own, optional if you own the snapshot.</li><li><code>iam_roles</code> - (Optional) A list of IAM Role ARNs to associate with the cluster. A Maximum of 10 can be associated to the cluster at any time.</li><li><code>logging</code> - (Optional) Logging, documented below.</li><li><code>maintenance_track_name</code> - (Optional) The name of the maintenance track for the restored cluster. When you take a snapshot, the snapshot inherits the MaintenanceTrack value from the cluster. The snapshot might be on a different track than the cluster that was the source for the snapshot. For example, suppose that you take a snapshot of  a cluster that is on the current track and then change the cluster to be on the trailing track. In this case, the snapshot and the source cluster are on different tracks. Default value is <code>current</code>.</li><li><code>manual_snapshot_retention_period</code> - (Optional)  The default number of days to retain a manual snapshot. If the value is -1, the snapshot is retained indefinitely. This setting doesn't change the retention period of existing snapshots. Valid values are between <code>-1</code> and <code>3653</code>. Default value is <code>-1</code>.</li><li><code>snapshot_copy</code> - (Optional) Configuration of automatic copy of snapshots from one region to another. Documented below.</li><li><code>tags</code> - (Optional) A map of tags to assign to the resource. If configured with a provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a> present, tags with matching keys will overwrite those defined at the provider-level.</li></ul><h3 id=\"nested-blocks\">Nested Blocks</h3><h4 id=\"logging\"><code>logging</code></h4><ul><li><code>enable</code> - (Required) Enables logging information such as queries and connection attempts, for the specified Amazon Redshift cluster.</li><li><code>bucket_name</code> - (Optional, required when <code>enable</code> is <code>true</code> and <code>log_destination_type</code> is <code>s3</code>) The name of an existing S3 bucket where the log files are to be stored. Must be in the same region as the cluster and the cluster must have read bucket and put object permissions.<br />For more information on the permissions required for the bucket, please read the AWS <a href=\"http://docs.aws.amazon.com/redshift/latest/mgmt/db-auditing.html#db-auditing-enable-logging\">documentation</a></li><li><code>s3_key_prefix</code> - (Optional) The prefix applied to the log file names.</li><li><code>log_destination_type</code> - (Optional) The log destination type. An enum with possible values of <code>s3</code> and <code>cloudwatch</code>.</li><li><code>log_exports</code> - (Optional) The collection of exported log types. Log types include the connection log, user log and user activity log. Required when <code>log_destination_type</code> is <code>cloudwatch</code>. Valid log types are <code>connectionlog</code>, <code>userlog</code>, and <code>useractivitylog</code>.</li></ul><h4 id=\"snapshot_copy\"><code>snapshot_copy</code></h4><ul><li><code>destination_region</code> - (Required) The destination region that you want to copy snapshots to.</li><li><code>retention_period</code> - (Optional) The number of days to retain automated snapshots in the destination region after they are copied from the source region. Defaults to <code>7</code>.</li><li><code>grant_name</code> - (Optional) The name of the snapshot copy grant to use when snapshots of an AWS KMS-encrypted cluster are copied to the destination region.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute Reference</h2><p>This resource exports the following attributes in addition to the arguments above:</p><ul><li><code>arn</code> - Amazon Resource Name (ARN) of cluster</li><li><code>id</code> - The Redshift Cluster ID.</li><li><code>cluster_identifier</code> - The Cluster Identifier</li><li><code>cluster_type</code> - The cluster type</li><li><code>node_type</code> - The type of nodes in the cluster</li><li><code>database_name</code> - The name of the default database in the Cluster</li><li><code>availability_zone</code> - The availability zone of the Cluster</li><li><code>automated_snapshot_retention_period</code> - The backup retention period</li><li><code>preferred_maintenance_window</code> - The backup window</li><li><code>endpoint</code> - The connection endpoint</li><li><code>encrypted</code> - Whether the data in the cluster is encrypted</li><li><code>vpc_security_group_ids</code> - The VPC security group Ids associated with the cluster</li><li><code>dns_name</code> - The DNS name of the cluster</li><li><code>port</code> - The Port the cluster responds on</li><li><code>cluster_version</code> - The version of Redshift engine software</li><li><code>cluster_parameter_group_name</code> - The name of the parameter group to be associated with this cluster</li><li><code>cluster_subnet_group_name</code> - The name of a cluster subnet group to be associated with this cluster</li><li><code>cluster_public_key</code> - The public key for the cluster</li><li><code>cluster_revision_number</code> - The specific revision number of the database in the cluster</li><li><code>cluster_nodes</code> - The nodes in the cluster. Cluster node blocks are documented below</li><li><code>cluster_namespace_arn</code> - The namespace Amazon Resource Name (ARN) of the cluster</li><li><code>tags_all</code> - A map of tags assigned to the resource, including those inherited from the provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a>.</li></ul><p>Cluster nodes (for <code>cluster_nodes</code>) support the following attributes:</p><ul><li><code>node_role</code> - Whether the node is a leader node or a compute node</li><li><code>private_ip_address</code> - The private IP address of a node within a cluster</li><li><code>public_ip_address</code> - The public IP address of a node within a cluster</li></ul>", "timeouts": "<h2 id=\"timeouts\">Timeouts</h2><p><a href=\"https://developer.hashicorp.com/terraform/language/resources/syntax#operation-timeouts\">Configuration options</a>:</p><ul><li><code>create</code> - (Default <code>75m</code>)</li><li><code>update</code> - (Default <code>75m</code>)</li><li><code>delete</code> - (Default <code>40m</code>)</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>In Terraform v1.5.0 and later, use an <a href=\"https://developer.hashicorp.com/terraform/language/import\"><code>import</code> block</a> to import Redshift Clusters using the <code>cluster_identifier</code>. For example:</p><p><code>terraformimport {  to = aws_redshift_cluster.myprodcluster  id = \"tf-redshift-cluster-12345\"}</code></p><p>Using <code>terraform import</code>, import Redshift Clusters using the <code>cluster_identifier</code>. For example:</p><p><code>console% terraform import aws_redshift_cluster.myprodcluster tf-redshift-cluster-12345</code></p>", "description": "<h1 id=\"resource-aws_redshift_cluster\">Resource: aws_redshift_cluster</h1><p>Provides a Redshift Cluster Resource.</p><p>~&gt; <strong>Note:</strong> All arguments including the username and password will be stored in the raw state as plain-text.<br /><a href=\"https://www.terraform.io/docs/state/sensitive-data.html\">Read more about sensitive data in state</a>.</p><p>~&gt; <strong>NOTE:</strong> A Redshift cluster's default IAM role can be managed both by this resource's <code>default_iam_role_arn</code> argument and the <a href=\"redshift_cluster_iam_roles.html\"><code>aws_redshift_cluster_iam_roles</code></a> resource's <code>default_iam_role_arn</code> argument. Do not configure different values for both arguments. Doing so will cause a conflict of default IAM roles.</p>"}