{"resource-aws-s3-object-copy": "<h1 id=\"resource-aws_s3_object_copy\">Resource: aws_s3_object_copy</h1><p>Provides a resource for copying an S3 object.</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><p>terraform<br />resource \"aws_s3_object_copy\" \"test\" {<br />  bucket = \"destination_bucket\"<br />  key    = \"destination_key\"<br />  source = \"source_bucket/source_key\"</p><br /><p>grant {<br />    uri         = \"http://acs.amazonaws.com/groups/global/AllUsers\"<br />    type        = \"Group\"<br />    permissions = [\"READ\"]<br />  }<br />}</p><br />", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>The following arguments are required:</p><ul><li><code>bucket</code> - (Required) Name of the bucket to put the file in.</li><li><code>key</code> - (Required) Name of the object once it is in the bucket.</li><li><code>source</code> - (Required) Specifies the source object for the copy operation. You specify the value in one of two formats. For objects not accessed through an access point, specify the name of the source bucket and the key of the source object, separated by a slash (<code>/</code>). For example, <code>testbucket/test1.json</code>. For objects accessed through access points, specify the ARN of the object as accessed through the access point, in the format <code>arn:aws:s3:&lt;Region&gt;:&lt;account-id&gt;:accesspoint/&lt;access-point-name&gt;/object/&lt;key&gt;</code>. For example, <code>arn:aws:s3:us-west-2:9999912999:accesspoint/my-access-point/object/testbucket/test1.json</code>.</li></ul><p>The following arguments are optional:</p><ul><li><code>acl</code> - (Optional) <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/acl-overview.html#canned-acl\">Canned ACL</a> to apply. Valid values are <code>private</code>, <code>public-read</code>, <code>public-read-write</code>, <code>authenticated-read</code>, <code>aws-exec-read</code>, <code>bucket-owner-read</code>, and <code>bucket-owner-full-control</code>. Conflicts with <code>grant</code>.</li><li><code>cache_control</code> - (Optional) Specifies caching behavior along the request/reply chain Read <a href=\"http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html#sec14.9\">w3c cache_control</a> for further details.</li><li><code>checksum_algorithm</code> - (Optional) Indicates the algorithm used to create the checksum for the object. If a value is specified and the object is encrypted with KMS, you must have permission to use the <code>kms:Decrypt</code> action. Valid values: <code>CRC32</code>, <code>CRC32C</code>, <code>SHA1</code>, <code>SHA256</code>.</li><li><code>content_disposition</code> - (Optional) Specifies presentational information for the object. Read <a href=\"http://www.w3.org/Protocols/rfc2616/rfc2616-sec19.html#sec19.5.1\">w3c content_disposition</a> for further information.</li><li><code>content_encoding</code> - (Optional) Specifies what content encodings have been applied to the object and thus what decoding mechanisms must be applied to obtain the media-type referenced by the Content-Type header field. Read <a href=\"http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html#sec14.11\">w3c content encoding</a> for further information.</li><li><code>content_language</code> - (Optional) Language the content is in e.g., en-US or en-GB.</li><li><code>content_type</code> - (Optional) Standard MIME type describing the format of the object data, e.g., <code>application/octet-stream</code>. All Valid MIME Types are valid for this input.</li><li><code>copy_if_match</code> - (Optional) Copies the object if its entity tag (ETag) matches the specified tag.</li><li><code>copy_if_modified_since</code> - (Optional) Copies the object if it has been modified since the specified time, in <a href=\"https://tools.ietf.org/html/rfc3339#section-5.8\">RFC3339 format</a>.</li><li><code>copy_if_none_match</code> - (Optional) Copies the object if its entity tag (ETag) is different than the specified ETag.</li><li><code>copy_if_unmodified_since</code> - (Optional) Copies the object if it hasn't been modified since the specified time, in <a href=\"https://tools.ietf.org/html/rfc3339#section-5.8\">RFC3339 format</a>.</li><li><code>customer_algorithm</code> - (Optional) Specifies the algorithm to use to when encrypting the object (for example, AES256).</li><li><code>customer_key</code> - (Optional) Specifies the customer-provided encryption key for Amazon S3 to use in encrypting data. This value is used to store the object and then it is discarded; Amazon S3 does not store the encryption key. The key must be appropriate for use with the algorithm specified in the x-amz-server-side-encryption-customer-algorithm header.</li><li><code>customer_key_md5</code> - (Optional) Specifies the 128-bit MD5 digest of the encryption key according to RFC 1321. Amazon S3 uses this header for a message integrity check to ensure that the encryption key was transmitted without error.</li><li><code>expected_bucket_owner</code> - (Optional) Account id of the expected destination bucket owner. If the destination bucket is owned by a different account, the request will fail with an HTTP 403 (Access Denied) error.</li><li><code>expected_source_bucket_owner</code> - (Optional) Account id of the expected source bucket owner. If the source bucket is owned by a different account, the request will fail with an HTTP 403 (Access Denied) error.</li><li><code>expires</code> - (Optional) Date and time at which the object is no longer cacheable, in <a href=\"https://tools.ietf.org/html/rfc3339#section-5.8\">RFC3339 format</a>.</li><li><code>force_destroy</code> - (Optional) Allow the object to be deleted by removing any legal hold on any object version. Default is <code>false</code>. This value should be set to <code>true</code> only if the bucket has S3 object lock enabled.</li><li><code>grant</code> - (Optional) Configuration block for header grants. Documented below. Conflicts with <code>acl</code>.</li><li><code>kms_encryption_context</code> - (Optional) Specifies the AWS KMS Encryption Context to use for object encryption. The value is a base64-encoded UTF-8 string holding JSON with the encryption context key-value pairs.</li><li><code>kms_key_id</code> - (Optional) Specifies the AWS KMS Key ARN to use for object encryption. This value is a fully qualified <strong>ARN</strong> of the KMS Key. If using <code>aws_kms_key</code>, use the exported <code>arn</code> attribute: <code>kms_key_id = aws_kms_key.foo.arn</code></li><li><code>metadata</code> - (Optional) Map of keys/values to provision metadata (will be automatically prefixed by <code>x-amz-meta-</code>, note that only lowercase label are currently supported by the AWS Go API).</li><li><code>metadata_directive</code> - (Optional) Specifies whether the metadata is copied from the source object or replaced with metadata provided in the request. Valid values are <code>COPY</code> and <code>REPLACE</code>.</li><li><code>object_lock_legal_hold_status</code> - (Optional) The <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/object-lock-overview.html#object-lock-legal-holds\">legal hold</a> status that you want to apply to the specified object. Valid values are <code>ON</code> and <code>OFF</code>.</li><li><code>object_lock_mode</code> - (Optional) Object lock <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/object-lock-overview.html#object-lock-retention-modes\">retention mode</a> that you want to apply to this object. Valid values are <code>GOVERNANCE</code> and <code>COMPLIANCE</code>.</li><li><code>object_lock_retain_until_date</code> - (Optional) Date and time, in <a href=\"https://tools.ietf.org/html/rfc3339#section-5.8\">RFC3339 format</a>, when this object's object lock will <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/dev/object-lock-overview.html#object-lock-retention-periods\">expire</a>.</li><li><code>request_payer</code> - (Optional) Confirms that the requester knows that they will be charged for the request. Bucket owners need not specify this parameter in their requests. For information about downloading objects from requester pays buckets, see Downloading Objects in Requestor Pays Buckets (https://docs.aws.amazon.com/AmazonS3/latest/dev/ObjectsinRequesterPaysBuckets.html) in the Amazon S3 Developer Guide. If included, the only valid value is <code>requester</code>.</li><li><code>server_side_encryption</code> - (Optional) Specifies server-side encryption of the object in S3. Valid values are <code>AES256</code> and <code>aws:kms</code>.</li><li><code>source_customer_algorithm</code> - (Optional) Specifies the algorithm to use when decrypting the source object (for example, AES256).</li><li><code>source_customer_key</code> - (Optional) Specifies the customer-provided encryption key for Amazon S3 to use to decrypt the source object. The encryption key provided in this header must be one that was used when the source object was created.</li><li><code>source_customer_key_md5</code> - (Optional) Specifies the 128-bit MD5 digest of the encryption key according to RFC 1321. Amazon S3 uses this header for a message integrity check to ensure that the encryption key was transmitted without error.</li><li><code>storage_class</code> - (Optional) Specifies the desired <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/API/API_CopyObject.html#AmazonS3-CopyObject-request-header-StorageClass\">storage class</a> for the object. Defaults to <code>STANDARD</code>.</li><li><code>tagging_directive</code> - (Optional) Specifies whether the object tag-set are copied from the source object or replaced with tag-set provided in the request. Valid values are <code>COPY</code> and <code>REPLACE</code>.</li><li><code>tags</code> - (Optional) Map of tags to assign to the object. If configured with a provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a> present, tags with matching keys will overwrite those defined at the provider-level.</li><li><code>website_redirect</code> - (Optional) Specifies a target URL for <a href=\"http://docs.aws.amazon.com/AmazonS3/latest/dev/how-to-page-redirect.html\">website redirect</a>.</li></ul><h3 id=\"grant\">grant</h3><p>-&gt; For more information on header grants, see the Amazon Simple Storage Service (S3) <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/API/API_PutObjectAcl.html\">API Reference: PutObjectAcl</a>.</p><p>This configuration block has the following required arguments:</p><ul><li><code>permissions</code> - (Required) List of permissions to grant to grantee. Valid values are <code>READ</code>, <code>READ_ACP</code>, <code>WRITE_ACP</code>, <code>FULL_CONTROL</code>.</li><li><code>type</code> - (Required) - Type of grantee. Valid values are <code>CanonicalUser</code>, <code>Group</code>, and <code>AmazonCustomerByEmail</code>.</li></ul><p>This configuration block has the following optional arguments (one of the three is required):</p><ul><li><code>email</code> - (Optional) Email address of the grantee. Used only when <code>type</code> is <code>AmazonCustomerByEmail</code>.  </li><li><code>id</code> - (Optional) Canonical user ID of the grantee. Used only when <code>type</code> is <code>CanonicalUser</code>.  </li><li><code>uri</code> - (Optional) URI of the grantee group. Used only when <code>type</code> is <code>Group</code>.</li></ul><p>-&gt; <strong>Note:</strong> Terraform ignores all leading <code>/</code>s in the object's <code>key</code> and treats multiple <code>/</code>s in the rest of the object's <code>key</code> as a single <code>/</code>, so values of <code>/index.html</code> and <code>index.html</code> correspond to the same S3 object as do <code>first//second///third//</code> and <code>first/second/third/</code>.</p>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute Reference</h2><p>This resource exports the following attributes in addition to the arguments above:</p><ul><li><code>checksum_crc32</code> - The base64-encoded, 32-bit CRC32 checksum of the object.</li><li><code>checksum_crc32c</code> - The base64-encoded, 32-bit CRC32C checksum of the object.</li><li><code>checksum_sha1</code> - The base64-encoded, 160-bit SHA-1 digest of the object.</li><li><code>checksum_sha256</code> - The base64-encoded, 256-bit SHA-256 digest of the object.</li><li><code>etag</code> - ETag generated for the object (an MD5 sum of the object content). For plaintext objects or objects encrypted with an AWS-managed key, the hash is an MD5 digest of the object data. For objects encrypted with a KMS key or objects created by either the Multipart Upload or Part Copy operation, the hash is not an MD5 digest, regardless of the method of encryption. More information on possible values can be found on <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/API/RESTCommonResponseHeaders.html\">Common Response Headers</a>.</li><li><code>expiration</code> - If the object expiration is configured, this attribute will be set.</li><li><code>id</code> - The <code>key</code> of the resource supplied above.</li><li><code>last_modified</code> - Returns the date that the object was last modified, in <a href=\"https://tools.ietf.org/html/rfc3339#section-5.8\">RFC3339 format</a>.</li><li><code>request_charged</code> - If present, indicates that the requester was successfully charged for the request.</li><li><code>source_version_id</code> - Version of the copied object in the source bucket.</li><li><code>tags_all</code> - Map of tags assigned to the resource, including those inherited from the provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a>.</li><li><code>version_id</code> - Version ID of the newly created copy.</li></ul>", "description": "<h1 id=\"resource-aws_s3_object_copy\">Resource: aws_s3_object_copy</h1><p>Provides a resource for copying an S3 object.</p>"}