{"resource-aws-servicecatalog-provisioned-product": "<h1 id=\"resource-aws_servicecatalog_provisioned_product\">Resource: aws_servicecatalog_provisioned_product</h1><p>This resource provisions and manages a Service Catalog provisioned product.</p><p>A provisioned product is a resourced instance of a product. For example, provisioning a product based on a CloudFormation template launches a CloudFormation stack and its underlying resources.</p><p>Like this resource, the <code>aws_servicecatalog_record</code> data source also provides information about a provisioned product. Although a Service Catalog record provides some overlapping information with this resource, a record is tied to a provisioned product event, such as provisioning, termination, and updating.</p><p>-&gt; <strong>Tip:</strong> If you include conflicted keys as tags, AWS will report an error, \"Parameter validation failed: Missing required parameter in Tags[N]:Value\".</p><p>-&gt; <strong>Tip:</strong> A \"provisioning artifact\" is also referred to as a \"version.\" A \"distributor\" is also referred to as a \"vendor.\"</p>", "example-usage": "<h2 id=\"example-usage\">Example Usage</h2><h3 id=\"basic-usage\">Basic Usage</h3><p>terraform<br />resource \"aws_servicecatalog_provisioned_product\" \"example\" {<br />  name                       = \"example\"<br />  product_name               = \"Example product\"<br />  provisioning_artifact_name = \"Example version\"</p><p>provisioning_parameters {<br />    key   = \"foo\"<br />    value = \"bar\"<br />  }</p><p>tags = {<br />    foo = \"bar\"<br />  }<br />}<br /></p>", "argument-reference": "<h2 id=\"argument-reference\">Argument Reference</h2><p>The following arguments are required:</p><ul><li><code>name</code> - (Required) User-friendly name of the provisioned product.</li></ul><p>The following arguments are optional:</p><ul><li><code>accept_language</code> - (Optional) Language code. Valid values: <code>en</code> (English), <code>jp</code> (Japanese), <code>zh</code> (Chinese). Default value is <code>en</code>.</li><li><code>ignore_errors</code> - (Optional) <em>Only applies to deleting.</em> If set to <code>true</code>, AWS Service Catalog stops managing the specified provisioned product even if it cannot delete the underlying resources. The default value is <code>false</code>.</li><li><code>notification_arns</code> - (Optional) Passed to CloudFormation. The SNS topic ARNs to which to publish stack-related events.</li><li><code>path_id</code> - (Optional) Path identifier of the product. This value is optional if the product has a default path, and required if the product has more than one path. To list the paths for a product, use <code>aws_servicecatalog_launch_paths</code>. When required, you must provide <code>path_id</code> or <code>path_name</code>, but not both.</li><li><code>path_name</code> - (Optional) Name of the path. You must provide <code>path_id</code> or <code>path_name</code>, but not both.</li><li><code>product_id</code> - (Optional) Product identifier. For example, <code>prod-abcdzk7xy33qa</code>. You must provide <code>product_id</code> or <code>product_name</code>, but not both.</li><li><code>product_name</code> - (Optional) Name of the product. You must provide <code>product_id</code> or <code>product_name</code>, but not both.</li><li><code>provisioning_artifact_id</code> - (Optional) Identifier of the provisioning artifact. For example, <code>pa-4abcdjnxjj6ne</code>. You must provide the <code>provisioning_artifact_id</code> or <code>provisioning_artifact_name</code>, but not both.</li><li><code>provisioning_artifact_name</code> - (Optional) Name of the provisioning artifact. You must provide the <code>provisioning_artifact_id</code> or <code>provisioning_artifact_name</code>, but not both.</li><li><code>provisioning_parameters</code> - (Optional) Configuration block with parameters specified by the administrator that are required for provisioning the product. See details below.</li><li><code>retain_physical_resources</code> - (Optional) <em>Only applies to deleting.</em> Whether to delete the Service Catalog provisioned product but leave the CloudFormation stack, stack set, or the underlying resources of the deleted provisioned product. The default value is <code>false</code>.</li><li><code>stack_set_provisioning_preferences</code> - (Optional) Configuration block with information about the provisioning preferences for a stack set. See details below.</li><li><code>tags</code> - (Optional) Tags to apply to the provisioned product. If configured with a provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a> present, tags with matching keys will overwrite those defined at the provider-level.</li></ul><h3 id=\"provisioning_parameters\">provisioning_parameters</h3><p>This argument supports the following arguments:</p><ul><li><code>key</code> - (Required) Parameter key.</li><li><code>use_previous_value</code> - (Optional) Whether to ignore <code>value</code> and keep the previous parameter value. Ignored when initially provisioning a product.</li><li><code>value</code> - (Optional) Parameter value.</li></ul><h3 id=\"stack_set_provisioning_preferences\">stack_set_provisioning_preferences</h3><p>All of the <code>stack_set_provisioning_preferences</code> are only applicable to a <code>CFN_STACKSET</code> provisioned product type.</p><p>This argument supports the following arguments:</p><ul><li><code>accounts</code> - (Optional) One or more AWS accounts that will have access to the provisioned product. The AWS accounts specified should be within the list of accounts in the STACKSET constraint. To get the list of accounts in the STACKSET constraint, use the <code>aws_servicecatalog_provisioning_parameters</code> data source. If no values are specified, the default value is all accounts from the STACKSET constraint.</li><li><code>failure_tolerance_count</code> - (Optional) Number of accounts, per region, for which this operation can fail before AWS Service Catalog stops the operation in that region. If the operation is stopped in a region, AWS Service Catalog doesn't attempt the operation in any subsequent regions. You must specify either <code>failure_tolerance_count</code> or <code>failure_tolerance_percentage</code>, but not both. The default value is 0 if no value is specified.</li><li><code>failure_tolerance_percentage</code> - (Optional) Percentage of accounts, per region, for which this stack operation can fail before AWS Service Catalog stops the operation in that region. If the operation is stopped in a region, AWS Service Catalog doesn't attempt the operation in any subsequent regions. When calculating the number of accounts based on the specified percentage, AWS Service Catalog rounds down to the next whole number. You must specify either <code>failure_tolerance_count</code> or <code>failure_tolerance_percentage</code>, but not both.</li><li><code>max_concurrency_count</code> - (Optional) Maximum number of accounts in which to perform this operation at one time. This is dependent on the value of <code>failure_tolerance_count</code>. <code>max_concurrency_count</code> is at most one more than the <code>failure_tolerance_count</code>. Note that this setting lets you specify the maximum for operations. For large deployments, under certain circumstances the actual number of accounts acted upon concurrently may be lower due to service throttling. You must specify either <code>max_concurrency_count</code> or <code>max_concurrency_percentage</code>, but not both.</li><li><code>max_concurrency_percentage</code> - (Optional) Maximum percentage of accounts in which to perform this operation at one time. When calculating the number of accounts based on the specified percentage, AWS Service Catalog rounds down to the next whole number. This is true except in cases where rounding down would result is zero. In this case, AWS Service Catalog sets the number as 1 instead. Note that this setting lets you specify the maximum for operations. For large deployments, under certain circumstances the actual number of accounts acted upon concurrently may be lower due to service throttling. You must specify either <code>max_concurrency_count</code> or <code>max_concurrency_percentage</code>, but not both.</li><li><code>regions</code> - (Optional) One or more AWS Regions where the provisioned product will be available. The specified regions should be within the list of regions from the STACKSET constraint. To get the list of regions in the STACKSET constraint, use the <code>aws_servicecatalog_provisioning_parameters</code> data source. If no values are specified, the default value is all regions from the STACKSET constraint.</li></ul>", "attribute-reference": "<h2 id=\"attribute-reference\">Attribute Reference</h2><p>This resource exports the following attributes in addition to the arguments above:</p><ul><li><code>arn</code> - ARN of the provisioned product.</li><li><code>cloudwatch_dashboard_names</code> - Set of CloudWatch dashboards that were created when provisioning the product.</li><li><code>created_time</code> - Time when the provisioned product was created.</li><li><code>id</code> - Provisioned Product ID.</li><li><code>last_provisioning_record_id</code> - Record identifier of the last request performed on this provisioned product of the following types: <code>ProvisionedProduct</code>, <code>UpdateProvisionedProduct</code>, <code>ExecuteProvisionedProductPlan</code>, <code>TerminateProvisionedProduct</code>.</li><li><code>last_record_id</code> - Record identifier of the last request performed on this provisioned product.</li><li><code>last_successful_provisioning_record_id</code> - Record identifier of the last successful request performed on this provisioned product of the following types: <code>ProvisionedProduct</code>, <code>UpdateProvisionedProduct</code>, <code>ExecuteProvisionedProductPlan</code>, <code>TerminateProvisionedProduct</code>.</li><li><code>launch_role_arn</code> - ARN of the launch role associated with the provisioned product.</li><li><code>outputs</code> - The set of outputs for the product created.<ul><li><code>description</code> -  The description of the output.</li><li><code>key</code> - The output key.</li><li><code>value</code> - The output value.</li></ul></li><li><code>status</code> - Current status of the provisioned product. See meanings below.</li><li><code>status_message</code> - Current status message of the provisioned product.</li><li><code>tags_all</code> - Map of tags assigned to the resource, including those inherited from the provider <a href=\"https://registry.terraform.io/providers/hashicorp/aws/latest/docs#default_tags-configuration-block\"><code>default_tags</code> configuration block</a>.</li><li><code>type</code> - Type of provisioned product. Valid values are <code>CFN_STACK</code> and <code>CFN_STACKSET</code>.</li></ul><h3 id=\"status-meanings\"><code>status</code> Meanings</h3><ul><li><code>AVAILABLE</code> - Stable state, ready to perform any operation. The most recent operation succeeded and completed.</li><li><code>UNDER_CHANGE</code> - Transitive state. Operations performed might not have valid results. Wait for an <code>AVAILABLE</code> status before performing operations.</li><li><code>TAINTED</code> - Stable state, ready to perform any operation. The stack has completed the requested operation but is not exactly what was requested. For example, a request to update to a new version failed and the stack rolled back to the current version.</li><li><code>ERROR</code> - An unexpected error occurred. The provisioned product exists but the stack is not running. For example, CloudFormation received a parameter value that was not valid and could not launch the stack.</li><li><code>PLAN_IN_PROGRESS</code> - Transitive state. The plan operations were performed to provision a new product, but resources have not yet been created. After reviewing the list of resources to be created, execute the plan. Wait for an <code>AVAILABLE</code> status before performing operations.</li></ul>", "timeouts": "<h2 id=\"timeouts\">Timeouts</h2><p><a href=\"https://developer.hashicorp.com/terraform/language/resources/syntax#operation-timeouts\">Configuration options</a>:</p><ul><li><code>create</code> - (Default <code>30m</code>)</li><li><code>read</code> - (Default <code>10m</code>)</li><li><code>update</code> - (Default <code>30m</code>)</li><li><code>delete</code> - (Default <code>30m</code>)</li></ul>", "import": "<h2 id=\"import\">Import</h2><p>In Terraform v1.5.0 and later, use an <a href=\"https://developer.hashicorp.com/terraform/language/import\"><code>import</code> block</a> to import <code>aws_servicecatalog_provisioned_product</code> using the provisioned product ID. For example:</p><p><code>terraformimport {  to = aws_servicecatalog_provisioned_product.example  id = \"pp-dnigbtea24ste\"}</code></p><p>Using <code>terraform import</code>, import <code>aws_servicecatalog_provisioned_product</code> using the provisioned product ID. For example:</p><p><code>console% terraform import aws_servicecatalog_provisioned_product.example pp-dnigbtea24ste</code></p>", "description": "<h1 id=\"resource-aws_servicecatalog_provisioned_product\">Resource: aws_servicecatalog_provisioned_product</h1><p>This resource provisions and manages a Service Catalog provisioned product.</p><p>A provisioned product is a resourced instance of a product. For example, provisioning a product based on a CloudFormation template launches a CloudFormation stack and its underlying resources.</p><p>Like this resource, the <code>aws_servicecatalog_record</code> data source also provides information about a provisioned product. Although a Service Catalog record provides some overlapping information with this resource, a record is tied to a provisioned product event, such as provisioning, termination, and updating.</p><p>-&gt; <strong>Tip:</strong> If you include conflicted keys as tags, AWS will report an error, \"Parameter validation failed: Missing required parameter in Tags[N]:Value\".</p><p>-&gt; <strong>Tip:</strong> A \"provisioning artifact\" is also referred to as a \"version.\" A \"distributor\" is also referred to as a \"vendor.\"</p>"}